<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

when drunkin mudders cross paths

POV: Sabin

Log Rating: 0.5000

A dark and stormy night! Two battling teams! One victor! Whose cuisine
reigns supreme!?!

282H 18V 4820187X 619C Mem:2 Exits:ESW>
Fioricet flies south.
You follow Fioricet south.
West Bank of the Vingaard
Fioricet, Increasing the Pain is standing here. (flying)
282H 17V 4820187X 619C Mem:2 Exits:NS>
Fioricet flies south.
You follow Fioricet south.
Near a Tollhouse
Fioricet, Increasing the Pain is standing here. (flying)
282H 16V 4820187X 619C Mem:2 Exits:NW>
Fioricet flies west.
You follow Fioricet west.
The Tollhouse
A wooden sign on a pole directs travellers to their destinations.
Fioricet, Increasing the Pain is standing here. (flying)
282H 15V 4820187X 619C Mem:2 Exits:NESWU>
Fioricet walks over to a wooden bench and takes a seat.
282H 15V 4820187X 619C Mem:2 Exits:NESWU> re
You walk over to a wooden bench and take a seat.
282H 15V 4820187X 619C Mem:1 Exits:NESWU> med
You find yourself still too distracted to meditate properly.
282H 15V 4820187X 619C Mem:1 Exits:NESWU> m
Spells currently memorized:
1: [ 2]aid [ 2]bless [ 1]create food
[ 1]create water [ 1]cure light [ 2]know alignment
[ 1]restore strength
2: [ 4]blindness [ 1]cure blindness [ 1]detect magic
[ 1]remove curse [ 2]silence
3: [ 1]cause serious [ 4]cure serious [ 1]fear
[ 2]protection from evil [ 1]remove poison
4: [ 2]dispel magic [ 1]free action [ 3]hold person
[ 1]prayer [ 1]sanctuary
5: [ 2]cause critical [ 3]cure critical
6: [ 4]harm
Spells being memorized:
2: [ 1]light
You estimate your studies will complete in 1 (game) hour.
Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-2
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo flies in from the south.
Waethzogo studies the area intently.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo says 'HEY'
282H 15V 4820187X 619C Mem:1 Exits:NESWU> l
The Tollhouse
A wooden sign on a pole directs travellers to their destinations.
You sense a life form.
Sir Waethzogo, Pretty Pirate in Pink is standing here. (flying)
(flying) Fioricet, Increasing the Pain is stretched out on a wooden
bench.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Fioricet bows deeply.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo says 'give me al lyour money'
282H 15V 4820187X 619C Mem:1 Exits:NESWU> sc
You are Sabin the Male Hylar Dwarf, a level 26 Cleric.
You are 19 years old.
You have 282(315) hit and 15(110) movement points.
Your behaviour has been Good.
The warmth of good envelopes your soul.
You have scored 23179813 exp, and have 1919(954) steel coins.
You need 4820187 more experience to advance.
You have never died.
You have been connected for 4 hour(s) and 22 minute(s).
You have been playing for 1 day(s), 10 hour(s) and 29 minute(s).
Your equipment is currently being concealed.
You are resting.
You are flying.
You are following Fioricet.
You are affected by the following:
recuperate
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo says 'righ tnow'
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Fioricet snickers softly.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
A large trade caravan slowly lumbers in from the south.
282H 15V 4820187X 619C Mem:1 Exits:NESWU> TICK IN 10 SECONDS.
gt TIC IN 10
You tell your group 'TIC IN 10'
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
A large trade caravan slowly lumbers off towards the west.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo says 'HEY'
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Waethzogo says 'IM NOT KIDN'
282H 15V 4820187X 619C Mem:1 Exits:NESWU> gt target waethzogo
You tell your group 'target waethzogo'
282H 15V 4820187X 619C Mem:1 Exits:NESWU> l
Waethzogo says 'GIVM EA LAL YOUR MONEY RIGHT NOW'
282H 15V 4820187X 619C Mem:1 Exits:NESWU> The Tollhouse
A wooden sign on a pole directs travellers to their destinations.
You sense a life form.
Sir Waethzogo, Pretty Pirate in Pink is standing here. (flying)
(flying) Fioricet, Increasing the Pain is stretched out on a wooden
bench.
282H 15V 4820187X 619C Mem:1 Exits:NESWU>
Your studies complete, you close your prayerbook with a smile.
Timer now at 61 secs.
315H 82V 4820187X 619C Exits:NESWU>
Fioricet tells your group 'agree if they attack'
315H 82V 4820187X 619C Exits:NESWU> nod waethzogo
You nod at Waethzogo.
315H 82V 4820187X 619C Exits:NESWU> say he is a pirate
Fioricet tells your group 'v's?'
315H 82V 4820187X 619C Exits:NESWU> You say 'he is a pirate'
315H 82V 4820187X 619C Exits:NESWU>
*someone pulls his bandit's mask over his head.
315H 82V 4820187X 619C Exits:NESWU> gt 82
You tell your group '82'
315H 82V 4820187X 619C Exits:NESWU> st
You stand up.
315H 82V 4820187X 619C Exits:NESWU>
*Waethzogo poos on you
315H 82V 4820187X 619C Exits:NESWU>
Waethzogo viciously rams his skull into your face, knocking you
backward and breaking your nose with a sickening crunch.
266H 82V 4820187X 619C [Sabin:Good] [Waethzogo:Perfect] Exits:NESWU>
Waethzogo smites YOU extremely hard.
Waethzogo pierces YOU extremely hard.
You miss Waethzogo with your crush.
231H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:Perfect] Exits:NESWU>
Fioricet stands up.
231H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:Perfect] Exits:NESWU>
Fioricet misses Waethzogo with his cleave.
231H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:Perfect] Exits:NESWU>
Fioricet massacres Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
Waethzogo massacres YOU with his smite.
Waethzogo massacres YOU with his pierce.
You crush Waethzogo hard.
188H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:V.Good] Exits:NESWU>
CombatAlarm...
group
188H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:V.Good] Exits:NESWU>
Waethzogo says 'ATTACK!'
188H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:V.Good] Exits:NESWU> st
You are already standing.
188H 82V 4820187X 619C [Sabin:Fair] [Waethzogo:V.Good] Exits:NESWU>
Fioricet comes to your rescue! You're thankful, but a bit dazed.
188H 82V 4820187X 619C Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
188H 82V 4820187X 619C Exits:NESWU>
Waethzogo smites Fioricet very hard.
Waethzogo pierces Fioricet extremely hard.
Fioricet's mightly cleave almost cuts Waethzogo in two.
Fioricet massacres Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
Waethzogo cheers for his own deeds, past and future.
188H 82V 4820187X 619C Exits:NESWU>
Someone focuses harshly on you and utters the words, 'hold person'.
You feel a slight chill.
188H 82V 4820187X 619C Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
188H 82V 4820187X 619C Exits:NESWU> cast 'heal' me
You utter the words, 'heal'
You heal yourself.
Your entire body tingles for a few seconds.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU> ass
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo smites Fioricet extremely hard.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo very hard.
Fioricet misses Waethzogo with his pierce.
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Fioricet tells your group 'blind it'
313H 82V 4820187X 619C Mem:3 Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU> CombatAlarm...
group
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C Mem:3 Exits:NESWU> You attempt to assist
Fioricet.
You miss Waethzogo with your crush.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Someone focuses harshly on you and utters the words, 'hold person'.
You feel a slight chill.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU> bt
Waethzogo cheers for his own deeds, past and future.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
You miss Waethzogo with your crush.
Waethzogo smites Fioricet extremely hard.
Waethzogo pierces Fioricet extremely hard.
Fioricet cleaves Waethzogo very hard.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU> cast 'blind' waethzogo
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU> Huh?!
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:3
Exits:NESWU> You utter the words, 'blindness'
The magic fails!
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:4
Exits:NESWU>
Waethzogo says 'WHATS PUI NOW'
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Good] Mem:4
Exits:NESWU>
Waethzogo smites Fioricet extremely hard.
Waethzogo pierces Fioricet extremely hard.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:4
Exits:NESWU> CombatAlarm...
group
Waethzogo says 'GIVE ME YOUR MONEY'
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:4
Exits:NESWU> cast 'blind' waethzogo
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:4
Exits:NESWU>
Someone focuses harshly on you and utters the words, 'hold person'.
You feel a slight chill.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:4
Exits:NESWU> You utter the words, 'blindness'
Waethzogo seems to be blinded!
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:5
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:5
Exits:NESWU>
Waethzogo misses Fioricet with his smite.
Waethzogo pierces Fioricet extremely hard.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:5
Exits:NESWU> cast 'heal' fioricet
Waethzogo growls.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:5
Exits:NESWU> You utter the words, 'heal'
You heal Fioricet.
313H 82V 4820187X 619C [Fioricet:V.Good] [Waethzogo:Fair] Mem:6
Exits:NESWU>
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Fair] Mem:6
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Fair] Mem:6
Exits:NESWU> CombatAlarm...
group
Waethzogo suddenly lunges forward, slamming his skull into Fioricet's
face with a sickening crunch.
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Fair] Mem:6
Exits:NESWU> gt gimme milky
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Fair] Mem:6
Exits:NESWU> You tell your group 'gimme milky'
313H 82V 4820187X 619C [Fioricet:Good] [Waethzogo:Fair] Mem:6
Exits:NESWU>
You crush Waethzogo hard.
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:6
Exits:NESWU> TICK IN 10 SECONDS.
gt TIC IN 10
You tell your group 'TIC IN 10'
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:6
Exits:NESWU>
Someone says 'dont defy bandit law'
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:6
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:6
Exits:NESWU> cast 'hold person' waethzogo
You utter the words, 'hold person'
The magic fails!
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:7
Exits:NESWU>
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet misses Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Fair] Mem:7
Exits:NESWU> CombatAlarm...
group
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
313H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU>
Someone focuses harshly on you and utters some strange words.
Nihilism slowly fades into existence.
YOU'RE HIT. A lightning bolt from Nihilism has reached its goal.
That Really did HURT!
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU> Your group of 2 members consists of:
Sabin fair rested fighting Y N N Y 1 7
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU>
You crush Waethzogo hard.
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo very hard.
Fioricet misses Waethzogo with his pierce.
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU>
Fioricet quickly steps aside, avoiding Waethzogo's headbutt.
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU> st
You are already standing.
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
200H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:7
Exits:NESWU> cast 'heal' me
You utter the words, 'heal'
You heal yourself.
Your entire body tingles for a few seconds.
314H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:9
Exits:NESWU>
Someone focuses harshly on you and utters some strange words.
Nihilism slowly fades into existence.
YOU'RE HIT. A lightning bolt from Nihilism has reached its goal.
254H 82V 4820187X 619C [Fioricet:Fair] [Waethzogo:Bad] Mem:9
Exits:NESWU>
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet massacres Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
268H 107V 4820187X 619C [Fioricet:Bad] [Waethzogo:Bad] Mem:9
Exits:NESWU> CombatAlarm...
group
Fioricet tells your group 'heal me'
268H 107V 4820187X 619C [Fioricet:Bad] [Waethzogo:Bad] Mem:9
Exits:NESWU> Your group of 2 members consists of:
Sabin good rested fighting Y N N Y 1 9
268H 107V 4820187X 619C [Fioricet:Bad] [Waethzogo:Bad] Mem:9
Exits:NESWU> cast 'heal' fioricet
Someone focuses harshly on you and utters some strange words.
Nihilism slowly fades into existence.
YOU'RE HIT. A lightning bolt from Nihilism has reached its goal.
208H 107V 4820187X 619C [Fioricet:Bad] [Waethzogo:Bad] Mem:9
Exits:NESWU> You crush Waethzogo very hard.
Waethzogo smites Fioricet extremely hard.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
You utter the words, 'heal'
You heal Fioricet.
208H 107V 4820187X 619C [Fioricet:V.Good] [Waethzogo:V.Bad] Mem:10
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
208H 107V 4820187X 619C [Fioricet:V.Good] [Waethzogo:V.Bad] Mem:10
Exits:NESWU>
Waethzogo suddenly lunges forward, slamming his skull into Fioricet's
face with a sickening crunch.
Eyes streaming, Fioricet reels about in a daze.
208H 107V 4820187X 619C [Fioricet:V.Good] [Waethzogo:V.Bad] Mem:10
Exits:NESWU> cast 'hold person'
Waethzogo misses Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet misses Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
208H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:V.Bad] Mem:10
Exits:NESWU> You utter the words, 'hold person'
The magic fails!
208H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:V.Bad] Mem:11
Exits:NESWU> CombatAlarm...
group
cast 'cure crit' me
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet misses Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
208H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:11
Exits:NESWU> Your group of 2 members consists of:
Sabin fair rested fighting Y N N Y 1 11
208H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:11
Exits:NESWU> You utter the words, 'cure critical'
Large open gashes on your body stop bleeding and heal.
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:12
Exits:NESWU> cast 'cure crit' fioricet
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet cleaves Waethzogo extremely hard.
Fioricet misses Waethzogo with his pierce.
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:12
Exits:NESWU>
Waethzogo suddenly lunges forward, slamming his skull into Fioricet's
face with a sickening crunch.
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:12
Exits:NESWU> CombatAlarm...
group
You utter the words, 'cure critical'
291H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:V.Bad] Mem:14
Exits:NESWU> m
Waethzogo massacres Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet misses Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:14
Exits:NESWU>
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:14
Exits:NESWU> Your group of 2 members consists of:
Sabin v.good rested fighting Y N N Y 1 14
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:14
Exits:NESWU> Spells currently memorized:
1: [ 2]aid [ 2]bless [ 1]create food
[ 1]create water [ 1]cure light [ 2]know alignment
[ 1]restore strength
2: [ 2]blindness [ 1]cure blindness [ 1]detect magic
[ 1]light [ 1]remove curse [ 2]silence
3: [ 1]cause serious [ 4]cure serious [ 1]fear
[ 2]protection from evil [ 1]remove poison
4: [ 2]dispel magic [ 1]free action [ 1]hold person
[ 1]prayer [ 1]sanctuary
5: [ 2]cause critical [ 1]cure critical
Spells being memorized:
2: [ 2]blindness
4: [ 2]hold person
5: [ 2]cure critical
6: [ 4]harm
You estimate your studies will complete in 14 (game) hours.
Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-2
291H 107V 4820187X 619C [Fioricet:Fair] [Waethzogo:V.Bad] Mem:14
Exits:NESWU> cast 'cure crit' fioricet
You utter the words, 'cure critical'
291H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:V.Bad] Mem:15
Exits:NESWU>
Waethzogo misses Fioricet with his smite.
Waethzogo massacres Fioricet with his pierce.
Fioricet massacres Waethzogo with his cleave.
Fioricet misses Waethzogo with his pierce.
291H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:V.Bad] Mem:15
Exits:NESWU> CombatAlarm...
group
Fioricet delivers a low kick to Waethzogo, knocking him off balance.
291H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:Awful] Mem:15
Exits:NESWU> cast 'cause crit'
291H 107V 4820187X 619C [Fioricet:Good] [Waethzogo:Awful] Mem:15
Exits:NESWU>
Waethzogo disappears.
291H 107V 4820187X 619C Mem:15 Exits:NESWU> Unexpected end of input:
You must specify a character to perform that action on.
291H 107V 4820187X 619C Mem:15 Exits:NESWU> gt wtf
You tell your group 'wtf'
291H 107V 4820187X 619C Mem:15 Exits:NESWU> l
The Tollhouse
A wooden sign on a pole directs travellers to their destinations.
You sense a life form.
Fioricet, Increasing the Pain is standing here. (flying)
291H 107V 4820187X 619C Mem:15 Exits:NESWU> gt god multi wtf was that?

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
