<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   You step aside as Kranthian tries to bash you, causing him to tumble
   and fall face down.

   POV: Marcus

   Log Rating: -0.1428

   I was actually ambushing Juventus because he stabbed me (for 90hp) and
   called me mean names. Kranthian really surprised me, but I went for it.
   2 webs missed, but a hold landed. He got the loot!! What a little
   bastard eh.

   258H 109V 6624536X 273C Mem:4 Exits:ES>
   Kranthian flies in from the east.
   258H 109V 6624536X 273C Mem:4 Exits:ES>
   Kranthian flies south.
   258H 109V 6624536X 273C Mem:4 Exits:ES>
   Kranthian flies in from the south.
   258H 109V 6624536X 273C Mem:4 Exits:ES>
   You are sent sprawling as Kranthian crashes into you.
   240H 109V 6624536X 273C [Marcus:V.Good] [Kranthian:Perfect] Mem:4
   Exits:ES>
   Kranthian massacres YOU with his crush.
   You miss Kranthian with your crush.
   219H 109V 6624536X 273C [Marcus:Good] [Kranthian:Perfect] Mem:4
   Exits:ES> order all.young bash kranthian
   Kranthian crushes YOU extremely hard.
   You miss Kranthian with your crush.
   201H 109V 6624536X 273C [Marcus:Good] [Kranthian:Perfect] Mem:4
   Exits:ES> Kranthian steps aside as a young adventurer attempts a bash,
   stumbles, and falls flat on his face.
   Kranthian steps aside as a young adventurer attempts a bash, stumbles,
   and falls flat on his face.
   Kranthian steps aside as a young adventurer attempts a bash, stumbles,
   and falls flat on his face.
   You issue the order 'bash kranthian'.
   201H 109V 6624536X 273C [Marcus:Good] [Kranthian:Perfect] Mem:4
   Exits:ES> st
   You stand up.
   201H 109V 6624536X 273C [Marcus:Good] [Kranthian:Perfect] Mem:4
   Exits:ES>
   You are sent sprawling as Kranthian crashes into you.
   183H 109V 6624536X 273C [Marcus:Fair] [Kranthian:Perfect] Mem:4
   Exits:ES>
   A young adventurer misses Kranthian with his hit.
   A young adventurer misses Kranthian with his hit.
   A young adventurer misses Kranthian with his hit.
   Kranthian crushes YOU very hard.
   You miss Kranthian with your crush.
   169H 109V 6624536X 273C [Marcus:Fair] [Kranthian:Perfect] Mem:4
   Exits:ES> order all.young bash kranthian
   A young adventurer misses Kranthian with his hit.
   A young adventurer misses Kranthian with his hit.
   A young adventurer misses Kranthian with his hit.
   Kranthian crushes YOU extremely hard.
   You miss Kranthian with your crush.
   153H 109V 6624536X 273C [Marcus:Fair] [Kranthian:Perfect] Mem:4
   Exits:ES> You issue the order 'bash kranthian'.
   153H 109V 6624536X 273C [Marcus:Fair] [Kranthian:Perfect] Mem:4
   Exits:ES> order all.young st
   A young adventurer stands up.
   A young adventurer stands up.
   A young adventurer stands up.
   You issue the order 'st'.
   153H 109V 6624536X 273C [Marcus:Fair] [Kranthian:Perfect] Mem:4
   Exits:ES>
   A young adventurer hits Kranthian very hard.
   A young adventurer hits Kranthian very hard.
   A young adventurer hits Kranthian very hard.
   Kranthian crushes YOU extremely hard.
   You should probably stand up!
   You miss Kranthian with your crush.
   136H 109V 6624536X 273C [Marcus:Fair] [Kranthian:V.Good] Mem:4
   Exits:ES> order all.young bash kranthian
   Kranthian steps aside as a young adventurer attempts a bash, stumbles,
   and falls flat on his face.
   Kranthian steps aside as a young adventurer attempts a bash, stumbles,
   and falls flat on his face.
   A young adventurer crashes into Kranthian in a thundering collision,
   knocking him to the ground!
   You issue the order 'bash kranthian'.
   136H 109V 6624536X 273C [Marcus:Fair] [Kranthian:V.Good] Mem:4
   Exits:ES> fl
   You can't do that while sitting.
   136H 109V 6624536X 273C [Marcus:Fair] [Kranthian:V.Good] Mem:4
   Exits:ES> st
   You stand up.
   136H 109V 6624536X 273C [Marcus:Fair] [Kranthian:V.Good] Mem:4
   Exits:ES> fl
   You flee head over heels.
   Intersection: Sword Street and Northwestern Avenue
   136H 108V 6624536X 273C Mem:4 Exits:NESW> w
   Sword Street
   A merchant is passing through here, on his way to the marketplace.
   Kranthian the Male Wild Elf is sitting here, fighting a young
   adventurer. (flying)
   A young adventurer is sitting here, fighting Kranthian.
   A young adventurer is sitting here, fighting Kranthian.
   A young adventurer is standing here, fighting Kranthian.
   136H 107V 6624536X 273C Mem:4 Exits:ES> c 'web' kranthian
   Kranthian crushes a young adventurer very hard.
   A young adventurer misses Kranthian with his hit.
   A young adventurer misses Kranthian with his hit.
   A young adventurer hits Kranthian very hard.
   136H 107V 6624536X 273C Mem:4 Exits:ES> You utter the words, 'web'
   Your webbing narrowly misses him.
   136H 107V 6624536X 273C Mem:5 Exits:ES> c 'web' kranthian
   Kranthian crushes a young adventurer very hard.
   A young adventurer hits Kranthian hard.
   A young adventurer hits Kranthian very hard.
   A young adventurer misses Kranthian with his hit.
   136H 107V 6624536X 273C Mem:5 Exits:ES> You utter the words, 'web'
   Your webbing narrowly misses him.
   136H 107V 6624536X 273C Mem:5 Exits:ES>
   Kranthian stands up.
   136H 107V 6624536X 273C Mem:5 Exits:ES>
   Kranthian panics, and attempts to flee.
   Kranthian flies east.
   136H 107V 6624536X 273C Mem:5 Exits:ES>
   Kranthian flies in from the east.
   c 'web' kranthian
   136H 107V 6624536X 273C Mem:5 Exits:ES>
   You are sent sprawling as Kranthian crashes into you.
   118H 107V 6624536X 273C [Marcus:Bad] [Kranthian:Good] Mem:5 Exits:ES>
   Kranthian crushes YOU extremely hard.
   You miss Kranthian with your crush.
   102H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   order all.young bash kranthian
   Kranthian crushes YOU extremely hard.
   You miss Kranthian with your crush.
   84H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   TICK IN 10 SECONDS.
   gt tick in 10
   Kranthian crushes YOU very hard.
   You miss Kranthian with your crush.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   You can't do this sitting!
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   Kranthian steps aside as a young adventurer attempts a bash, stumbles,
   and falls flat on his face.
   You issue the order 'bash kranthian'.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   ost
   You are not a member of a group.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   order all.young bash kranthian
   Huh?!
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   You issue the order 'bash kranthian'.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   st
   You stand up.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   You step aside as Kranthian tries to bash you, causing him to tumble
   and fall face down.
   70H 107V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   A young adventurer hits Kranthian extremely hard.
   Kranthian crushes YOU very hard.
   73H 140V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   order all.young bash kranthian
   You issue the order 'bash kranthian'.
   73H 140V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   st
   You are already standing.
   73H 140V 6624536X 273C [Marcus:V.Bad] [Kranthian:Good] Mem:5 Exits:ES>
   fl
   You flee head over heels.
   Intersection: Sword Street and Northwestern Avenue
   73H 139V 6624536X 273C Mem:5 Exits:NESW> w
   Sword Street
   Kranthian the Male Wild Elf is sitting here, fighting a young
   adventurer. (flying)
   A merchant is passing through here, on his way to the marketplace.
   A young adventurer is sitting here.
   A young adventurer is sitting here.
   A young adventurer is sitting here, fighting Kranthian.
   73H 138V 6624536X 273C Mem:5 Exits:ES> c 'web' kranthian
   You can't remember how to cast that spell!
   73H 138V 6624536X 273C Mem:5 Exits:ES> c 'hold person' kranthian
   Kranthian massacres a young adventurer with his crush.
   A young adventurer hits Kranthian hard.
   73H 138V 6624536X 273C Mem:5 Exits:ES> You utter the words, 'hold
   person'
   Kranthian freezes in place.
   73H 138V 6624536X 273C Mem:6 Exits:ES> order all.young st
   A young adventurer hits Kranthian very hard.
   73H 138V 6624536X 273C Mem:6 Exits:ES> A young adventurer stands up.
   A young adventurer stands up.
   A young adventurer stands up.
   You issue the order 'st'.
   73H 138V 6624536X 273C Mem:6 Exits:ES> order all.young bash kranthian
   A young adventurer crashes into Kranthian in a thundering collision,
   knocking him to the ground!
   A young adventurer crashes into Kranthian in a thundering collision,
   knocking him to the ground!
   A young adventurer crashes into Kranthian in a thundering collision,
   knocking him to the ground!
   You issue the order 'bash kranthian'.
   73H 138V 6624536X 273C Mem:6 Exits:ES> c 'lightning bolt' kranthian
   You utter the words, 'lightning bolt'
   The lightning bolt hits Kranthian with full impact.
   73H 138V 6624536X 273C Mem:7 Exits:ES> c 'lightning bolt' kranthian
   A Palanthian guard arrives from the east.
   A young adventurer hits Kranthian extremely hard.
   A young adventurer hits Kranthian.
   A young adventurer hits Kranthian very hard.
   73H 138V 6624536X 273C Mem:7 Exits:ES> You utter the words, 'lightning
   bolt'
   The lightning bolt hits Kranthian with full impact.
   73H 138V 6624536X 273C Mem:7 Exits:ES> wat adventurer
   c 'lightning bolt' kranthian
   A young adventurer hits Kranthian very hard.
   A young adventurer hits Kranthian extremely hard.
   A young adventurer hits Kranthian very hard.
   73H 138V 6624536X 273C Mem:7 Exits:ES> You now watch a young
   adventurer.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:Bad**] Mem:7 Exits:ES> You utter the words, 'lightning
   bolt'
   The lightning bolt hits Kranthian with full impact.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:V.Bad**] Mem:8 Exits:ES> c 'lightning bolt' kranthian
   A young adventurer hits Kranthian extremely hard.
   A young adventurer hits Kranthian very hard.
   A young adventurer hits Kranthian very hard.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:V.Bad**] Mem:8 Exits:ES> You utter the words, 'lightning
   bolt'
   The lightning bolt hits Kranthian with full impact.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:Awful**] Mem:8 Exits:ES> c 'lightning bolt' kranthian
   A Palanthian guard leaves south.
   A young adventurer hits Kranthian very hard.
   A young adventurer hits Kranthian hard.
   A young adventurer hits Kranthian extremely hard.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:Awful**] Mem:8 Exits:ES> You can't remember how to cast
   that spell!
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:Awful**] Mem:8 Exits:ES> c 'force bolt' kranthian
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Kranthian.
   Kranthian is incapacitated and will slowly die, if not aided.
   Kranthian suffers from lack of blood, and the lack of a beating
   heart...
   You receive 0 experience.
   Kranthian is dead! R.I.P.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**]
   [**Kranthian:Dying**] Mem:9 Exits:ES> get all.coins corpse
   exa corpse
   The death cry of Kranthian echoes from somewhere nearby...
   Kranthian sinks gently to the ground.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**] Mem:9 Exits:ES>
   get all corpse
   Kranthian arrives from the south.
   c 'web' kranthian
   73H 138V 6624536X 273C [**a young adventurer:V.Good**] Mem:9 Exits:ES>
   The corpse doesn't seem to have what you are looking for.
   73H 138V 6624536X 273C [**a young adventurer:V.Good**] Mem:9 Exits:ES>
   Kranthian gets a small down feather from the corpse of Kranthian.
   Kranthian gets a silver mace with a rosewood handle from the corpse of
   Kranthian.
   Kranthian gets a shimmering purple bracelet from the corpse of
   Kranthian.
   Kranthian gets a red draconian bracelet from the corpse of Kranthian.
   Kranthian gets a gold belt from the corpse of Kranthian.
   Kranthian gets a scouting pack from the corpse of Kranthian.
   Kranthian gets a shield of the Black Lily from the corpse of Kranthian.
   Kranthian gets a pair of finely decorated armbands from the corpse of
   Kranthian.
   Kranthian gets a pair of green boots from the corpse of Kranthian.
   Kranthian gets a suit of copper plate mail from the corpse of
   Kranthian.
   Kranthian gets an alligator scale necklace from the corpse of
   Kranthian.
   Kranthian gets a blood red cape from the corpse of Kranthian.
   Kranthian gets an obsidian ring from the corpse of Kranthian.
   Kranthian gets a shiny dwarven ring from the corpse of Kranthian.
   Kranthian gets a crystal selenite bracer from the corpse of Kranthian.
   Kranthian gets a large first-aid kit from the corpse of Kranthian.
   Kranthian gets an oaken quarterstaff from the corpse of Kranthian.
   Kranthian gets a green marble chest from the corpse of Kranthian.
   Kranthian gets a gold and ruby necklace from the corpse of Kranthian.
   Kranthian gets a jug of oil from the corpse of Kranthian.
   Kranthian gets a glowing scroll of recall from the corpse of Kranthian.
   Kranthian gets a crystal shard necklace from the corpse of Kranthian.
   It's a pretty ghastly sight! Searching through the remains, you find:
   corpse (here) :
   a jug of oil
   73H 138V 6624536X 273C [**a young adventurer:V.Good**] Mem:9 Exits:ES>
   Kranthian leaves east.
   You get a jug of oil from the corpse of Kranthian.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
