<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Sparda/Slyther RIP

POV: Benedict

Log Rating: -0.1818

Two more "those dudes that sit in irc all day and don't do much of
anything other than steal from and harass random people" die.

331H 27V 13930775X 20C [**Beric:Perfect**] Exits:NESW> wBeric flies in
from the east.
Market Street West
This is the busy market street, filled with people, shops and stands.
People from all over Krynn come to this town for trade and other
business.
The town square is not to far to the east through the crowd. A small
path
to the north will take you to the Temple of Kalaman, while to the south
you
see a small building with a sign above the door.
Lord Beric Dondarrion, Nowclan's Twisted Firestarter is standing here.
(flying)
Sparda is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Lord Slyther, Warring Knight of Krynn is standing here.
Taloc, Fade to Black is standing here. (flying)
331H 26V 13930775X 20C [**Beric:Perfect**] Exits:NESW>
Beric kneels down and studies the ground.
331H 26V 13930775X 20C [**Beric:Perfect**] Exits:NESW> get putrid
packquaff putridYou get a putrid potion from a black suede backpack.
331H 26V 13930775X 20C [**Beric:Perfect**] Exits:NESW> You quaff a
putrid potion which dissolves.
You feel less tired.
331H 65V 13930775X 20C [**Beric:Perfect**] Exits:NESW> c 'harm'
spardaYou utter the words, 'harm'
You grab Sparda, who screams in pain.
331H 65V 13930775X 20C [Benedict:Perfect] [Sparda:Fair] Mem:3
Exits:NESW>
You stop watching Beric.
331H 65V 13930775X 20C [Benedict:Perfect] [Sparda:Fair] Mem:3
Exits:NESW>
Beric crashes into Sparda in a thundering collision, knocking him to
the ground!
331H 65V 13930775X 20C [Benedict:Perfect] [Sparda:Fair] Mem:3
Exits:NESW> c 'harm' sparda
Slyther slashes YOU very hard.
318H 65V 13930775X 20C [Benedict:V.Good] [Sparda:Fair] Mem:3
Exits:NESW>
Slyther slashes YOU very hard.
Slyther slashes YOU hard.
Beric massacres Sparda with his slash.
You miss Sparda with your bludgeon.
Sparda bludgeons YOU hard.
289H 65V 13930775X 20C [Benedict:Good] [Sparda:Fair] Mem:3 Exits:NESW>
You lost your concentration!
289H 65V 13930775X 20C [Benedict:Good] [Sparda:Fair] Mem:5 Exits:NESW>
Taloc appears to be dancing around the room.
289H 65V 13930775X 20C [Benedict:Good] [Sparda:Fair] Mem:5 Exits:NESW>
c 'harm' sparda
Slyther slashes YOU extremely hard.
Slyther slashes YOU hard.
Beric annihilates Sparda with his slash.
Sparda misses you with his bludgeon.
The white aura around your body fades.
276H 87V 13930775X 20C [Benedict:Good] [Sparda:Bad] Mem:5 Exits:NESW>
Taloc is continually trying to get behind you.
Hmmm...i wonder what he's up to?
276H 87V 13930775X 20C [Benedict:Good] [Sparda:Bad] Mem:5 Exits:NESW>
Slyther utters the words, 'brino'.
276H 87V 13930775X 20C [Benedict:Good] [Sparda:Bad] Mem:5 Exits:NESW>
Sparda stands up.
276H 87V 13930775X 20C [Benedict:Good] [Sparda:Bad] Mem:5 Exits:NESW>
Beric crashes into Sparda in a thundering collision, knocking him to
the ground!
You utter the words, 'harm'
You grab Sparda, who screams in pain.
276H 87V 13930775X 20C [Benedict:Good] [Sparda:Awful] Mem:6 Exits:NESW>
Taloc pierces YOU extremely hard.
261H 87V 13930775X 20C [Benedict:Good] [Sparda:Awful] Mem:6 Exits:NESW>
Taloc pierces YOU very hard.
Taloc pierces YOU.
Beric massacres Sparda with his slash.
Sparda is mortally wounded, and will die soon, if not aided.
242H 87V 13930775X 20C [Sparda:Dying] Mem:6 Exits:NESW>
Kalagara shouts 'dinosaur tooth and drac teeth neck for sale'
242H 87V 13930775X 20C [Sparda:Dying] Mem:6 Exits:NESW>
Slyther focuses harshly on you and utters the words, 'blindness'.
You have been blinded!
242H 87V 13930775X 20C Mem:6> c 'cur bli' meYou utter the words, 'cure
blindness'
You feel a cloak of blindness dissolve.
242H 87V 13930775X 20C [Sparda:Dying] Mem:7 Exits:NESW>
Taloc pierces YOU very hard.
Taloc pierces YOU hard.
Beric obliterates Sparda with his slash.
You receive 0 experience.
Sparda is dead! R.I.P.
The death cry of Sparda echoes from somewhere nearby...
Sparda stops following Slyther.
You direct your attention to Slyther.
Jedah flies in from the east.
Anubis arrives from the east.
218H 87V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:7
Exits:NESW>
Jedah flies west.
Anubis leaves west.
218H 87V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:7
Exits:NESW>
Taloc gets a large pile of coins from the corpse of Sparda.
218H 87V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:7
Exits:NESW>
You spasm as Slyther places his hand on your chest and drains your
life-force.
180H 34V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:7
Exits:NESW>
Beric crashes into Taloc in a thundering collision, knocking him to the
ground!
180H 34V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:7
Exits:NESW> c 'heal' meYou utter the words, 'heal'
You heal yourself.
Your entire body tingles for a few seconds.
327H 34V 13930775X 20C [Benedict:V.Good] [Slyther:Perfect] Mem:8
Exits:NESW>
Beric annihilates Taloc with his slash.
Taloc pierces YOU very hard.
Taloc misses you with his pierce.
Slyther slashes YOU extremely hard.
Slyther slashes YOU hard.
289H 34V 13930775X 20C [Benedict:Good] [Slyther:Perfect] Mem:8
Exits:NESW>
Slyther attempts to impair you, but you manage to outmaneuver him.
289H 34V 13930775X 20C [Benedict:Good] [Slyther:Perfect] Mem:8
Exits:NESW> c 'ho per' slytherBeric massacres Taloc with his slash.
You miss Slyther with your bludgeon.
Taloc pierces YOU extremely hard.
Taloc pierces YOU very hard.
Slyther slashes YOU very hard.
Slyther slashes YOU hard.
You utter the words, 'hold person'
The magic fails!
236H 34V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:9
Exits:NESW>
Slyther attacks with lightning fast series of attacks that leaves you
defenseless.
236H 34V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:9
Exits:NESW>
Taloc stands up.
236H 34V 13930775X 20C [Benedict:Fair] [Slyther:Perfect] Mem:9
Exits:NESW>
Beric crashes into Slyther in a thundering collision, knocking him to
the ground!
236H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Good] Mem:9
Exits:NESW>
Slyther slashes YOU very hard.
Slyther misses you with his slash.
222H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Good] Mem:9
Exits:NESW> groc 'heal' meYour group of 2 members consists of:
Member Hits Move Position Fly Inv Water Here Light Mem
-----------------------------------------------------------------------
------
Benedict fair fatigued fighting Y N N Y 0 9
Beric perfect rested standing Y N N Y 0 0
222H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Good] Mem:9
Exits:NESW> You return to your normal fighting style.
You miss Slyther with your bludgeon.
Slyther slashes YOU very hard.
Slyther slashes YOU.
You utter the words, 'heal'
You heal yourself.
Your entire body tingles for a few seconds.
329H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:10
Exits:NESW> c 'ho per'
Beric crashes into Taloc in a thundering collision, knocking him to the
ground!
329H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:10
Exits:NESW>
Beric annihilates Taloc with his slash.
Taloc comes out of hiding.
Taloc misses Beric with his pierce.
Taloc pierces Beric very hard.
Slyther slashes YOU very hard.
Slyther slashes YOU hard.
308H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:10
Exits:NESW> You utter the words, 'hold person'
The magic fails!
308H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:11
Exits:NESW>
Slyther gets the staff of the warlock from the corpse of Sparda.
Slyther gets a red draconian bracelet from the corpse of Sparda.
Slyther gets a jade bracelet from the corpse of Sparda.
Slyther gets a ragged leather belt from the corpse of Sparda.
Slyther gets a dark blue robe from the corpse of Sparda.
Slyther gets a red satin armguard from the corpse of Sparda.
Slyther gets a pair of pitch black gloves from the corpse of Sparda.
Slyther gets a pair of blue shoes from the corpse of Sparda.
Slyther gets a pair of green leather leggings from the corpse of
Sparda.
Slyther gets a slime covered caul from the corpse of Sparda.
308H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:11
Exits:NESW>
Slyther stands up.
308H 34V 13930775X 20C [Benedict:V.Good] [Slyther:V.Good] Mem:11
Exits:NESW> c 'ho per'
Beric massacres Taloc with his slash.
Taloc pierces Beric very hard.
Taloc pierces Beric very hard.
Slyther slashes YOU very hard.
Slyther slashes YOU hard.
286H 34V 13930775X 20C [Benedict:Good] [Slyther:V.Good] Mem:11
Exits:NESW>
Brukal flies in from the east.
286H 34V 13930775X 20C [Benedict:Good] [Slyther:V.Good] Mem:11
Exits:NESW> Brukal flies south.
You utter the words, 'hold person'
The magic fails!
286H 34V 13930775X 20C [Benedict:Good] [Slyther:V.Good] Mem:11
Exits:NESW>
Taloc gets a black tunic from the corpse of Sparda.
Taloc gets a black pearl amulet from the corpse of Sparda.
Taloc is zapped by a black cloak and instantly drops it.
Taloc gets a small quartz ring from the corpse of Sparda.
Taloc is zapped by an engraved ring of Nuitari and instantly drops it.
Taloc gets a giant silver shield from the corpse of Sparda.
Taloc gets a glowing scroll of recall from the corpse of Sparda.
Taloc gets a glowing scroll of recall from the corpse of Sparda.
Taloc gets a glowing scroll of recall from the corpse of Sparda.
Taloc gets a waterskin from the corpse of Sparda.
Taloc gets a waterskin from the corpse of Sparda.
Taloc gets a waterskin from the corpse of Sparda.
Taloc gets a waterskin from the corpse of Sparda.
Taloc gets a waterskin from the corpse of Sparda.
Taloc gets a scouting pack from the corpse of Sparda.
286H 34V 13930775X 20C [Benedict:Good] [Slyther:V.Good] Mem:11
Exits:NESW>
Beric crashes into Slyther in a thundering collision, knocking him to
the ground!
286H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:11
Exits:NESW>
Taloc gets a scroll from his pouch.
286H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:11
Exits:NESW> c 'bli' taloc
Taloc stops using a black, nasty looking shortsword.
Taloc grabs a glowing scroll of recall.
Taloc recites a glowing scroll of recall.
Taloc disappears.
286H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:11
Exits:NESW>
Slyther slashes YOU very hard.
Slyther misses you with his slash.
273H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:11
Exits:NESW> Who should the spell be cast upon?
273H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:11
Exits:NESW> c 'bli'You utter the words, 'blindness'
The magic fails!
273H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:12
Exits:NESW>
Brukal flies in from the south.
273H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:12
Exits:NESW> c 'bli'
Brukal crashes into Slyther in a thundering collision, knocking him to
the ground!
273H 34V 13930775X 20C [Benedict:Good] [Slyther:Good] Mem:12
Exits:NESW>
Brukal massacres Slyther with his crush.
Slyther slashes YOU extremely hard.
Slyther slashes YOU very hard.
245H 34V 13930775X 20C [Benedict:Fair] [Slyther:Good] Mem:12
Exits:NESW> You utter the words, 'blindness'
Slyther seems to be blinded!
245H 34V 13930775X 20C [Benedict:Fair] [Slyther:Good] Mem:13
Exits:NESW> c 'harm'
Beric crashes into Slyther in a thundering collision, knocking him to
the ground!
245H 34V 13930775X 20C [Benedict:Fair] [Slyther:Fair] Mem:13
Exits:NESW>
Beric massacres Slyther with his slash.
Brukal massacres Slyther with his crush.
Slyther slashes YOU very hard.
Slyther misses you with his slash.
234H 34V 13930775X 20C [Benedict:Fair] [Slyther:Fair] Mem:13
Exits:NESW> You utter the words, 'harm'
You grab Slyther, who screams in pain.
234H 34V 13930775X 20C [Benedict:Fair] [Slyther:Bad] Mem:14 Exits:NESW>
c 'harm'
Beric annihilates Slyther with his slash.
Brukal massacres Slyther with his crush.
Slyther slashes YOU very hard.
Slyther slashes YOU hard.
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Bad] Mem:14
Exits:NESW> You can't remember how to cast that spell!
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Bad] Mem:14
Exits:NESW>
Slyther steps aside as Beric attempts a bash, stumbles, and falls flat
on his face.
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:V.Bad] Mem:14
Exits:NESW>
Beric massacres Slyther with his slash.
Brukal massacres Slyther with his crush.
Slyther misses you with his slash.
Slyther misses you with his slash.
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW> c 'ho per'You can't remember how to cast that spell!
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW> mSpells currently memorized:
1: [ 4]aid [ 2]bless [ 2]create food
[ 1]create water [ 2]restore strength
2: [ 1]blindness [ 1]cure blindness [ 1]light
[ 1]remove curse [ 4]silence
3: [ 7]cure serious [ 3]remove poison
4: [ 1]cloak of bravery [ 2]dispel magic [ 2]free action
[ 1]sanctuary
5: [ 7]cure critical
Spells being memorized:
2: [ 2]blindness [ 1]cure blindness
4: [ 3]hold person
6: [ 6]harm
You estimate your studies will complete in 14 (game) hours.
Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-3 8-1
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Slyther drops a waterskin.
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Slyther drops a waterskin.
A waterskin disintegrates.
215H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Beric annihilates Slyther with his slash.
Brukal massacres Slyther with his crush.
Slyther slashes YOU very hard.
Slyther misses you with his slash.
Slyther drops a waterskin.
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Slyther stops using a polished long sword.
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW> bogYou boggle at some nebulous concept.
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW> lMarket Street West
This is the busy market street, filled with people, shops and stands.
People from all over Krynn come to this town for trade and other
business.
The town square is not to far to the east through the crowd. A small
path
to the north will take you to the Temple of Kalaman, while to the south
you
see a small building with a sign above the door.
A waterskin lies here.
A waterskin lies discarded on the ground.
A glint of silver catches your eye...it glows blue
A pile of black cloth rests in a heap in a corner of the room here.
The corpse of Sparda is lying here.
A sheaf of spellbook pages has been left here...it glows blue
Brukal the Brutal is standing here, fighting Slyther. (flying)
Lord Beric Dondarrion, Nowclan's Twisted Firestarter is sitting here,
fighting Slyther. (flying)
Lord Slyther, Warring Knight of Krynn is sitting here, fighting YOU.
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Slyther stands up.
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Brukal crashes into Slyther in a thundering collision, knocking him to
the ground!
203H 34V 13930775X 20C [Benedict:Fair] [Slyther:Awful] Mem:14
Exits:NESW>
Beric massacres Slyther with his slash.
You receive 0 experience.
Slyther is dead! R.I.P.
The death cry of Slyther echoes from somewhere nearby...
Beric stands up.
217H 56V 13930775X 20C Mem:13 Exits:NESW>
Beric rolls on the floor in a fit of laughter.
217H 56V 13930775X 20C Mem:13 Exits:NESW> say hehYou say 'heh'
217H 56V 13930775X 20C Mem:13 Exits:NESW> get all corpseYou get a dark
longsword from the corpse of Slyther.
You get a runed bracelet from the corpse of Slyther.
You get a ceremonial scabbard from the corpse of Slyther.
You get a white travelling cloak from the corpse of Slyther.
You get a pair of bronze vambraces from the corpse of Slyther.
You get a pair of black shadow gauntlets from the corpse of Slyther.
You get a pair of dwarven boots from the corpse of Slyther.
You get a pair of ebony greaves from the corpse of Slyther.
You get a blue elven hair ribbon from the corpse of Slyther.
You get some glistening bronze armour from the corpse of Slyther.
You get a thin gold necklace from the corpse of Slyther.
You get a pile of coins from the corpse of Slyther.
There were 12 coins.
You get a polished long sword from the corpse of Slyther.
You get a slime covered caul from the corpse of Slyther.
You get a pair of green leather leggings from the corpse of Slyther.
You get a pair of blue shoes from the corpse of Slyther.
You get a pair of pitch black gloves from the corpse of Slyther.
You get a red satin armguard from the corpse of Slyther.
Robe : You can't carry that many items.
Belt : You can't carry that many items.
Bracelet : You can't carry that many items.
Bracelet : You can't carry that many items.
Staff : You can't carry that many items.
Scroll : You can't carry that many items.
Scroll : You can't carry that many items.
Ham : You can't carry that many items.
Ham : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Chest : You can't carry that many items.
Necklace : You can't carry that many items.
Kit : You can't carry that many items.
Lantern : You can't carry that many items.
Crystal : You can't carry that many items.
Crystal : You can't carry that many items.
Crystal : You can't carry that many items.
Dust : You can't carry that many items.
Dust : You can't carry that many items.
Chest : You can't carry that many items.
Potion : You can't carry that many items.
217H 56V 13930775X 32C Mem:13 Exits:NESW>
Beric says 'any evils?'
217H 56V 13930775X 32C Mem:13 Exits:NESW> split 12You divide 12 coins
equally among the group members present.
217H 56V 13930775X 26C Mem:13 Exits:NESW> lMarket Street West
This is the busy market street, filled with people, shops and stands.
People from all over Krynn come to this town for trade and other
business.
The town square is not to far to the east through the crowd. A small
path
to the north will take you to the Temple of Kalaman, while to the south
you
see a small building with a sign above the door.
The corpse of Slyther is lying here.
A waterskin lies here.
A waterskin lies discarded on the ground.
A glint of silver catches your eye...it glows blue
A pile of black cloth rests in a heap in a corner of the room here.
The corpse of Sparda is lying here.
A sheaf of spellbook pages has been left here...it glows blue
Brukal the Brutal is standing here. (flying)
Lord Beric Dondarrion, Nowclan's Twisted Firestarter is standing here.
(flying)
217H 56V 13930775X 26C Mem:13 Exits:NESW>
Beric gets a waterskin.
Beric gets a waterskin.
Beric is zapped by an engraved ring of Nuitari and instantly drops it.
Beric is zapped by a black cloak and instantly drops it.
Beric gets the corpse of Sparda.
Beric gets a sheaf of spellbook pages.
217H 56V 13930775X 26C Mem:13 Exits:NESW> get sheafYou don't see what
you are looking for here.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
