<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Punished some randomers

POV: Fidlas

Log Rating: 0.5385

Brave randomers!

389H 146V 1X 7582C Mem:2 Exits:NU> c 'relocate' cherek
You utter the words, 'relocate'
A Crossroads in the Khalkist Foothills
You arrive upon a three way crossroads in the foothills of the
Khalkists. As you examine the three different directions, you only
notice
that each passes through the barren Khalkist foothills, which spread
all
around you. Other than these foothills, you are only able to make out
some
large mountains in each direction which further block your view of
anything
beyond them.
A mountain spring bubbles out of the rocks into a small pool.
A small sign stands just off the road.
Rasputin the Male Gnome is standing here. (flying)
. . . is followed by a hovering ball of light.
Cherek the Male Human is RESTING here. (flying)
A human mercenary stands here.
389H 146V 1X 7582C Mem:3 Exits:NSW>
Rasputin walks over to the spring and takes a seat next to it.
389H 146V 1X 7582C Mem:3 Exits:NSW>
Cherek STANDS UP!!!
389H 146V 1X 7582C Mem:3 Exits:NSW>
Rasputin STANDS UP!!!
389H 146V 1X 7582C Mem:3 Exits:NSW> l
A Crossroads in the Khalkist Foothills
You arrive upon a three way crossroads in the foothills of the
Khalkists. As you examine the three different directions, you only
notice
that each passes through the barren Khalkist foothills, which spread
all
around you. Other than these foothills, you are only able to make out
some
large mountains in each direction which further block your view of
anything
beyond them.
A mountain spring bubbles out of the rocks into a small pool.
A small sign stands just off the road.
Rasputin the Male Gnome is standing here. (flying)
. . . is followed by a hovering ball of light.
Cherek the Male Human is standing here. (flying)
A human mercenary stands here.
389H 146V 1X 7582C Mem:3 Exits:NSW>
Cherek says 'yes?'
389H 146V 1X 7582C Mem:3 Exits:NSW> 'sup fellaz?
You say 'sup fellaz?'
389H 146V 1X 7582C Mem:3 Exits:NSW>
The rising sun proclaims a new day.
Timer now at 62 secs.
389H 146V 1X 7582C Mem:2 Exits:NSW> sc
You are Fidlas the Outlaw, Weaver O' the Art, a level 30 Mage.
You are rank 25.
You are 50 years old.
You have 389(389) hit and 146(146) movement points.
You are influenced by the black moon, Nuitari.
The warmth of good envelopes your soul.
You have scored 149999999 exp, and have 7582(234043) steel coins.
You have 2 Rank points to spend.
You have died 9 horrible deaths.
You have been connected for 32 minute(s).
You have been playing for 16 day(s), 9 hour(s) and 48 minute(s).
Your equipment is currently being concealed.
You are standing.
You are flying.
You are affected by the following:
fireshield
bless
strength
blur
detect scry
mirror image (4 images)
invisibility
antimagic shell
shield
continual light
389H 146V 1X 7582C Mem:2 Exits:NSW>
Cherek walks over to the spring and takes a seat next to it.
389H 146V 1X 7582C Mem:2 Exits:NSW>
Cherek says 'nada'
389H 146V 1X 7582C Mem:2 Exits:NSW> c 'power word stun'
You utter the words, 'power word stun'
Rasputin is stunned momentarily, recovering quickly.
Cherek is stunned momentarily, recovering quickly.
A human mercenary is stunned momentarily, recovering quickly.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:Perfect] Mem:3 Exits:NSW>
Cherek STANDS UP!!!
389H 146V 1X 7582C [Me:Perfect] [Rasputin:Perfect] Mem:3 Exits:NSW>
You step aside as Cherek tries to bash you, causing him to tumble and
fall face down.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:Perfect] Mem:3 Exits:NSW>
A human mercenary misses you with his slash.
Cherek misses you with his cleave.
You pierce Rasputin very hard.
Rasputin misses you with his hit.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:3 Exits:NSW>
Rasputin focuses harshly on you and utters the words, 'magic missile'.
Rasputin misses you and destroys an image.
Rasputin misses you and destroys an image.
Rasputin misses you and destroys an image.
Your shield protects you from Rasputin's magic missiles.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:3 Exits:NSW>
A human mercenary tries to sweep your legs, but you avoid the attack.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:3 Exits:NSW> c
'power word stun'
You utter the words, 'power word stun'
Rasputin is stunned momentarily, recovering quickly.
Cherek is stunned momentarily, recovering quickly.
A human mercenary is stunned momentarily, recovering quickly.
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:5 Exits:NSW>
Makelia shouts 'formed group looking for healer/bashers'
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:5 Exits:NSW>
A human mercenary misses you with his slash.
Cherek misses you and destroys an image.
===> LOST MIRROR IMAGE <===
389H 146V 1X 7582C [Me:Perfect] [Rasputin:V.Good] Mem:5 Exits:NSW>
Rasputin focuses harshly on you and utters the words, 'force bolt'.
You feel ribs shatter as Rasputin's force bolt slams into you.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:5 Exits:NSW>
c 'power word stun'
Reflections of you step forth from the shield to guard you!
You are surrounded by 4 duplicate images.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:5 Exits:NSW> YOUR
CASTING IS DISRUPTED!!
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:6 Exits:NSW>
A human mercenary tries to kick you but he misses and destroys an image
instead.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:6 Exits:NSW>
Cherek STANDS UP!!!
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:6 Exits:NSW>
A human mercenary misses you with his slash.
Cherek misses you and destroys an image.
Cherek says 'wtf?'
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:6 Exits:NSW> c
'power word stun'
You step aside as Cherek tries to bash you, causing him to tumble and
fall face down.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:6 Exits:NSW> You
utter the words, 'power word stun'
Rasputin is stunned momentarily, recovering quickly.
Cherek is stunned momentarily, recovering quickly.
A human mercenary is STUNNED!!!
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:7 Exits:NSW>
Rasputin focuses harshly on you and utters the words, 'force bolt'.
Rasputin misses you and destroys an image.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:7 Exits:NSW> c
'power word stun'
Cherek misses you with his cleave.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:7 Exits:NSW> You
utter the words, 'power word stun'
Rasputin is stunned momentarily, recovering quickly.
Cherek is STUNNED!!!
A human mercenary is stunned momentarily, recovering quickly.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:8 Exits:NSW>
Rasputin focuses harshly on you and utters the words, 'magic missile'.
Rasputin misses you and destroys an image.
===> LOST MIRROR IMAGE <===
Your shield protects you from Rasputin's magic missiles.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Good] Mem:8 Exits:NSW> c
'malevolent tentacles'
You utter the words, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Rasputin screams in pain as inky black tentacles constrict him.
Cherek screams in pain as inky black tentacles constrict him.
A human mercenary screams in pain as inky black tentacles constrict
him.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:Fair] Mem:10 Exits:NSW>
Rasputin attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [Rasputin:Fair] Mem:10 Exits:NSW> c
'malevolent tentacles'
Cherek says 'why?'
355H 146V 1X 7582C [Me:V.Good] [Rasputin:Fair] Mem:10 Exits:NSW> You
utter the words, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Rasputin screams in pain as inky black tentacles constrict him.
Cherek screams in pain as inky black tentacles constrict him.
A human mercenary screams in pain as inky black tentacles constrict
him.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Bad] Mem:11 Exits:NSW>
A human mercenary screams in pain as inky black tentacles constrict
him.
Cherek screams in pain as inky black tentacles constrict him.
Rasputin screams in pain as inky black tentacles constrict him.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:V.Bad] Mem:11 Exits:NSW> c
'force bolt'
You utter the words, 'force bolt'
Your force bolt shatters Rasputin's skull into lifeless goo.
You receive 0 experience.
Rasputin is dead! R.I.P.
355H 146V 1X 7582C [Me:V.Good] [Rasputin:Dying] Mem:12 Exits:NSW>
The death cry of Rasputin echoes from somewhere nearby...
Rasputin stops following Cherek.
A sylph stops following Rasputin.
You direct your attention to a human mercenary.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:12
Exits:NSW>
Cherek says 'WHY'
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:12
Exits:NSW>
A human mercenary screams in pain as inky black tentacles constrict
him.
Cherek screams in pain as inky black tentacles constrict him.
You pierce a human mercenary extremely hard.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:12
Exits:NSW> c 'force bolt' cherek
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Cherek.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:13
Exits:NSW> c 'force bolt' cherek
A human mercenary screams in pain as inky black tentacles constrict
him.
Cherek screams in pain as inky black tentacles constrict him.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:13
Exits:NSW>
Cherek says 'stop'
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:13
Exits:NSW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Cherek.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:V.Bad] Mem:13
Exits:NSW> c 'force bolt' cherek
A human mercenary screams in pain as inky black tentacles constrict
him.
Cherek screams in pain as inky black tentacles constrict him.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:13
Exits:NSW>
Cherek says 'dude'
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:13
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:13
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:13
Exits:NSW>
A human mercenary attempts to break free of the black tentacles, but
fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:13
Exits:NSW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Cherek.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW> c 'force bolt' cherek
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
A human mercenary screams in pain as inky black tentacles constrict
him.
Cherek screams in pain as inky black tentacles constrict him.
Cherek is stunned, but will likely regain consciousness again.
A human mercenary misses you with his slash.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW>
Cherek attempts to break free of the black tentacles, but fails!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:14
Exits:NSW> TICK IN 16 SECONDS.
You utter the words, 'force bolt'
Your force bolt shatters Cherek's skull into lifeless goo.
Cherek is dead! R.I.P.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:15
Exits:NSW>
The death cry of Cherek echoes from somewhere nearby...
Cherek sinks gently to the ground.
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:15
Exits:NSW>
A human mercenary STANDS UP!!!
355H 146V 1X 7582C [Me:V.Good] [a human mercenary:Awful] Mem:15
Exits:NSW>
A human mercenary slashes YOU hard.
A human mercenary burns as he passes through your fire shield.
345H 146V 1X 7582C [Me:Good] [a human mercenary:Awful] Mem:15
Exits:NSW> c 'magic missile'
You utter the words, 'magic missile'
You watch with selfpride as the magic missile hits a human mercenary.
You watch with selfpride as the magic missile hits a human mercenary.
You watch with selfpride as the magic missile hits a human mercenary.
A human mercenary is mortally wounded, and will die soon, if not aided.
The magic missile tears away the remaining life of a human mercenary.
You receive 0 experience.
A human mercenary is dead! R.I.P.
345H 146V 1X 7582C [Me:Good] [a human mercenary:Dying] Mem:16
Exits:NSW>
The death cry of a human mercenary echoes from somewhere nearby...
345H 146V 1X 7582C Mem:16 Exits:NSW> gt cherek/rasputin rip
You tell your group 'cherek/rasputin rip'
345H 146V 1X 7582C Mem:16 Exits:NSW> exa corpse
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a blue-steel longsword
345H 146V 1X 7582C Mem:16 Exits:NSW>
Cherek tells you 'why'

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
