<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Trash is in the eye of the beholder

POV: Salli

Log Rating: 0.2223

PWK!

#1 And so it begins
You were last connected Tue Feb 13 00:36:52 2007 EST from
65.190.189.167.
Reconnecting.
240H 134V 4189553X 504C Mem:5 Exits:W> gt bash ke
Demetri tells your group 'cant'
240H 134V 4189553X 504C Mem:5 Exits:W> gt bash kentel
You tell your group 'bash kentel'
240H 134V 4189553X 504C Mem:5 Exits:W> l
Inner Sanctum
A rotting little tome is here.
A small pike is stuck into the ground here.
A piece of bread lies on the floor, abandoned. [10]
Kentel the Male Gnome is standing here.
Durcias Schwaz is standing here.
A berserk fighter from beyond stands here ready to fight at his masters
whim.
A berserk fighter from beyond stands here ready to fight at his masters
whim.
A berserk fighter from beyond stands here ready to fight at his masters
whim.
<BG> Demetri, Forever Dancing is standing here. (flying) (invisible)
<BG> Hobb the Blob, Melting Before Your Eyes is standing here. (flying)
<BG> Camulus the Defiler is resting here. (flying)
Crysania, Revered Daughter of Paladine, stands here to further instruct
you.
240H 134V 4189553X 504C Mem:5 Exits:W>
Camulus stands up.
240H 134V 4189553X 504C Mem:5 Exits:W> c 'f
Durcias looks at you.
240H 134V 4189553X 504C Mem:5 Exits:W> c 'f b'ken
Who should the spell be cast upon?
240H 134V 4189553X 504C Mem:5 Exits:W> o all.fighte
Hobb tells your group 'peaceful'
240H 134V 4189553X 504C Mem:5 Exits:W> o all.fighter ba
Durcias sits down and rests.
240H 134V 4189553X 504C Mem:5 Exits:W> o all.fighter bash kentel
You issue the order 'bash kentel'.
240H 134V 4189553X 504C Mem:5 Exits:W> c 'f b'kentel
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Kentel.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Good] Mem:9 Exits:W> !
You bruise Kentel with your hit.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Good] Mem:9 Exits:W> !
Durcias stands up.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Good] Mem:9 Exits:W> !You
utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kentel.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Fair] Mem:12 Exits:W> !
Kentel misses you with his hit.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Fair] Mem:12 Exits:W>
Camulus tells your clan 'no flag'
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Fair] Mem:12 Exits:W> cYou
utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kentel.
240H 134V 4189553X 504C [Me:Perfect] [Kentel:Bad] Mem:15 Exits:W> c 'l
b'
Kentel panics, and attempts to flee.
Kentel leaves west.
240H 134V 4189553X 504C Mem:15 Exits:W>
Hobb flies west.
240H 134V 4189553X 504C Mem:15 Exits:W> gt no
w
Camulus flies west.
240H 134V 4189553X 504C Mem:15 Exits:W> c Unexpected end of input:
You must specify a character to perform that action on.
240H 134V 4189553X 504C Mem:15 Exits:W> c 'l You tell your group 'no'
240H 134V 4189553X 504C Mem:15 Exits:W> c 'l b'A berserk fighter
arrives from the east.
A berserk fighter arrives from the east.
A berserk fighter arrives from the east.
Demetri flies in from the east.
Chapel
<BG> Demetri, Forever Dancing is standing here. (flying) (invisible)
A berserk fighter from beyond stands here ready to fight at his masters
whim.
A berserk fighter from beyond stands here ready to fight at his masters
whim.
A berserk fighter from beyond stands here ready to fight at his masters
whim.
<BG> Camulus the Defiler is standing here. (flying)
<BG> Hobb the Blob, Melting Before Your Eyes is sitting here, fighting
Kentel.
(flying)
Kentel the Male Gnome is standing here, fighting Hobb.
An alley cat is here sniffing around the garbage looking for food.
A Revered Son of Paladine stands here overseeing the chapel.
An alley cat purrs contentedly.
240H 133V 4189553X 504C Mem:15 Exits:EW> c 'l b'kentel
You utter the words, 'lightning bolt'
The lightning bolt hits Kentel with full impact.
240H 133V 4189553X 504C Mem:17 Exits:EW>
Hobb slashes Kentel hard.
240H 133V 4189553X 504C Mem:17 Exits:EW> !
Camulus crashes into Kentel in a thundering collision, knocking him to
the
ground!
240H 133V 4189553X 504C Mem:17 Exits:EW> !
Demetri slowly fades into existence.
Kentel steps aside as Demetri attempts a bash, stumbles, and falls flat
on his
face.
240H 133V 4189553X 504C Mem:17 Exits:EW> Demetri cleaves Kentel
extremely hard.
Camulus massacres Kentel with his smite.
Hobb slashes Kentel hard.
Kentel misses Hobb with his hit.
You utter the words, 'lightning bolt'
The lightning bolt hits Kentel with full impact.
240H 133V 4189553X 504C Mem:18 Exits:EW>
An alley cat runs in circles chasing its tail.
Hobb stands up.
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'f b'k
Before Kentel can get up, Hobb kicks him hard, leaving him prone to
attack.
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'f b'kentel
!
c 'm'
Demetri cleaves Kentel extremely hard.
Kentel is incapacitated and will slowly die, if not aided.
Camulus annihilates Kentel with his smite.
You receive 0 experience.
Kentel is dead! R.I.P.
The death cry of Kentel echoes from somewhere nearby...
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'm'
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'm'eWho should the spell be
cast upon?
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'mWho should the spell be
cast upon?
240H 133V 4189553X 504C Mem:18 Exits:EW> c 'An alley cat rubs up
against your leg.
Who should the spell be cast upon?
240H 133V 4189553X 504C Mem:18 Exits:EW> c '
Please enclose spells in single quotes: '
240H 133V 4189553X 504C Mem:18 Exits:EW> g al
An alley cat rubs up against Hobb's leg.
Hobb gets a thin golden wristband from the corpse of Kentel.
Hobb gets a large pile of coins from the corpse of Kentel.
Hobb gets a shimmering blue potion from the corpse of Kentel.
Hobb gets a shimmering blue potion from the corpse of Kentel.
Hobb gets a brewed potion from the corpse of Kentel.
Hobb gets a scribed scroll from the corpse of Kentel.
Hobb gets a scribed scroll from the corpse of Kentel.
Hobb gets a hooded lantern from the corpse of Kentel.
Hobb gets a note from the corpse of Kentel.
Hobb gets an animal skull bracelet from the corpse of Kentel.
Hobb gets a thick leather belt from the corpse of Kentel.
Hobb gets a large hide waterskin from the corpse of Kentel.
Hobb gets some pixie dust from the corpse of Kentel.
Hobb gets a bright ball of light from the corpse of Kentel.
Hobb gets a glowing scroll of recall from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a putrid potion from the corpse of Kentel.
Hobb gets a piece of bread from the corpse of Kentel.
Hobb gets a piece of bread from the corpse of Kentel.
Hobb gets a piece of bread from the corpse of Kentel.
Hobb gets a piece of bread from the corpse of Kentel.
g alCamulus gets a piece of bread from the corpse of Kentel.
Camulus gets a piece of bread from the corpse of Kentel.
Camulus gets a piece of bread from the corpse of Kentel.
Camulus gets a piece of bread from the corpse of Kentel.
Camulus gets a piece of bread from the corpse of Kentel.
Camulus gets a piece of bread from the corpse of Kentel.
Camulus gets a bright ball of light from the corpse of Kentel.
Camulus gets a bright ball of light from the corpse of Kentel.
#2
259H 58V 4189539X 329C [**Camulus:Perfect**] Mem:6 Exits:NESW>
Durcias flies in from the west.
Kentel arrives from the west.
259H 58V 4189539X 329C [**Camulus:Perfect**] Mem:6 Exits:NESW>
Demetri crashes into Durcias in a thundering collision, knocking him to
the
ground!
259H 58V 4189539X 329C [**Camulus:Perfect**] Mem:6 Exits:NESW> You
couldn't find anyone to
order around.
259H 58V 4189539X 329C [**Camulus:Perfect**] Mem:6 Exits:NESW> You
couldn't find anyone to
order around.
259H 58V 4189539X 329C [**Camulus:Perfect**] Mem:6 Exits:NESW>
Durcias steps aside as Camulus attempts a bash, stumbles, and falls
flat on his
face.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Good**] Mem:6
Exits:NESW> c 'l b'du
Hobb tells your group 'go haven now'
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Good**] Mem:6
Exits:NESW> c 'l b'dur
Consuela focuses harshly on Durcias and utters some strange words.
Consuela slowly fades into existence.
Durcias cries out in pain as Consuela grabs him.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Fair**] Mem:6
Exits:NESW> c 'l b'durcias
You utter the
words, 'lightning bolt'
The lightning bolt hits Durcias with full impact.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Bad**] Mem:6
Exits:NESW> !
!
Camulus smites Durcias extremely hard.
Demetri massacres Durcias with his slash.
Durcias misses Demetri with his cleave.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Bad**] Mem:6
Exits:NESW> !
Hobb crashes into Durcias in a thundering collision, knocking him to
the ground!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:V.Bad**] Mem:6
Exits:NESW> 'B
Consuela focuses harshly on Durcias and utters some strange words.
Consuela slowly fades into existence.
Durcias cries out in pain as Consuela grabs him.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:V.Bad**] Mem:6
Exits:NESW> 'BYou can't
remember how to cast that spell!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:V.Bad**] Mem:6
Exits:NESW> You can't
remember how to cast that spell!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:V.Bad**] Mem:6
Exits:NESW>
You can't
remember how to cast that spell!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:V.Bad**] Mem:6
Exits:NESW> 'Hobb slashes
Durcias very hard.
Camulus massacres Durcias with his smite.
Demetri massacres Durcias with his slash.
Durcias cleaves Demetri very hard.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> 'buh b
Demetri crashes into Durcias in a thundering collision, knocking him to
the
ground!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> 'buh bye
You say
'buh bye'
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> c
Camulus stands up.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> c 'm'durcias
You can't
remember how to cast that spell!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> c 'm'dur
Consuela focuses harshly on Durcias and utters some strange words.
Consuela slowly fades into existence.
Durcias shudders with agony as pain lashes and clamps down on his soul.
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW> c 'm'durcias
You can't
remember how to cast that spell!
259H 58V 4189539X 329C [**Camulus:Perfect**] [**Durcias:Awful**] Mem:6
Exits:NESW>
Hobb slashes Durcias extremely hard.
Camulus massacres Durcias with his smite.
You receive 0 experience.
Durcias is dead! R.I.P.
The death cry of Durcias echoes from somewhere nearby...
Kentel stops following Durcias.
Durcias now follows Kentel.
Kentel is the new leader of Durcias's group.
Durcias stops following Kentel.
Kentel gets a broad steel battle-axe from the corpse of Durcias.
Kentel gets a ragged leather wrist guard from the corpse of Durcias.
Kentel gets a copper dragon scale shield from the corpse of Durcias.
Kentel gets a pair of thick, white gloves from the corpse of Durcias.
Kentel gets a robe of many pockets from the corpse of Durcias.
Kentel gets a sleek, black cloak from the corpse of Durcias.
Kentel gets a carved ivory ring from the corpse of Durcias.
Kentel gets a large pile of coins from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a leg of lamb from the corpse of Durcias.
Kentel gets a leg of lamb from the corpse of Durcias.
Kentel gets some pixie dust from the corpse of Durcias.
Kentel gets a shimmering blue potion from the corpse of Durcias.
Kentel gets a clear potion of invisibility from the corpse of Durcias.
Kentel gets a small canteen from the corpse of Durcias.
Kentel gets a putrid potion from the corpse of Durcias.
Kentel gets a putrid potion from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a small canteen from the corpse of Durcias.
Kentel gets a hooded lantern from the corpse of Durcias.
Kentel gets a wooden shield from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a piece of bread from the corpse of Durcias.
Kentel gets a bowl of fresh, hot stew from the corpse of Durcias.
#3 The final dick move!
You utter the words,
'silence'
Kentel suddenly becomes very quiet.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:3
Exits:W> c
Consuela rolls on the floor in a fit of laughter.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:3
Exits:W> c 'f
Durcias rolls on the floor in a fit of laughter.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:3
Exits:W> c 'f b'
Kentel misses Hobb with his hit.
Hobb slashes Durcias very hard.
Durcias cleaves Hobb very hard.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:3
Exits:W> c 'f b'ket
Durcias crashes into Hobb in a thundering collision, knocking him to
the ground!
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:3
Exits:W> c 'f b'kentel
You utter the words,
'force bolt'
You hear bones crack as your force bolt slams into Kentel.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:4
Exits:W> !
!
Kentel misses Hobb with his hit.
Hobb slashes Durcias very hard.
Durcias cleaves Hobb very hard.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:4
Exits:W>
Kentel stands up.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:4
Exits:W> You utter the words,
'force bolt'
You hear bones crack as your force bolt slams into Kentel.
240H 137V 4189539X 329C [**Hobb:Fair**] [**Durcias:Fair**] Mem:5
Exits:W> gt ba
Hobb misses Durcias with his slash.
Durcias cleaves Hobb very hard.
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> gt bash ke
Kentel panics, and attempts to flee.
Kentel leaves west.
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> gt bash kent
Durcias says 'well bye bye this aint cool'
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> gt bash kentel
c 'l b'kentel
w
wWho should the spell
be cast upon?
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> c 'l b'kentel
You tell your group
'bash kentel'
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> Who should the spell
be cast upon?
240H 137V 4189539X 329C [**Hobb:Bad**] [**Durcias:Fair**] Mem:5
Exits:W> Consuela flies in from
the east.
Guild Lane
<Myth> Miss Consuela Franchesca Maria Juanita Gonzalez Lopez III is
standing here.
(flying) (invisible)
. . . is outlined with a dim aura.
<Newb> Jimm Beam, Double Vision is standing here.
Kentel the Male Gnome is sitting here, fighting Camulus.
A commoner walks briskly past you on her way to the market.
<BG> Demetri, Forever Dancing is standing here. (flying)
<BG> Camulus the Defiler is standing here, fighting Kentel. (flying)
240H 136V 4189539X 329C Mem:5 Exits:NESW> You utter the words,
'lightning bolt'
The lightning bolt hits Kentel with full impact.
240H 136V 4189539X 329C Mem:6 Exits:NESW>
Camulus massacres Kentel with his smite.
Kentel misses Camulus with his hit.
240H 136V 4189539X 329C Mem:6 Exits:NESW>
Consuela focuses harshly on Kentel and utters some strange words.
Consuela slowly fades into existence.
Kentel collapses and dies as Consuela grabs him.
You receive 0 experience.
Kentel is dead! R.I.P.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
