<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Friendly duel

   POV:

   Log Rating: -5.0000

   Padme Hew vs Rannos Machina Orome Grome Rules of engagement : Recall at
   v.bad condition, no flame shroud, no lightning storm, no call
   lightning, no elemental fist.. no frags that is.

   345H 73V 13145140X 86C Mem:5 Exits:ES>
   Padme says 'coming?'
   345H 73V 13145140X 86C Mem:5 Exits:ES>
   Padme laughs heartily.
   345H 73V 13145140X 86C Mem:5 Exits:ES> nod
   You nod solemnly.
   345H 73V 13145140X 86C Mem:5 Exits:ES>
   Machina arrives from the east.
   Rannos arrives from the east.
   Grome arrives from the east.
   345H 73V 13145140X 86C Mem:5 Exits:ES>
   Padme slowly fades into existence.
   Padme annihilates Machina with her stab.
   345H 73V 13145140X 86C Mem:5 Exits:ES>
   Padme annihilates Machina with her stab.
   Machina bruises Padme with his bludgeon.
   345H 73V 13145140X 86C Mem:5 Exits:ES> cast 'insect swarm'
   You utter the words, 'insect swarm'
   A huge swarm of biting, stinging insects fills the air.
   345H 73V 13145140X 86C Mem:7 Exits:ES>
   Rannos tries to sweep Padme's legs, but misses badly.
   345H 73V 13145140X 86C Mem:7 Exits:ES>
   Orome flies in from the east.
   345H 73V 13145140X 86C Mem:7 Exits:ES>
   You step aside as Machina tries to bash you, causing him to tumble and
   fall face down.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Good] Mem:7
   Exits:ES> #10 SECONDS TO TICK
   Grome tries to bash you, but he passes right through your image.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Good] Mem:7
   Exits:ES>
   Orome seems unaffected by your swarm of insects.
   Grome seems unaffected by your swarm of insects.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Machina, leaving bloody bites over his
   flesh.
   Orome slowly fades into existence.
   Orome misses you and destroys an image.
   Orome misses you and destroys an image.
   Grome misses you with his crush.
   You slash Machina extremely hard.
   Rannos bruises Padme with his cleave.
   Padme obliterates Machina with her stab.
   Machina bruises Padme with his bludgeon.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:7
   Exits:ES> cast 'insect swarm'
   Padme stops using a small black rose.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:7
   Exits:ES> You utter the words, 'insect swarm'
   A huge swarm of biting, stinging insects fills the air.
   Padme stops using a black shield of Lemish.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES>
   Padme gets a staff from her scabbard.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES>
   Padme starts holding a gleaming ironwood staff.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES>
   Rannos tries to bash you, but he passes right through your image.
   The images around you fade out of existance.
   345H 73V 13145140X 86C [Me:Perfect] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES>
   Your swarm of insects covers Orome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   Orome seems unaffected by your swarm of insects.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Machina, leaving bloody bites over his
   flesh.
   Orome bruises YOU with his shoot.
   Orome bruises YOU with his shoot.
   STONE SKIN WORE OFF !!!
   Grome bruises YOU with his crush.
   Rannos misses Padme with his cleave.
   Padme annihilates Machina with her stab.
   Padme annihilates Machina with her drain.
   Machina bruises Padme with his bludgeon.
   342H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES> cast 'insect swarm'
   Padme comes to your rescue! You're thankful, but a bit dazed.
   342H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:8
   Exits:ES> Your casting is disrupted by the fighting!
   342H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:10
   Exits:ES>
   --> Machina <-- stands up!
   342H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:10
   Exits:ES> cast 'insect swarm'
   Your swarm of insects covers Orome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   Orome seems unaffected by your swarm of insects.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Rannos seems unaffected by your swarm of insects.
   Your swarm of insects covers Machina, leaving bloody bites over his
   flesh.
   Orome massacres Padme with his shoot.
   Padme massacres Orome with her stab.
   Padme annihilates Orome with her drain.
   Grome MASSACRES YOU with his crush.
   Rannos massacres Padme with his cleave.
   Machina bludgeons Padme extremely hard.
   --> Grome <-- stands up!
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:10
   Exits:ES>
   You step aside as Grome tries to bash you, causing him to tumble and
   fall face down.
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:10
   Exits:ES> Your casting is disrupted by the fighting!
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES> #TICK
   You step aside as Machina tries to bash you, causing him to tumble and
   fall face down.
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES>
   Orome panics, and attempts to flee.
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES>
   Padme comes to your rescue! You're thankful, but a bit dazed.
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES> cast 'insect swarm'
   No more 'insect swarm' spell left!
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES>
   --> Rannos <-- stands up!
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES>
   Orome flies in from the south.
   335H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES>
   Orome slowly fades into existence.
   Orome shoots YOU extremely hard.
   316H 73V 13145140X 86C [Me:V.Good] [Padme:V.Good] [Machina:Fair] Mem:12
   Exits:ES> cast 'ice storm'
   Orome seems unaffected by your swarm of insects.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   Your swarm of insects covers Orome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   Orome shoots YOU extremely hard.
   Grome massacres Padme with his crush.
   Padme obliterates Grome with her stab.
   Padme massacres Grome with her drain.
   Rannos massacres Padme with his cleave.
   Machina bludgeons Padme extremely hard.
   297H 73V 13145140X 86C [Me:Good] [Padme:Good] [Machina:Fair] Mem:12
   Exits:ES> You utter the words, 'ice storm'
   Orome is shredded by shards of ice.
   Grome is shredded by shards of ice.
   Rannos is shredded by shards of ice.
   Machina is shredded by shards of ice.
   297H 73V 13145140X 86C [Me:Good] [Padme:Good] [Machina:Fair] Mem:13
   Exits:ES>
   Padme comes to your rescue! You're thankful, but a bit dazed.
   297H 73V 13145140X 86C [Me:Good] [Padme:Good] [Machina:Fair] Mem:13
   Exits:ES>
   Maeldun shouts 'Tingle, tingle.'
   297H 73V 13145140X 86C [Me:Good] [Padme:Good] [Machina:Fair] Mem:13
   Exits:ES> cast 'stone skin' padme
   Orome seems unaffected by your swarm of insects.
   Grome seems unaffected by your swarm of insects.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   Your swarm of insects covers Orome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Rannos seems unaffected by your swarm of insects.
   Your swarm of insects covers Machina, leaving bloody bites over his
   flesh.
   Orome massacres Padme with his shoot.
   Padme massacres Orome with her stab.
   Padme massacres Orome with her drain.
   Grome crushes Padme very hard.
   Rannos massacres Padme with his cleave.
   Machina bludgeons Padme very hard.
   Orome panics, and attempts to flee.
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:13
   Exits:ES> You utter the words, 'stone skin'
   Padme's skin turns grey and granite-like.
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES>
   --> Machina <-- stands up!
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES>
   --> Grome <-- stands up!
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES>
   Orome flies in from the south.
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES>
   You step aside as Rannos tries to bash you, causing him to tumble and
   fall face down.
   297H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES>
   Orome slowly fades into existence.
   Orome shoots YOU extremely hard.
   277H 73V 13145140X 86C [Me:Good] [Padme:Fair] [Machina:Bad] Mem:15
   Exits:ES> cast 'stone skin' me
   Your swarm of insects covers Orome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Grome, leaving bloody bites over his
   flesh.
   Your swarm of insects covers Rannos, leaving bloody bites over his
   flesh.
   Machina seems unaffected by your swarm of insects.
   The swarm of insects dissipates.
   Orome shoots YOU extremely hard.
   Orome shoots YOU extremely hard.
   Padme annihilates Machina with her stab.
   Padme massacres Machina with her drain.
   Grome bruises Padme with his crush.
   Rannos misses Padme with his cleave.
   Machina bruises Padme with his bludgeon.
   238H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:15
   Exits:ES> You utter the words, 'stone skin'
   Your skin hardens into a stone-like substance.
   238H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:16
   Exits:ES>
   Machina BASHED YOU !!!
   218H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:16
   Exits:ES>
   Padme says 'get out machina'
   218H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:16
   Exits:ES> stand
   The swarm of insects dissipates.
   Orome bruises YOU with his shoot.
   Orome bruises YOU with his shoot.
   Padme annihilates Machina with her stab.
   Padme massacres Machina with her drain.
   Grome misses Padme with his crush.
   Rannos bruises Padme with his cleave.
   Machina bruises Padme with his bludgeon.
   216H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:16
   Exits:ES>
   --> Rannos <-- stands up!
   216H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:V.Bad] Mem:16
   Exits:ES>
   Orome bruises YOU with his shoot.
   Orome bruises YOU with his shoot.
   Padme annihilates Machina with her stab.
   Padme massacres Machina with her drain.
   Grome bruises Padme with his crush.
   You MISS Machina with your slash.
   Rannos cleaves Padme very hard.
   Machina massacres Padme with his bludgeon.
   214H 73V 13145140X 86C [Me:Fair] [Padme:Fair] [Machina:Awful] Mem:16
   Exits:ES>
   Grome heroically rescues Machina.
   214H 73V 13145140X 86C [Me:Fair] [Machina:Awful] Mem:16 Exits:ES>
   Machina gets a scroll from his chest.
   214H 73V 13145140X 86C [Me:Fair] [Machina:Awful] Mem:16 Exits:ES>
   Machina stops using a battle banner of the dragonarmies.
   Machina grabs a glowing scroll of recall.
   Machina recites a glowing scroll of recall.
   Machina disappears.
   214H 73V 13145140X 86C [Me:Fair] [Machina:Awful] Mem:16 Exits:ES>
   Orome panics, and attempts to flee.
   214H 73V 13145140X 86C [Me:Fair] [Machina:Awful] Mem:16 Exits:ES>
   Rannos gets a scroll from his chest.
   214H 73V 13145140X 86C [Me:Fair] [Machina:Awful] Mem:16 Exits:ES>
   Padme annihilates Grome with her stab.
   Padme massacres Grome with her drain.
   Grome barely crushes Padme.
   Rannos massacres Padme with his cleave.
   214H 73V 13145140X 86C Mem:16 Exits:ES> You stand up.
   214H 73V 13145140X 86C Mem:16 Exits:ES>
   Orome flies in from the east.
   214H 73V 13145140X 86C Mem:16 Exits:ES>
   Grome strikes Padme's weapon, nearly disarming it.
   214H 73V 13145140X 86C Mem:16 Exits:ES> cast 'cone of cold' rannos
   You utter the words, 'cone of cold'
   You grin evilly as a cone of intense cold engulfs Rannos, freezing him.
   214H 73V 13145140X 86C Mem:17 Exits:ES>
   Orome slowly fades into existence.
   Orome bruises YOU with his shoot.
   213H 73V 13145140X 86C [Me:Fair] [Orome:V.Bad] Mem:17 Exits:ES>
   Orome bruises YOU with his shoot.
   You slash Orome extremely hard.
   Padme annihilates Grome with her stab.
   Padme massacres Grome with her drain.
   Grome crushes Padme extremely hard.
   Rannos misses Padme with his cleave.
   212H 73V 13145140X 86C [Me:Fair] [Orome:V.Bad] Mem:17 Exits:ES>
   Grome panics, and attempts to flee.
   Grome leaves south.
   212H 73V 13145140X 86C [Me:Fair] [Orome:V.Bad] Mem:17 Exits:ES> cast
   'cone of cold' rannos
   Padme comes to your rescue! You're thankful, but a bit dazed.
   212H 73V 13145140X 86C Mem:17 Exits:ES> You utter the words, 'cone of
   cold'
   You grin evilly as a cone of intense cold engulfs Rannos, freezing him.
   212H 73V 13145140X 86C Mem:18 Exits:ES>
   Rannos heroically rescues Orome.
   212H 73V 13145140X 86C Mem:18 Exits:ES>
   Padme annihilates Rannos with her stab.
   Padme drains Rannos extremely hard.
   Rannos cleaves Padme extremely hard.
   212H 73V 13145140X 86C Mem:18 Exits:ES> cast 'stone skin' padme
   Padme panics, and attempts to flee.
   Padme flies east.
   212H 73V 13145140X 86C Mem:18 Exits:ES> Who should the spell be cast
   upon?
   212H 73V 13145140X 86C Mem:18 Exits:ES>
   Rannos gets a scroll from his chest.
   212H 73V 13145140X 86C Mem:18 Exits:ES>
   Padme flies in from the east.
   212H 73V 13145140X 86C Mem:18 Exits:ES>
   Rannos stops using a cracked ruby.
   Rannos grabs a glowing scroll of recall.
   Rannos recites a glowing scroll of recall.
   Rannos disappears.
   212H 73V 13145140X 86C Mem:18 Exits:ES> cast 'stone skin' padme
   Orome says 'we lose'
   212H 73V 13145140X 86C Mem:18 Exits:ES> You utter the words, 'stone
   skin'
   Padme's skin turns grey and granite-like.
   212H 73V 13145140X 86C Mem:20 Exits:ES> m
   Padme glances at Orome.
   212H 73V 13145140X 86C Mem:20 Exits:ES>
   Orome says 'that was fun'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
