<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Jon walks the plank

   POV: Fobos

   Log Rating: 2.3333

   Lesson learned: never be semi-afk around a leader who is a total jerk.

   386H 101V 12232760X 867C Mem:4 Exits:EW>
   Judith says 'w'
   386H 101V 12232760X 867C Mem:4 Exits:EW> w
   The Western Branch
   The walls, floor, and ceiling of this corridor are quite crude,
   constructed from hard brown dirt and rock in a makeshift fashion. There
   are
   a few dried-up, crusty bloodstains sprinkled across the floor, most of
   them
   leading towards the north. A greyish haze fills the area, evidence that
   toxic vapors have collected over time here due to the lack of air
   circulation. The hallway continues to the north and east, and enters a
   room
   heavy with the smell of death to the west.
   Blood dripping from his jaw, a fierce goblin avenger stands before you.
   (red aura)
   An ogre berserker patrols here, chanting a ritual battle cry. (red
   aura)
   A goblin avenger kicks you in the face, breaking teeth and bone. Blood
   flies as your head is rocked back.
   An ogre berserker massacres YOU with his slash.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:Perfect] Mem:4
   Exits:NEW> scan
   Judith flies in from the east.
   Jon flies in from the east.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:Perfect] Mem:4
   Exits:NEW> Looking north:
   The putrid smell of blood seems to grow stronger from that direction.
   Looking east:
   The dirt hallway continues to the east.
   Looking south:
   You see nothing special.
   Looking west:
   The potent smell of fresh blood comes from the west, making you very
   wary
   of what lies in that direction.
   Looking up:
   The ceiling of this corridor has been crudely made from hard brown
   dirt.
   Looking down:
   The floor is dotted with old, dried-up bloodstains.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:Perfect] Mem:4
   Exits:NEW>
   Jon claws a goblin avenger hard.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:V.Good] Mem:4
   Exits:NEW> aveng leg
   Judith massacres a goblin avenger with her slash.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:V.Good] Mem:4
   Exits:NEW> You attempt to focus on a gob
   lin avenger and fail horribly.
   339H 99V 12232760X 867C [Fobos:Fair] [a goblin avenger:V.Good] Mem:4
   Exits:NEW>
   Judith massacres a goblin avenger with her slash.
   Judith massacres a goblin avenger with her cleave.
   Jon claws a goblin avenger very hard.
   Jon slashes a goblin avenger extremely hard.
   An ogre berserker slashes YOU extremely hard.
   An ogre berserker slashes YOU very hard.
   A goblin avenger misses you with his crush.
   You massacre a goblin avenger with your slash.
   308H 99V 12232127X 867C [Fobos:Fair] [a goblin avenger:Fair] Mem:4
   Exits:NEW>
   a goblin avenger BASHED YOU! <---------
   297H 99V 12232127X 867C [Fobos:Fair] [a goblin avenger:Fair] Mem:4
   Exits:NEW>
   Judith massacres a goblin avenger with her slash.
   Judith massacres a goblin avenger with her cleave.
   Jon claws a goblin avenger very hard.
   Jon slashes a goblin avenger extremely hard.
   An ogre berserker massacres YOU with his slash.
   An ogre berserker massacres YOU with his slash.
   A goblin avenger massacres YOU with his crush.
   A goblin avenger misses you with his crush.
   You massacre a goblin avenger with your slash.
   201H 99V 12231494X 867C [Fobos:V.Bad] [a goblin avenger:Fair] Mem:4
   Exits:NEW>
   Judith says 'jon fade w'
   201H 99V 12231494X 867C [Fobos:V.Bad] [a goblin avenger:Fair] Mem:4
   Exits:NEW> #10 SECONDS TO TICK
   Judith comes to your rescue! You're thankful, but a bit dazed.
   201H 99V 12231494X 867C Mem:4 Exits:NEW>
   A goblin avenger massacres Judith with his crush.
   Judith massacres a goblin avenger with her slash.
   Judith massacres a goblin avenger with her cleave.
   Jon claws a goblin avenger hard.
   Jon massacres a goblin avenger with his slash.
   An ogre berserker massacres YOU with his slash.
   An ogre berserker misses you with his slash.
   173H 99V 12231494X 867C [Fobos:V.Bad] [an ogre berserker:Perfect] Mem:4
   Exits:NEW>
   Your blood freezes as you hear someone's death cry.
   Jon stops following Judith.
   173H 99V 12231494X 867C [Fobos:V.Bad] [an ogre berserker:Perfect] Mem:4
   Exits:NEW>
   A goblin avenger delivers a vicious kick to Judith's face. Blood flies
   as her head snaps back.
   173H 99V 12231494X 867C [Fobos:V.Bad] [an ogre berserker:Perfect] Mem:4
   Exits:NEW> l w
   You should probably stand up!
   You massacre an ogre berserker with your slash.
   A goblin avenger misses Judith with his crush.
   A goblin avenger massacres Judith with his crush.
   Judith massacres a goblin avenger with her slash.
   Judith massacres a goblin avenger with her cleave.
   An ogre berserker massacres YOU with his slash.
   An ogre berserker massacres YOU with his slash.
   The potent smell of fresh blood comes from the west, making you very
   wary
   of what lies in that direction.
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> say hahaha
   You say 'hahaha'
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> l
   The Western Branch
   The walls, floor, and ceiling of this corridor are quite crude,
   constructed from hard brown dirt and rock in a makeshift fashion. There
   are
   a few dried-up, crusty bloodstains sprinkled across the floor, most of
   them
   leading towards the north. A greyish haze fills the area, evidence that
   toxic vapors have collected over time here due to the lack of air
   circulation. The hallway continues to the north and east, and enters a
   room
   heavy with the smell of death to the west.
   Judith Blume, Full of Blubber is standing here, fighting a goblin
   avenger. (flying)
   . . . has a tough exterior.
   A goblin avenger is standing here, fighting Judith. (red aura)
   An ogre berserker is standing here, fighting YOU. (red aura)
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> st
   You stand up.
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW>
   Judith laughs heartily.
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> l
   The Western Branch
   The walls, floor, and ceiling of this corridor are quite crude,
   constructed from hard brown dirt and rock in a makeshift fashion. There
   are
   a few dried-up, crusty bloodstains sprinkled across the floor, most of
   them
   leading towards the north. A greyish haze fills the area, evidence that
   toxic vapors have collected over time here due to the lack of air
   circulation. The hallway continues to the north and east, and enters a
   room
   heavy with the smell of death to the west.
   Judith Blume, Full of Blubber is standing here, fighting a goblin
   avenger. (flying)
   . . . has a tough exterior.
   A goblin avenger is standing here, fighting Judith. (red aura)
   An ogre berserker is standing here, fighting YOU. (red aura)
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> say resc me
   You say 'resc me'
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW>
   a goblin avenger FAILED BASH ON Judith <---------
   113H 99V 12230914X 867C [Fobos:V.Bad] [an ogre berserker:V.Good] Mem:4
   Exits:NEW> gro
   Your group of 3 members consists of:
   Judith fair rested fighting Y N N Y 0 0
   Fobos v.bad rested fighting N N N Y 1 4
   Galene fair rested resting Y N N N 0 3
   ... Later...
   Judith says 'god'
   Judith says 'fucking damnit'
   Judith says 'i'm laughing my ass off'
   Jon says 'god i hate you'
   Judith says 'boy am i funny'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
