<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Lizev dies

POV: Nig

Log Rating: 1.1667

Lizev dies a bit before the big fight

{rtf1ansiansicpg1252deff0deflang1033{fonttbl{f0fswissfcharset0 Arial;}}
{*generator Msftedit 5.41.15.1503;}viewkind4uc1pardf0fs20par
443H 129V 10814421X 357C Exits:NESW> 'be readypar
You say 'be ready'par
par
443H 129V 10814421X 357C Exits:NESW> #act {Lizev flies in} {hpar
Brealis tells your group 'on who?'par
par
443H 129V 10814421X 357C Exits:NESW> #act {Lizev flies in} {head
lizev}par
#Ok. {Lizev flies in} now triggers {head lizev} @ {5}par
gt lipar
Helix tells your group 'rem feather'par
par
443H 129V 10814421X 357C Exits:NESW> gt lizevpar
You tell your group 'lizev'par
par
443H 129V 10814421X 357C Exits:NESW> anpar
Brealis tells your group 'im on taloc'par
par
443H 129V 10814421X 357C Exits:NESW> angpar
par
Kreachor tells your group 'lizev'par
par
443H 129V 10814421X 357C Exits:NESW> lYou can not use anger just
yet.par
par
443H 129V 10814421X 357C Exits:NESW> l npar
You see nothing special.par
A drunk lies in the gutter and tries to stay conscious.par
par
443H 129V 10814421X 357C Exits:NESW> huntpar
You study the area for any sign of your prey.par
The tracks are somewhat old, your prey was near here within the last
day.par
par
443H 129V 10814421X 357C Exits:NESW> !par
You study the area for any sign of your prey.par
Your prey passed this way quite recently.par
par
443H 129V 10814421X 357C Exits:NESW> !par
You study the area for any sign of your prey.par
You can smell your prey on the wind, they must be close.par
par
443H 129V 10814421X 357C Exits:NESW> 'recepar
You say 'rece'par
par
443H 129V 10814421X 357C Exits:NESW> nnpar
You study the area for any sign of your prey.par
You can smell your prey on the wind, they must be close.par
Kreachor flies in from the south.par
Helix flies in from the south.par
Brealis flies in from the south.par
Husqy arrives from the south.par
Redroy flies in from the south.par
A Cobbled Lanepar
Redroy the Male Minotaur is standing here. (flying)par
Husqy the Male Half Elf is standing here.par
Brealis Oakleaf, Commander of the Kirath is standing here. (flying)par
Helix, the Most Useless Sigil is standing here. (flying)par
Kreachor, The Sigil Teacher is standing here. (flying)par
A drunk lies in the gutter and tries to stay conscious.par
par
443H 129V 10814421X 357C Exits:NSW> You study the area for any sign of
your prey.par
You can smell your prey on the wind, they must be close.par
Kreachor flies in from the south.par
Helix flies in from the south.par
Brealis flies in from the south.par
Husqy arrives from the south.par
Redroy flies in from the south.par
A Cobbled Lanepar
A short sword lies here.par
Redroy the Male Minotaur is standing here. (flying)par
Husqy the Male Half Elf is standing here.par
Brealis Oakleaf, Commander of the Kirath is standing here. (flying)par
Helix, the Most Useless Sigil is standing here. (flying)par
Kreachor, The Sigil Teacher is standing here. (flying)par
par
443H 129V 10814421X 357C Exits:NESW> l npar
You see nothing special.par
par
443H 129V 10814421X 357C Exits:NESW> l wpar
You see nothing special.par
You see a slender elf here, cutting saplings to make them strong.par
par
443H 129V 10814421X 357C Exits:NESW> spar
You study the area for any sign of your prey.par
You prey is right here!par
Kreachor flies in from the north.par
Helix flies in from the north.par
Brealis flies in from the north.par
Husqy arrives from the north.par
Redroy flies in from the north.par
A Cobbled Lanepar
Redroy the Male Minotaur is standing here. (flying)par
Husqy the Male Half Elf is standing here.par
Brealis Oakleaf, Commander of the Kirath is standing here. (flying)par
Helix, the Most Useless Sigil is standing here. (flying)par
Kreachor, The Sigil Teacher is standing here. (flying)par
Lizev Livez, Nowclan's Long Lost Brother is standing here. (flying)par
A drunk lies in the gutter and tries to stay conscious.par
par
443H 129V 10814421X 357C Exits:NSW> par
Kreachor crashes into Lizev in a thundering collision, knocking her to
the par
ground!par
par
443H 129V 10814421X 357C Exits:NSW> spar
par
Brealis suddenly lunges forward, slamming his skull into Lizev's face
with a par
sickening crunch.par
par
443H 129V 10814421X 357C Exits:NSW> par
Helix crashes into Lizev in a thundering collision, knocking her to the
ground!par
par
443H 129V 10814421X 357C Exits:NSW> You study the area for any sign of
your prey.par
The tracks are quite old, your prey was here, but a long while ago.par
Husqy arrives from the north.par
Redroy flies in from the north.par
Four Lanes Endpar
The corpse of a thieving kender is lying here.par
A stone fountain with an ugly draconian water statue stands here.par
Redroy the Male Minotaur is standing here. (flying)par
Husqy the Male Half Elf is standing here.par
par
443H 129V 10814421X 357C Exits:NESW> npar
You study the area for any sign of your prey.par
You prey is right here!par
Husqy arrives from the south.par
Redroy flies in from the south.par
A Cobbled Lanepar
Redroy the Male Minotaur is standing here. (flying)par
Husqy the Male Half Elf is standing here.par
Brealis Oakleaf, Commander of the Kirath is standing here, fighting
Lizev. par
(flying)par
Helix, the Most Useless Sigil is standing here, fighting Lizev.
(flying)par
Kreachor, The Sigil Teacher is standing here, fighting Lizev.
(flying)par
Lizev Livez, Nowclan's Long Lost Brother is sitting here, fighting
Kreachor. par
(flying)par
A drunk lies in the gutter and tries to stay conscious.par
par
443H 129V 10814421X 357C Exits:NSW> apar
Lizev steps aside as Redroy attempts a bash, stumbles, and falls flat
on his par
face.par
par
443H 129V 10814421X 357C Exits:NSW> asspar
You attempt to assist Helix.par
You massacre Lizev with your slash.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:V.Good] [Lizev:Good]
Exits:NSW> par
Lizev steps aside as Husqy attempts a bash, stumbles, and falls flat on
his par
face.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:V.Good] [Lizev:Good]
Exits:NSW> par
Husqy massacres Lizev with his slash.par
You massacre Lizev with your slash.par
You massacre Lizev with your slash.par
Redroy massacres Lizev with his stab.par
Helix massacres Lizev with his crush.par
Brealis massacres Lizev with his whip.par
Brealis massacres Lizev with his cleave.par
Kreachor massacres Lizev with his smite.par
Lizev pierces Kreachor very hard.par
Lizev pierces Kreachor extremely hard.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:V.Good] [Lizev:Bad]
Exits:NSW> headpar
Nigora suddenly par
lunges forward, slamming her skull into Lizev's face with a sickening
crunch.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:V.Good] [Lizev:V.Bad]
Exits:NSW> g all corppar
Husqy massacres Lizev with his slash.par
You massacre Lizev with your slash.par
You massacre Lizev with your slash.par
Redroy massacres Lizev with his stab.par
Helix massacres Lizev with his crush.par
Brealis massacres Lizev with his whip.par
Brealis misses Lizev with his cleave.par
Kreachor smites Lizev extremely hard.par
Lizev pierces Kreachor extremely hard.par
Lizev misses Kreachor with her pierce.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> g all corpsepar
!par
Lizev steps aside as Kreachor attempts a bash, stumbles, and falls flat
on his par
face.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> !par
par
Helix sinks gently to the ground.par
Helix stops using a condor feather.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> !par
par
Lizev steps aside as Helix attempts a bash, stumbles, and falls flat on
his par
face.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> !par
!par
par
Redroy stands up.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> !par
Lizev steps aside as Redroy attempts a bash, stumbles, and falls flat
on his par
face.par
par
443H 129V 10814421X 357C [Me:Perfect] [Kreachor:Good] [Lizev:Awful]
Exits:NSW> !par
Husqy massacres par
Lizev with his slash.par
You massacre Lizev with your slash.par
You receive 0 experience.par
Lizev is dead! R.I.P.par
The death cry of Lizev echoes from somewhere nearby...par
You feel up to using headbutt again.par
You feel up to using anger again.par
Husqy gets a dark red dagger from the corpse of Lizev.par
Husqy gets an elegant dagger from the corpse of Lizev.par
Husqy gets a ceremonial scabbard from the corpse of Lizev.par
Husqy gets a ceremonial elven cloak from the corpse of Lizev.par
Husqy gets a black quiver from the corpse of Lizev.par
Husqy gets a pair of charred platemail sleeves from the corpse of
Lizev.par
Husqy gets a pair of woodsman's boots from the corpse of Lizev.par
Husqy gets a pair of black leather pants from the corpse of Lizev.par
Husqy gets a ring of titan girth from the corpse of Lizev.par
Husqy gets a very large pile of coins from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
Husqy gets a glowing bracer from the corpse of Lizev.par
Husqy gets a waterskin from the corpse of Lizev.par
Husqy gets a strip of dik-dik jerky from the corpse of Lizev.par
Husqy gets a strip of dik-dik jerky from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
Husqy gets a scroll of recall from the corpse of Lizev.par
You get a scroll of recall from the corpse of Lizev.par
You get a colorful mushroom from the corpse of Lizev.par
You get a colorful mushroom from the corpse of Lizev.par
You get a large first-aid kit from the corpse of Lizev.par
You get a magical dwarven stein from the corpse of Lizev.par
You get a gnome skull from the corpse of Lizev.par
You get an elfin bottle from the corpse of Lizev.par
You get an elfin bottle from the corpse of Lizev.par
You get a waterskin from the corpse of Lizev.par
You get a pouch from the corpse of Lizev.par
You get a small wooden chest from the corpse of Lizev.par
}

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
