<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Newb mages got brave and paid for it

   POV: Dobrinion

   Log Rating: 1.0769

   first fight im in and i win.

   358H 102V 15140229X 2537C Exits:NESW> e
   Adanac flies in from the west.
   Market Street West
   <BSP> Adanac Stonington, Blood Sea Pirate is standing here. (flying)
   (invisible)
   . . . has a tough exterior.
   <Newb> Hick the Male Gnome is standing here. (flying) (invisible) (red
   aura)
   A hill giant is roaming around looking for something to kill.
   <Newb> Jenni the Female Gnome is standing here. (flying) (invisible)
   (red aura)
   . . . is followed by a hovering ball of light.
   358H 101V 15140229X 2537C Exits:NESW> e
   Jenni gives a hill giant an order.
   You step aside as a hill giant tries to bash you, causing it to tumble
   and fall
   face down.
   358H 101V 15140229X 2537C [Dobrinion:Perfect] [a hill giant:Perfect]
   Exits:NESW>
   You stop watching Trent.
   358H 101V 15140229X 2537C [Dobrinion:Perfect] [a hill giant:Perfect]
   Exits:NESW>
   Hick focuses harshly on Adanac and utters the words, 'hold person'.
   358H 101V 15140229X 2537C [Dobrinion:Perfect] [a hill giant:Perfect]
   Exits:NESW>
   A hill giant hits YOU extremely hard.
   A hill giant hits YOU very hard.
   You bludgeon a hill giant very hard.
   You can't do that while fighting.
   328H 101V 15140229X 2537C [Dobrinion:V.Good] [a hill giant:V.Good]
   Exits:NESW>
   Adanac focuses harshly on Jenni and utters some strange words.
   Adanac slowly fades into existence.
   Flesh burns as Adanac enshrouds Jenni in a cloak of flames.
   328H 101V 15140229X 2537C [Dobrinion:V.Good] [a hill giant:V.Good]
   Exits:NESW>
   Jenni focuses harshly on you and utters the words, 'hold person'.
   328H 101V 15140229X 2537C [Dobrinion:V.Good] [a hill giant:V.Good]
   Exits:NESW>
   Adanac bludgeons Jenni very hard.
   A hill giant hits YOU extremely hard.
   A hill giant hits YOU very hard.
   You miss a hill giant with your bludgeon.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:V.Good]
   Exits:NESW> say uh
   You
   say 'uh'
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:V.Good]
   Exits:NESW> l
   Mark
   et Street West
   <BSP> Adanac Stonington, Blood Sea Pirate is standing here, fighting
   Jenni.
   (flying)
   . . . has a tough exterior.
   <Newb> Hick the Male Gnome is standing here. (flying) (invisible) (red
   aura)
   A hill giant is sitting here, fighting YOU.
   <Newb> Jenni the Female Gnome is standing here, fighting Adanac.
   (flying) (red
   aura)
   . . . is followed by a hovering ball of light.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:V.Good]
   Exits:NESW> w
   You
   can't do that while fighting.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:V.Good]
   Exits:NESW>
   Adanac utters some strange words.
   Hick is shredded by shards of ice.
   A hill giant is shredded by shards of ice.
   Jenni is shredded by shards of ice.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:Good]
   Exits:NESW>
   Jenni gives a hill giant an order.
   A hill giant stands up.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:Good]
   Exits:NESW> st
   You
   are already standing.
   297H 101V 15140229X 2537C [Dobrinion:Good] [a hill giant:Good]
   Exits:NESW> fle
   You
   flee head over heels.
   Market Square of Kalaman
   The Lord's personal guard is standing here. (white aura)
   The Lord's personal guard is standing here. (white aura)
   The Lord's personal guard is standing here. (white aura)
   Lord Calof is here pondering over some political matters. (white aura)
   A woman with a bag of groceries is making her way home.
   297H 100V 15140229X 2537C Exits:NESW>
   Tate flies in from the south.
   297H 100V 15140229X 2537C Exits:NESW>
   Tate flies north.
   297H 100V 15140229X 2537C Exits:NESW> sca
   Looking north:
   You see nothing special.
   Tate the Male Human is standing here. (flying) (white aura)
   A street cleaner is walking about, cleaning up the trash.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   A knight of Solamnia stands here keeping watch over the surrounding
   area. (white
   aura)
   Looking west:
   You see nothing special.
   <BSP> Adanac Stonington, Blood Sea Pirate is standing here, fighting
   Jenni.
   (flying)
   . . . has a tough exterior.
   <Newb> Hick the Male Gnome is standing here, fighting Adanac. (flying)
   (invisible) (red aura)
   A hill giant is roaming around looking for something to kill.
   <Newb> Jenni the Female Gnome is standing here, fighting Adanac.
   (flying) (red
   aura)
   . . . is followed by a hovering ball of light.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   297H 100V 15140229X 2537C Exits:NESW>
   Lord Calof leaves north.
   A bodyguard leaves north.
   A bodyguard leaves north.
   A bodyguard leaves north.
   297H 100V 15140229X 2537C Exits:NESW> w
   Market Street West
   <BSP> Adanac Stonington, Blood Sea Pirate is standing here, fighting
   Jenni.
   (flying)
   . . . has a tough exterior.
   <Newb> Hick the Male Gnome is standing here, fighting Adanac. (flying)
   (invisible) (red aura)
   A hill giant is roaming around looking for something to kill.
   <Newb> Jenni the Female Gnome is standing here, fighting Adanac.
   (flying) (red
   aura)
   . . . is followed by a hovering ball of light.
   297H 99V 15140229X 2537C Exits:NESW> c
   Adanac utters some strange words.
   Hick is shredded by shards of ice.
   A hill giant is shredded by shards of ice.
   Jenni is shredded by shards of ice.
   297H 99V 15140229X 2537C Exits:NESW>
   Jenni gives a hill giant an order.
   You step aside as a hill giant tries to bash you, causing it to tumble
   and fall
   face down.
   297H 99V 15140229X 2537C [Adanac:Good] [a hill giant:Bad] Exits:NESW> c
   'ha
   Jenni gives a hill giant an order.
   297H 99V 15140229X 2537C [Adanac:Good] [a hill giant:Bad] Exits:NESW> c
   'harm'hick
   You utter
   the words, 'harm'
   You grab Hick, who screams in pain.
   297H 99V 15140229X 2537C [Adanac:Good] [a hill giant:Bad] Mem:3
   Exits:NESW>
   A hill giant hits Adanac extremely hard.
   A hill giant hits Adanac extremely hard.
   Jenni misses Adanac with her pierce.
   297H 99V 15140229X 2537C [Adanac:Good] [a hill giant:Bad] Mem:3
   Exits:NESW>
   Jenni focuses harshly on Adanac and utters some strange words.
   Adanac wavers under the impact of the lightning bolt sent by Jenni.
   297H 99V 15140229X 2537C [Adanac:Fair] [a hill giant:Bad] Mem:3
   Exits:NESW> !
   Hick focuses harshly on Adanac and utters some strange words.
   Adanac wavers under the impact of the lightning bolt sent by Hick.
   297H 99V 15140229X 2537C [Adanac:Fair] [a hill giant:Bad] Mem:3
   Exits:NESW> #TICK-10
   Tate flies in from the north.
   297H 99V 15140229X 2537C [Adanac:Fair] [a hill giant:Bad] Mem:3
   Exits:NESW>
   Tate flies west.
   297H 99V 15140229X 2537C [Adanac:Fair] [a hill giant:Bad] Mem:3
   Exits:NESW>
   Adanac utters some strange words.
   Hick is shredded by shards of ice.
   A hill giant is shredded by shards of ice.
   Jenni is shredded by shards of ice.
   297H 99V 15140229X 2537C [Adanac:Fair] [a hill giant:Awful] Mem:3
   Exits:NESW> You
   bludgeon a hill giant extremely hard.
   A hill giant is mortally wounded, and will die soon, if not aided.
   You utter the words, 'harm'
   You grab Hick, who collapses in pain, then dies.
   You receive 0 experience.
   Hick is dead! R.I.P.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW>
   The death cry of Hick echoes from somewhere nearby...
   Hick stops following Jenni.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW>
   Jenni panics, and attempts to flee.
   Jenni flies east.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> c '
   Tate flies in from the west.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> c
   'harm'
   Jenni flies in from the east.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> c 'harm
   Jenni gives a hill giant an order.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> c 'ha
   Jenni flies west.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW>
   Adanac gets a large pile of coins from the corpse of Hick.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> get al
   Adanac gets a small black orb from the corpse of Hick.
   Adanac gets a thin steel scimitar from the corpse of Hick.
   Adanac gets a jewel studded platinum crown from the corpse of Hick.
   Adanac gets a loaf of rye bread from the corpse of Hick.
   Adanac gets a loaf of rye bread from the corpse of Hick.
   Adanac gets a loaf of rye bread from the corpse of Hick.
   Adanac gets a loaf of rye bread from the corpse of Hick.
   Adanac gets a loaf of rye bread from the corpse of Hick.
   Adanac gets an unmarked brown vial from the corpse of Hick.
   Adanac gets a scroll of recall from the corpse of Hick.
   Adanac gets a scroll of recall from the corpse of Hick.
   Adanac gets a dog collar from the corpse of Hick.
   Adanac gets a waterskin from the corpse of Hick.
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> get all
   Thanatos shouts '30 warrior loooking for a group'
   297H 99V 15140229X 2537C [a hill giant:Dying] Mem:5 Exits:NESW> get all
   hic
   Adanac divides 330 coins equally among the group members present.
   297H 99V 15140229X 2647C [a hill giant:Dying] Mem:5 Exits:NESW> get all
   hick
   Adanac flies
   west.
   The corpse doesn't seem to have what you are looking for.
   297H 99V 15140229X 2647C [a hill giant:Dying] Mem:5 Exits:NESW> It's a
   pretty
   ghastly sight! Searching through the remains, you find:
   corpse (here) :
   297H 99V 15140229X 2647C [a hill giant:Dying] Mem:5 Exits:NESW> The
   corpse
   doesn't seem to have what you are looking for.
   297H 99V 15140229X 2647C [a hill giant:Dying] Mem:5 Exits:NESW>
   #TICK!!!
   ki jenni
   They aren't
   here.
   297H 99V 15140229X 2647C [a hill giant:Dying] Mem:5 Exits:NESW> l
   You annihilate a hill giant with your bludgeon.
   You receive 0 experience.
   A hill giant is dead! R.I.P.
   The death cry of a hill giant echoes from somewhere nearby...
   A hill giant transcends this world and enters another plane.
   311H 108V 15140229X 2647C Mem:4 Exits:NESW> Market Street West
   The corpse of a hill giant is lying here.
   The corpse of Hick is lying here.
   A sheaf of spellbook pages has been left here.
   Tate the Male Human is standing here. (flying) (white aura)
   311H 108V 15140229X 2647C Mem:4 Exits:NESW> The corpse doesn't seem to
   have what
   you are looking for.
   311H 108V 15140229X 2647C Mem:4 Exits:NESW> It's a pretty ghastly
   sight!
   Searching through the remains, you find:
   corpse (here) :
   a turtle shell shield

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
