<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Galeru RIP

   POV: Lera

   Log Rating: -1.4615

   Galeru locates an item for BSP

   c 'relo' galeruYou utter the words, 'relocate'
   The Hart's Leap Inn n' Tavern
   <Out> Galeru the Gruesome is resting here. (invisible)
   . . . is followed by a hovering ball of light.
   A huge, gruff-looking bartender stands here, wiping out a mug with a
   dirty rag.
   246H 129V 7494007X 4324C Mem:6 Exits:N(E)> l galeruYou see nothing
   special about him.
   <Out> Galeru the adult male minotaur is in an excellent condition
   (invisible).
   Elder of Outlaws.
   Galeru is using:
   <worn on body> an earthen brown robe
   <worn on head> a diaphanous veil
   <used in primary hand> a frozen short sword
   246H 129V 7494007X 4324C Mem:6 Exits:N(E)> c 'web' galeruYou utter the
   words, 'web'
   246H 129V 7494007X 4324C Mem:7 Exits:N(E)> c 'l b' galeruYou utter the
   words, 'lightning bolt'
   246H 129V 7494007X 4324C Mem:8 Exits:N(E)> ki galeruYou crush Galeru
   hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   You miss Galeru with your crush.
   Galeru slowly fades into existence.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> l e
   ^Xavier: galeru noclair
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> Beggar's Alley.
   The door is closed.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   You miss Galeru with your crush.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> ctell pofctell pofYou tell your clan 'pof'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> You tell your clan 'pof'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   Xavier appears before you in a puff of smoke.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   You miss Galeru with your crush.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> ctell nomagic
   Xavier focuses harshly on Galeru and utters the words, 'force bolt'.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> You tell your clan 'nomagic'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   You miss Galeru with your crush.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> ctell killYou tell your clan 'kill'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)> wh brAmen Maxis Aerie
   Tanada Lera Aiden
   Jel Mourgos Zodiak
   Ooga Reoki Chern
   Nivek Klok Xavier
   Shunpo Ribo Alexandra
   Pewpew Gallium Galeru
   Beda
   Total visible people : 23 Total people online : 23
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   Xavier slowly fades into existence.
   Xavier bludgeons Galeru hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Good] Mem:8
   Exits:N(E)>
   Xavier bludgeons Galeru very hard.
   You miss Galeru with your crush.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Good] Mem:8 Exits:N(E)>
   Xavier bludgeons Galeru hard.
   You crush Galeru extremely hard.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Good] Mem:8 Exits:N(E)>
   Xavier starts following you.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Good] Mem:8 Exits:N(E)>
   gro formXavier is now a member of your group.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Good] Mem:8 Exits:N(E)>
   gt he afk
   Xavier bludgeons Galeru very hard.
   You crush Galeru extremely hard.
   Galeru misses you with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   You tell your group 'he afk'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   exObvious exits:
   North - The Tap Room
   East - A closed door
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   Xavier looks at Galeru.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   Xavier bludgeons Galeru hard.
   You miss Galeru with your crush.
   You move aside quickly as Galeru attacks!
   Galeru stumbles and accidentally attacks Xavier!
   Galeru misses Xavier with his pierce.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   gt where we?You tell your group 'where we?'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   exObvious exits:
   North - The Tap Room
   East - A closed door
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   gt any ideaYou tell your group 'any idea'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru very hard.
   You crush Galeru very hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   **Xavier: frozen short sword tash
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   lThe Hart's Leap Inn n' Tavern
   <BSP> Xavier A'Kul, Blood Sea Champion of the Abyss is standing here,
   fighting Galeru. (flying)
   <Out> Galeru the Gruesome is resting here, fighting YOU.
   . . . is followed by a hovering ball of light.
   A huge, gruff-looking bartender stands here, wiping out a mug with a
   dirty rag.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru hard.
   You crush Galeru hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   **Xavier: no idea
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   **Xavier: garret
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   exObvious exits:
   North - The Tap Room
   East - A closed door
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Fair] Mem:8 Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru very hard.
   You crush Galeru extremely hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Bad] Mem:8 Exits:N(E)>
   **Xavier: maybe
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Bad] Mem:8 Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru hard.
   You crush Galeru extremely hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Bad] Mem:8
   Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru hard.
   You miss Galeru with your crush.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Bad] Mem:8
   Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru hard.
   You crush Galeru extremely hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Bad] Mem:8
   Exits:N(E)> ctell where we hidingYou tell your clan 'where we hiding'
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:V.Bad] Mem:8
   Exits:N(E)>
   You feel yourself exposed.
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru extremely hard.
   You crush Galeru very hard.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Awful] Mem:8
   Exits:N(E)> swap me xavierXavier stops following you.
   You now follow Xavier.
   Xavier is the new leader of Lera's group.
   246H 129V 7494007X 4324C [Lera:Perfect] [Galeru:Awful] Mem:8
   Exits:N(E)>
   Galeru misses you with his pierce.
   Xavier bludgeons Galeru extremely hard.
   You crush Galeru very hard.
   Galeru is incapacitated and will slowly die, if not aided.
   246H 129V 7494007X 4324C [Galeru:Dying] Mem:8 Exits:N(E)>
   **Xavier: obviously
   246H 129V 7494007X 4324C [Galeru:Dying] Mem:8 Exits:N(E)> g sheafYou
   don't see what you are looking for here.
   246H 129V 7494007X 4324C [Galeru:Dying] Mem:8 Exits:N(E)> g sheafYou
   don't see what you are looking for here.
   246H 129V 7494007X 4324C [Galeru:Dying] Mem:8 Exits:N(E)> g sheaf
   Xavier bludgeons Galeru extremely hard.
   You receive 0 experience.
   Galeru is dead! R.I.P.
   The death cry of Galeru echoes from somewhere nearby...
   246H 129V 7494007X 4324C Mem:8 Exits:N(E)> g sheaf
   Xavier gets a large pile of coins from the corpse of Galeru.
   246H 129V 7494007X 4324C Mem:8 Exits:N(E)> You get a sheaf of spellbook
   pages.
   246H 129V 7494007X 4324C Mem:8 Exits:N(E)> You don't see what you are
   looking for here.
   246H 129V 7494007X 4324C Mem:8 Exits:N(E)>
   Xavier divides 200 coins equally among the group members present.
   246H 129V 7494007X 4424C Mem:8 Exits:N(E)>
   Xavier gets a frozen short sword from the corpse of Galeru.
   Xavier gets a diaphanous veil from the corpse of Galeru.
   246H 129V 7494007X 4424C Mem:8 Exits:N(E)> get all corpseYou get an
   earthen brown robe from the corpse of Galeru.
   You get a putrid potion from the corpse of Galeru.
   You get a small canteen from the corpse of Galeru.
   You get a small canteen from the corpse of Galeru.
   You get a small canteen from the corpse of Galeru.
   You get a small canteen from the corpse of Galeru.
   You get a small canteen from the corpse of Galeru.
   You get a colorful mushroom from the corpse of Galeru.
   You get a colorful mushroom from the corpse of Galeru.
   You get a colorful mushroom from the corpse of Galeru.
   You get a scroll of recall from the corpse of Galeru.
   You get a scroll of recall from the corpse of Galeru.
   You get a scroll of recall from the corpse of Galeru.
   You get a scroll of recall from the corpse of Galeru.
   You get a scroll of recall from the corpse of Galeru.
   246H 129V 7494007X 4424C Mem:8 Exits:N(E)> exObvious exits:
   North - The Tap Room
   East - A closed door
   246H 129V 7494007X 4424C Mem:8 Exits:N(E)>
   Xavier flies north.
   You follow Xavier north.
   The Tap Room
   A rough-looking hunter sits here, staring into his ale.
   246H 128V 7494007X 4424C Mem:8 Exits:S>
   Xavier flies south.
   You follow Xavier south.
   The Hart's Leap Inn n' Tavern
   The corpse of Galeru is lying here.
   A huge, gruff-looking bartender stands here, wiping out a mug with a
   dirty rag.
   246H 127V 7494007X 4424C Mem:8 Exits:N(E)>
   Xavier gives you a putrid potion.
   Xavier gives you a putrid potion.
   Xavier gives you a putrid potion.
   Xavier gives you a putrid potion.
   Xavier gives you a putrid potion.
   Xavier gives you a putrid potion.
   246H 127V 7494007X 4424C Mem:8 Exits:N(E)>
   The weathered wooden door groans in protest as Xavier opens it.
   246H 127V 7494007X 4424C Mem:8 Exits:NE> scanLooking north:
   A huge tap room.
   A rough-looking hunter sits here, staring into his ale.
   Looking east:
   Beggar's Alley.
   The door is open.
   Eyes never wavering from the street, an Istarian citizen hurries by.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   246H 127V 7494007X 4424C Mem:8 Exits:NE>
   Xavier says 'istar'
   246H 127V 7494007X 4424C Mem:8 Exits:NE>
   Xavier says 'haha'
   246H 127V 7494007X 4424C Mem:8 Exits:NE>
   Xavier says 'HAHAHA'
   246H 129V 7494007X 4424C Mem:7 Exits:NE> 'wowYou say 'wow'
   246H 129V 7494007X 4424C Mem:7 Exits:NE> 'horns?You say 'horns?'
   246H 129V 7494007X 4424C Mem:7 Exits:NE> scan
   Xavier flies east.
   You follow Xavier east.
   Before the Destroyed Docks
   Eyes never wavering from the street, an Istarian citizen hurries by.
   246H 128V 7494007X 4424C Mem:7 Exits:SW> Looking north:
   Rubble from the shattered docks blocks further movement.
   Looking east:
   You see nothing special.
   Looking south:
   The alley leads back to the main thoroughfaire.
   Looking west:
   The door of a seedy-looking tavern beckons.
   The door is open.
   A huge, gruff-looking bartender stands here, wiping out a mug with a
   dirty rag.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   246H 128V 7494007X 4424C Mem:7 Exits:SW> c 'locate object' hornsYou
   utter the words, 'locate object'
   A pair of sharpened steel horns equipped by the minotaur gladiator.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
