<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Bucky R.I.P.

   POV: Melinda

   Log Rating: -1.5000

   ...

   247H 109V 11034589X 3486C Exits:N> n
   Knights' Post
   Bucky the Apocalypse is sitting here, fighting Cila.
   Cila the Female Minotaur is standing here, fighting Bucky. (flying)
   247H 108V 11034589X 3486C Exits:NESW> ass
   __YOU__attempt to assist Cila.
   __YOU__smite Bucky extremely hard.
   247H 108V 11034589X 3486C [Me:Good] [Cila:Good] [Bucky:V.Good]
   Exits:NESW>
   Taloc is continually trying to get behind you.
   Hmmm...i wonder what he's up to?
   247H 108V 11034589X 3486C [Me:Good] [Cila:Good] [Bucky:V.Good]
   Exits:NESW> c 'h m'
   __YOU__miss Bucky with your smite.
   Bucky massacres Cila with his pierce.
   Bucky slashes Cila extremely hard.
   Cila cleaves Bucky extremely hard.
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good]
   Exits:NESW> __YOU__utter the words, 'hol
   d monster'
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good] Mem:2
   Exits:NESW>
   Bucky pierces Cila extremely hard.
   Bucky slashes Cila extremely hard.
   Cila massacres Bucky with her cleave.
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good] Mem:2
   Exits:NESW>
   Taloc misses __YOU__with his pierce.
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good] Mem:2
   Exits:NESW> c 'h m' taloc
   Cila crashes into Bucky in a thundering collision, knocking him to the
   ground!
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good] Mem:2
   Exits:NESW> __YOU__utter the words
   , 'hold monster'
   247H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Good] Mem:3
   Exits:NESW>
   Taloc misses __YOU__with his pierce.
   Taloc pierces YOU very hard.
   Cila gracefully steps aside as Bucky attacks!
   Bucky stumbles and attacks you!
   Bucky pierces YOU hard.
   Bucky slashes Cila very hard.
   Cila massacres Bucky with her cleave.
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Fair] Mem:3
   Exits:NESW> c 'l b'
   __YOU__utter the words, 'lightning bolt'
   The lightning bolt hits Bucky with full impact.
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Fair] Mem:3
   Exits:NESW>
   Bucky pierces Cila extremely hard.
   Bucky slashes Cila very hard.
   Cila massacres Bucky with her cleave.
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Fair] Mem:3
   Exits:NESW> c 'l b'
   #10 SECONDS TO TICK
   Cila crashes into Bucky in a thundering collision, knocking him to the
   ground!
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Fair] Mem:3
   Exits:NESW>
   Taloc misses __YOU__with his pierce.
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:Fair] Mem:3
   Exits:NESW> __YOU__utter the words
   , 'lightning bolt'
   The lightning bolt hits Bucky with full impact.
   225H 108V 11034589X 3486C [Me:Good] [Cila:Fair] [Bucky:V.Bad] Mem:4
   Exits:NESW>
   Taloc pierces YOU extremely hard.
   Taloc pierces YOU hard.
   Bucky pierces Cila extremely hard.
   Bucky slashes Cila extremely hard.
   Cila massacres Bucky with her cleave.
   195H 108V 11034589X 3486C [Me:Fair] [Cila:Fair] [Bucky:V.Bad] Mem:4
   Exits:NESW> c 'l b'
   Taloc misses __YOU__with his pierce.
   Taloc misses __YOU__with his pierce.
   Bucky pierces Cila very hard.
   Bucky slashes Cila very hard.
   __YOU__smite Bucky hard.
   Cila massacres Bucky with her cleave.
   __YOU__utter the words, 'lightning bolt'
   The lightning bolt hits Bucky with full impact.
   Bucky is incapacitated and will slowly die, if not aided.
   195H 108V 11034589X 3486C [Me:Fair] [Bucky:Awful] Mem:4 Exits:NESW> g
   all corpse
   g all corpse
   g all corpse
   g all corpse
   Cila annihilates Bucky with her cleave.
   __YOU__receive 0 experience.
   [ACTION: exam corpse;g all.coins corpse]
   exam corpse
   g all.coins corpse
   Bucky is dead! R.I.P.
   The death cry of Bucky echoes from somewhere nearby...
   212H 135V 11034589X 3486C Mem:3 Exits:NESW> g all corpse
   Cila gets a large pile of coins from the corpse of Bucky.
   212H 135V 11034589X 3486C Mem:3 Exits:NESW> __YOU__get a mithril
   main-gauche from the corpse of Bucky
   .
   __YOU__get a pearl-handled knife from the corpse of Bucky.
   __YOU__get a backpack from the corpse of Bucky.
   __YOU__get some red dragon scale sleeves from the corpse of Bucky.
   __YOU__get a roasted turkey leg from the corpse of Bucky.
   __YOU__get a roasted turkey leg from the corpse of Bucky.
   __YOU__get a milky potion of see invisible from the corpse of Bucky.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
