<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

I dunno i just dunno

POV: Ri

Log Rating: 2.0000

I dunno but they got all my elite eq! dam nice klooting guys.

675H 142V 4433104X 759C Exits:NESW>
Kaev slowly fades into existence.
Kaev comes out of hiding.
Kaev places Bloodletter in Cal's back, resulting in some strange noises
and some blood.
675H 142V 4433104X 759C Exits:NESW>
Cal suddenly lunges forward, slamming his skull into Kaev's face with a
sickening crunch.
675H 142V 4433104X 759C Exits:NESW>
------->!@# Fer Sweeps the floor and sends Kaev Sprawling to the
ground!!!
char kaev
675H 142V 4433104X 759C Exits:NESW> You charge at Kaev, but he managed
to move away.
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Good] Exits:NESW>
You massacre Kaev with your slash.
Fer massacres Kaev with his slash.
Kaev pierces Cal extremely hard.
Kaev slashes Cal hard.
Cal slashes Kaev extremely hard.
Cal massacres Kaev with his cleave.
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
Laureen arrives from the west.
A knight of the sword looks at you and yells 'There's the scoundrel!'
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
------->!@# Laureen Sweeps the floor and sends Fer Sprawling to the
ground!!!
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW> char
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW> char
Lizev flies in from the south.
Lizev studies the area intently.
Benjamin flies in from the south.
Benjamin studies the area intently.
A knight of the sword looks at you and yells 'There's the scoundrel!'
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
Cal growls.
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
Cal roars.
Benjamin shrieks in terror!
Lizev shrieks in terror!
Laureen shrieks in terror!
Laureen panics, and attempts to flee.
Laureen leaves south.
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
A knight of the sword looks at you and yells 'There's the scoundrel!'
675H 142V 4433104X 759C [Cal:Fair] [Kaev:Fair] Exits:NESW>
Lizev misses Cal with her pierce.
Lizev misses Cal with her pierce.
Benjamin cleaves Cal.
Benjamin misses Cal with his pierce.
A knight of the sword massacres YOU with his slash.
A knight of the sword massacres YOU with his slash.
You massacre Kaev with your slash.
Fer massacres Kaev with his slash.
Kaev massacres Cal with his pierce.
Kaev's gaff leaves a gaping wound as he strikes Cal.
Kaev slashes Cal very hard.
Cal annihilates Kaev with his slash.
Cal massacres Kaev with his cleave.
630H 142V 4433104X 759C [Cal:Fair] [Kaev:V.Bad] Exits:NESW> get all
corpse
put all chest
Lizev dives into Cal and savagely bites him, tearing a huge chunk from
his flesh.
630H 142V 4433104X 759C [Cal:Bad] [Kaev:V.Bad] Exits:NESW> You swing a
giant mithril two-handed sword madly at
Kaev, knocking him to the ground.
630H 142V 4433104X 759C [Cal:Bad] [Kaev:V.Bad] Exits:NESW>
Cal panics, and attempts to flee.
Cal leaves east.
630H 142V 4433104X 759C [Ri:V.Good] [Kaev:V.Bad] Exits:NESW>
Kaev massacres YOU with his pierce.
Kaev slashes YOU very hard.
A knight of the sword massacres YOU with his slash.
You massacre Kaev with your slash.
Fer annihilates Kaev with his slash.
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW> char
Laureen arrives from the south.
A knight of the sword looks at you and yells 'There's the scoundrel!'
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW>
Fer steps aside as Laureen attempts a bash, stumbles, and falls flat on
his face.
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW>
A knight of the sword looks at you and yells 'There's the scoundrel!'
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW>
Lizev flies east.
Benjamin flies east.
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW>
Cal arrives from the east.
A knight of the sword looks at you and yells 'There's the scoundrel!'
566H 142V 4433104X 759C [Ri:Good] [Kaev:Awful] Exits:NESW>
Cal bleeds profusely from his wounds.
Laureen misses Fer with his smite.
Kaev pierces YOU extremely hard.
Kaev slashes YOU extremely hard.
A knight of the sword massacres YOU with his slash.
A knight of the sword massacres YOU with his slash.
You massacre Kaev with your slash.
Kaev is mortally wounded, and will die soon, if not aided.
Fer obliterates Kaev with his slash.
You receive 0 experience.
exa corpse
Kaev is dead! R.I.P.
The death cry of Kaev echoes from somewhere nearby...
Kaev stops following Laureen.
80H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW> get all corpse
put all chest
---------->Fer JUST STOOD UP!!!<---------------
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW> st
Cal leaves south.
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
charge Kaev
Kaev arrives from the south.
A knight of the sword looks at Fer and yells 'There's the scoundrel!'
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
Kaev gets a poinard from the corpse of Kaev.
Kaev gets Bloodletter from the corpse of Kaev.
Kaev gets a wrist buckler from the corpse of Kaev.
Kaev gets a mithril bracelet from the corpse of Kaev.
Kaev gets a girdle of storm giant strength from the corpse of Kaev.
Kaev gets a green leather quiver from the corpse of Kaev.
Kaev gets a pair of tawny leather sleeves from the corpse of Kaev.
Kaev gets a pair of green swordsman gloves from the corpse of Kaev.
Kaev gets a pair of gnome-skin pants from the corpse of Kaev.
Kaev gets a runed brown hood from the corpse of Kaev.
Kaev gets a blood splattered inquisitor's robe from the corpse of Kaev.
Kaev gets a bloody axe shaped medallion from the corpse of Kaev.
Kaev gets a dark tourmaline pendant from the corpse of Kaev.
Kaev gets a golden nail from the corpse of Kaev.
Kaev gets a ring of titan girth from the corpse of Kaev.
Kaev gets a pile of coins from the corpse of Kaev.
Kaev gets a black metal key from the corpse of Kaev.
Kaev gets some black breeches from the corpse of Kaev.
Kaev gets a scroll of recall from the corpse of Kaev.
Kaev gets a scroll of recall from the corpse of Kaev.
Kaev gets a scroll of recall from the corpse of Kaev.
Kaev gets a large first-aid kit from the corpse of Kaev.
Kaev gets a colorful scroll from the corpse of Kaev.
Kaev gets a minotaur trident from the corpse of Kaev.
Kaev gets a small keg from the corpse of Kaev.
Kaev gets a blackened chest from the corpse of Kaev.
Kaev gets a small keg from the corpse of Kaev.
Fer gets a set of heavy black robes from the corpse of Kaev.
Fer gets a pair of footpads from the corpse of Kaev.
Fer gets a blackened chest from the corpse of Kaev.
80H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
Benjamin flies in from the east.
Benjamin studies the area intently.
A knight of the sword looks at Fer and yells 'There's the scoundrel!'
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
Kaev leaves south.
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
Lizev flies in from the east.
Lizev studies the area intently.
A knight of the sword looks at Fer and yells 'There's the scoundrel!'
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW>
Lizev flies west.
Benjamin flies west.
480H 142V 4433104X 759C [Ri:Fair] [a knight of the sword:Perfect]
Exits:NESW> You swing a giant mithril two-han
ded sword madly at a knight of the sword, cutting him a deep wound.
480H 142V 4432067X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
A knight of the sword looks at Fer and yells 'There's the scoundrel!'
480H 142V 4432067X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Fer annihilates Laureen with his slash.
You massacre a knight of the sword with your slash.
Laureen misses Fer with his smite.
A knight of the sword massacres YOU with his slash.
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Lizev flies in from the west.
Lizev studies the area intently.
Benjamin flies in from the west.
Benjamin studies the area intently.
A knight of the sword looks at Fer and yells 'There's the scoundrel!'
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Lizev dives into Fer and savagely bites him, tearing a huge chunk from
his flesh.
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW> fl
---------->Laureen JUST STOOD UP!!!<---------------
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Fer panics, and attempts to flee.
Fer flies west.
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW> fl
Fer flies in from the west.
A knight of the sword utters some strange words.
A brilliant aura surrounds a knight of the sword.
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
------->!@# Laureen Sweeps the floor and sends Fer Sprawling to the
ground!!!
453H 142V 4431334X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Fer bleeds profusely from his wounds.
Laureen misses Fer with his smite.
Fer massacres Laureen with his slash.
You slash a knight of the sword extremely hard.
A knight of the sword massacres YOU with his slash.
431H 142V 4430828X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Lizev sends a swarm of flying piranha at Fer.
A piranha tears into Fer's flesh.
A piranha tears into Fer's flesh.
A piranha tears into Fer's flesh.
A piranha tears into Fer's flesh.
A piranha tears into Fer's flesh.
Benjamin gets the corpse of Kaev.
431H 142V 4430828X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW>
Benjamin cleaves Fer very hard.
431H 142V 4430828X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW> st
What are you trying to get from?
431H 142V 4430828X 759C [Ri:Fair] [a knight of the sword:Good]
Exits:NESW> Fer bleeds profusely from his wounds
.
Benjamin misses Fer with his cleave.
Benjamin misses Fer with his pierce.
Lizev barely pierces Fer.
Lizev misses Fer with her pierce.
Laureen misses Fer with his smite.
Fer massacres Laureen with his slash.
You massacre a knight of the sword with your slash.
A knight of the sword massacres YOU with his slash.
A knight of the sword massacres YOU with his slash.
384H 142V 4430120X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW> You swing a giant mithril two-handed
sword madly at a knight of the sword, cutting him a deep wound.
384H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
Kirag flies in from the east.
Katastrofi flies in from the east.
384H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW> gt Tick In'Bout 10 seconds.
----->AYE TICK IN 10 SECONDS!!!<--------------
st
Benjamin suddenly lunges forward, slamming his skull into Fer's face
with a sickening crunch.
---------->Fer JUST STOOD UP!!!<---------------
384H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
Fer tells your group 'tick in 10'
384H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
Fer panics, and attempts to flee.
Fer flies east.
384H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW> fl
---------->You JUST GOT OWNED BY Kirag GET UP !!!!
361H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW> fl
A knight of the sword looks at Kirag and yells 'There's the scoundrel!'
361H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
361H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
Omar shouts 'seeking +str'
361H 142V 4429134X 759C [Ri:Fair] [a knight of the sword:Fair]
Exits:NESW>
Kirag massacres YOU with his crush.
You massacre a knight of the sword with your slash.
A knight of the sword massacres YOU with his slash.
A knight of the sword massacres YOU with his slash.
286H 142V 4428527X 759C [Ri:Bad] [a knight of the sword:Fair]
Exits:NESW> fl
st
fl
fl
st
Laureen leaves east.
286H 142V 4428527X 759C [Ri:Bad] [a knight of the sword:Fair]
Exits:NESW> fl
fl
Benjamin flies east.
286H 142V 4428527X 759C [Ri:Bad] [a knight of the sword:Fair]
Exits:NESW>
charge Kaev
Kaev flies in from the south.
A knight of the sword looks at Kirag and yells 'There's the scoundrel!'
286H 142V 4428527X 759C [Ri:Bad] [a knight of the sword:Fair]
Exits:NESW>
Katastrofi focuses harshly on you and utters some strange words.
Your flesh burns as Katastrofi enshrouds you in a cloak of flames.
233H 142V 4428527X 759C [Ri:V.Bad] [a knight of the sword:Fair]
Exits:NESW>
You scream in pain as Lizev viciously attacks you with her teeth,
tearing a chunk from your flesh.
188H 142V 4428527X 759C [Ri:V.Bad] [a knight of the sword:Fair]
Exits:NESW>
Your body spasms as blood pours from your wounds.
Lizev misses you with her pierce.
Lizev pierces YOU hard.
Kirag massacres YOU with his crush.
You massacre a knight of the sword with your slash.
A knight of the sword annihilates YOU with his slash.
You wish your wounds would stop BLEEDING so much!
A knight of the sword massacres YOU with his slash.
You wish your wounds would stop BLEEDING so much!
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW> st
fl
You step aside as Laureen tries to bash you, causing him to tumble and
fall face down.
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW> fl
Kaev flies south.
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW>
Lono flies in from the south.
A knight of the sword looks at Kirag and yells 'There's the scoundrel!'
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW>
A knight of the sword looks at Kirag and yells 'There's the scoundrel!'
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW> st
Lono flies south.
94H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW> fl
fl
Katastrofi focuses harshly on you and utters some strange words.
Your flesh burns as Katastrofi enshrouds you in a cloak of flames.
You wish your wounds would stop BLEEDING so much!
32H 142V 4427971X 759C [Ri:Awful] [a knight of the sword:Bad]
Exits:NESW> Your body spasms as blood pours from
your wounds.
You wish your wounds would stop BLEEDING so much!
Laureen misses you with his smite.
Lizev pierces YOU hard.
You wish your wounds would stop BLEEDING so much!
Lizev pierces YOU hard.
You wish your wounds would stop BLEEDING so much!
Kirag massacres YOU with his crush.
You're dead.
Your skin softens.
The air around you loses its solidity.
Your detect invisibility wears off.
#TICK
st
You stop following someone.
0) Leave Arctic.
1) Enter the game.
2) Change your description.
3) Change your password.
4) Delete this character.
Make a choice:

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
