<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Jeremiah/Flinco Rip

   POV:

   Log Rating: 3.0000

   Jeremiah/Flinco R.I.P.

   559H 114V 5994711X 190C Exits:NS> nbash jeremiahA high-pitched creak
   from below you makes you wince in pain.
   The Guild Hall
   The narrow hallway continues west of here to a large lounge, where
   adventurers often rest during their journies.
   Jeremiah Saint, Devil May Cry is standing here. (flying) (invisible)
   . . . is surrounded by 3 duplicate images.
   559H 113V 5994711X 190C Exits:SW> You try to bash Jeremiah, but you
   miss and tumble forward onto your face.
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:Perfect] Exits:SW> st
   You miss Jeremiah and destroy an image instead.
   Jeremiah slowly fades into existence.
   Jeremiah misses you with his hit.
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:Perfect] Exits:SW>
   Jeremiah panics, and attempts to flee.
   Jeremiah flies south.
   559H 113V 5994711X 190C Exits:SW> gt poofst
   Jeremiah flies in from the south.
   bash Jeremiah
   559H 113V 5994711X 190C Exits:SW>
   Jeremiah focuses harshly on you and utters some strange words.
   559H 113V 5994711X 190C Exits:SW> You stand up.
   559H 113V 5994711X 190C Exits:SW> You tell your group 'poof'
   559H 113V 5994711X 190C Exits:SW> bash jeremiahYou are already
   standing.
   559H 113V 5994711X 190C Exits:SW>
   Teshal tells you 'i dislike people who can relocate and hold me it's so
   junky!'
   559H 113V 5994711X 190C Exits:SW> You try to bash Jeremiah, but you
   pass through his image and fall to the ground.
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:Perfect] Exits:SW>
   Kallom tells your group 'bah 2 more to make 12 man'
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:Perfect] Exits:SW> st
   You cleave Jeremiah extremely hard.
   Jeremiah misses you with his hit.
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:V.Good] Exits:SW>
   A Solace peacekeeper arrives from the south.
   Jeremiah focuses harshly on you and utters some strange words.
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:V.Good] Exits:SW>
   Hopkins tells your group 'poof miller'
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:V.Good] Exits:SW> st
   Hopkins tells your group 'poof miller'
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:V.Good] Exits:SW>
   Elyana appears before you in a puff of smoke.
   A Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   559H 113V 5994711X 190C [Me:Perfect] [Jeremiah:V.Good] Exits:SW> bash
   jeremiah
   A Solace peacekeeper massacres YOU with his slash.
   A Solace peacekeeper massacres YOU with his slash.
   You miss Jeremiah and destroy an image instead.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Good] Exits:SW>
   Jeremiah focuses harshly on you and utters some strange words.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Good] Exits:SW> You
   can't do that while sitting.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Good] Exits:SW> You
   stand up.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Good] Exits:SW> A
   Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   You are already standing.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Good] Exits:SW> Nol
   tells your group '?'
   You crash into Jeremiah in a bone crunching bash, sending him sprawling
   to the ground.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:Good] Exits:SW>
   Elyana focuses harshly on Jeremiah and utters some strange words.
   Elyana slowly fades into existence.
   The sound of bones cracking echoes as Elyana's force bolt slams into
   Jeremiah.
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Bad] Exits:SW>
   Nol appears before you in a puff of smoke.
   A Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   508H 113V 5994711X 190C [Me:V.Good] [Jeremiah:V.Bad] Exits:SW>
   A Solace peacekeeper slashes YOU extremely hard.
   A Solace peacekeeper massacres YOU with his slash.
   You massacre Jeremiah with your cleave.
   465H 113V 5994711X 190C [Me:Good] [Jeremiah:V.Bad] Exits:SW>
   Teshal flies in from the south.
   A Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   465H 113V 5994711X 190C [Me:Good] [Jeremiah:V.Bad] Exits:SW>
   A glowing portal opens in front of you, and Limper steps from it.
   A Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   465H 113V 5994711X 190C [Me:Good] [Jeremiah:V.Bad] Exits:SW>
   Flinco appears before Jeremiah in a puff of smoke.
   A Solace peacekeeper looks at you and yells 'There's the scoundrel!'
   465H 113V 5994711X 190C [Me:Good] [Jeremiah:V.Bad] Exits:SW>
   Elyana focuses harshly on Jeremiah and utters some strange words.
   Elyana slowly fades into existence.
   The sound of bones cracking echoes as Elyana's force bolt slams into
   Jeremiah.
   Jeremiah is mortally wounded, and will die soon, if not aided.
   Jeremiah suffers from lack of blood, and the lack of a beating heart...
   You receive 0 experience.
   Jeremiah is dead! R.I.P.
   get all.coins corpseexa corpse
   465H 113V 5994711X 190C [Me:Good] [Jeremiah:Dying] Exits:SW>
   The death cry of Jeremiah echoes from somewhere nearby...
   You direct your attention to a Solace peacekeeper.
   465H 113V 5994711X 190C [Me:Good] [a Solace peacekeeper:Perfect]
   Exits:SW>
   You cleave a Solace peacekeeper extremely hard.
   A Solace peacekeeper massacres YOU with his slash.
   441H 113V 5994414X 190C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> bash jeremiah
   Nol focuses harshly on Flinco and utters some strange words.
   The sound of bones cracking echoes as Nol's force bolt slams into
   Flinco.
   441H 113V 5994414X 190C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> bas flincoYou get a very large pile of coins from the corpse
   of Jeremiah.
   There were 1208 coins.
   441H 113V 5994414X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> It's a pretty ghastly sight! Searching through the remains,
   you find:
   corpse (here) :
   a salted herring [3]
   a portable keg
   a scroll of recall
   a waterskin [2]
   441H 113V 5994414X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> You couldn't find what you were looking for.
   441H 113V 5994414X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> You crash into Flinco in a bone crunching bash, sending him
   sprawling to the ground.
   441H 113V 5994414X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Nol misses Flinco with his smite.
   A Solace peacekeeper dodges your attack!
   A Solace peacekeeper massacres YOU with his slash.
   You waver under a Solace peacekeeper's mighty slash!
   A Solace peacekeeper annihilates YOU with his slash.
   Elyana focuses harshly on Flinco and utters some strange words.
   Elyana slowly fades into existence.
   The sound of bones cracking echoes as Elyana's force bolt slams into
   Flinco.
   381H 113V 5994414X 1398C [Me:Fair] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Kallom tells your group 'flinco went to'
   381H 113V 5994414X 1398C [Me:Fair] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Teshal focuses on you and utters some strange words.
   Your entire body tingles for a few seconds.
   556H 113V 5994414X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW>
   A Solace peacekeeper looks at Nol and yells 'There's the scoundrel!'
   556H 113V 5994414X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Nol focuses harshly on Flinco and utters some strange words.
   The sound of bones cracking echoes as Nol's force bolt slams into
   Flinco.
   556H 113V 5994414X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Limper looks at Flinco.
   556H 113V 5994414X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Flinco misses Nol with his crush.
   You massacre a Solace peacekeeper with your cleave.
   A Solace peacekeeper misses you with his slash.
   A Solace peacekeeper massacres YOU with his slash.
   You are hungry.
   eat chopeat chop
   559H 141V 5993998X 1398C [Me:Perfect] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Elyana focuses harshly on Flinco and utters some strange words.
   Elyana slowly fades into existence.
   The sound of bones cracking echoes as Elyana's force bolt slams into
   Flinco.
   559H 141V 5993998X 1398C [Me:Perfect] [a Solace peacekeeper:V.Good]
   Exits:SW> bas flinco
   Limper focuses harshly on Flinco and utters some strange words.
   Limper slowly fades into existence.
   Brains splatter on you as Limper's force bolt shatters Flinco's skull.
   You receive 0 experience.
   Flinco is dead! R.I.P.
   get all.coins corpseexa corpse
   559H 141V 5993998X 1398C [Me:Perfect] [a Solace peacekeeper:V.Good]
   Exits:SW>
   The death cry of Flinco echoes from somewhere nearby...
   559H 141V 5993998X 1398C [Me:Perfect] [a Solace peacekeeper:V.Good]
   Exits:SW>
   Nol gets a glowing scroll of recall from the corpse of Flinco.
   Nol gets a heavy flanged mace from the corpse of Flinco.
   Nol gets a suede bag from the corpse of Flinco.
   Nol gets a pair of leather sleeves from the corpse of Flinco.
   Nol gets a pair of leather boots from the corpse of Flinco.
   Nol gets a pair of leather pants from the corpse of Flinco.
   Nol gets a leather jacket from the corpse of Flinco.
   Nol gets a flowing royal blue cape from the corpse of Flinco.
   Nol gets a flowing royal blue cape from the corpse of Flinco.
   Nol is zapped by a small white ring and instantly drops it.
   Nol is zapped by a small white ring and instantly drops it.
   Nol gets a large pile of coins from the corpse of Flinco.
   Nol gets a dried, discarded snakeskin from the corpse of Flinco.
   Nol gets a glowing scroll of recall from the corpse of Flinco.
   Nol gets a glowing scroll of recall from the corpse of Flinco.
   Nol gets a longsword from the corpse of Flinco.
   559H 141V 5993998X 1398C [Me:Perfect] [a Solace peacekeeper:V.Good]
   Exits:SW> You cleave a Solace peacekeeper extremely hard.
   A Solace peacekeeper massacres YOU with his slash.
   A Solace peacekeeper massacres YOU with his slash.
   You are too busy fighting!
   516H 141V 5993681X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW> You are too busy fighting!
   516H 141V 5993681X 1398C [Me:V.Good] [a Solace peacekeeper:V.Good]
   Exits:SW> A Solace peacekeeper tries to dodge your attack!
   A Solace peacekeeper focuses harshly on you and utters some strange
   words.
   You feel great pain as flames leap from a Solace peacekeeper's fingers
   to your body.
   You couldn't find what you were looking for.
   497H 141V 5993681X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> The corpse doesn't seem to have what you are looking for.
   497H 141V 5993681X 1398C [Me:Good] [a Solace peacekeeper:V.Good]
   Exits:SW> It's a pretty ghastly sight! Searching through the remains,
   you find:
   corpse (here) :
   a wooden ring
   a crimson dust covered chest
   a waterskin [2]
   a stable note for a clydesdale
   a bright ball of light..it glows dimly
   a spiked mace
   a strip of dik-dik jerky
   a pair of leather boots

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
