<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Renshai shows its pk skills power.

   POV:

   Log Rating: 0.0000

   We were going to do Htoll, when magra and port decided to jump us. Bad
   move. Finally my giant gets to show its fearsome power in a pkill
   fight.

   Syncill leaves north.
   You follow Syncill north.
   Market Square of Kalaman
   Port, Army of God, Captain of the Renshai Division is standing here.
   (flying) (white aura)
   Magra, Fat Albert of Renskaie is standing here. (flying) (white aura)
   A knight of Solamnia stands here keeping watch over the surrounding
   area. (white aura)
   244H 135V 5699233X 84C Mem:1 Exits:NESW>
   Magra ---> BASHES ---> Syncill
   244H 135V 5699233X 84C Mem:1 Exits:NESW> Market Square of KalamanA hill
   giant is roaming around looking for something to kill.
   Joq elope is standing here.
   Syncill Sweet, Sadistic Whore of the Shadow is sitting here, fighting
   Magra.
   Port, Army of God, Captain of the Renshai Division is standing here.
   (flying) (white aura)
   Magra, Fat Albert of Renskaie is standing here, fighting Syncill.
   (flying) (white aura)
   A knight of Solamnia stands here keeping watch over the surrounding
   area. (white aura)
   244H 135V 5699233X 84C Mem:1 Exits:NESW>
   Magra massacres Syncill with his slash.
   Syncill misses Magra with his hit.
   244H 135V 5699233X 84C Mem:1 Exits:NESW> #10 SECONDS TO TICK
   A knight of the sword looks at Magra and yells 'There's the scoundrel!'
   244H 135V 5699233X 84C Mem:1 Exits:NESW> order hill bash magra
   A knight of the sword shoots Magra extremely hard.
   Magra massacres Syncill with his slash.
   Syncill misses Magra with his hit.
   A hill giant ---> BASHES ---> Magra
   244H 135V 5699233X 84C Mem:1 Exits:NESW>
   Syncill steps aside as Port attempts a bash, stumbles, and falls flat
   on his face.
   244H 135V 5699233X 84C Mem:1 Exits:NESW> ca 'haste' giant
   YOU CAST -----------> haste
   A hill giant starts to fidget.
   244H 135V 5699233X 84C Mem:2 Exits:NESW>
   A knight of the sword looks at Port and yells 'There's the scoundrel!'
   >>===> Syncill STANDS UP <===<<244H 135V 5699233X 84C Mem:2 Exits:NESW>
   Joq ---> BASHES ---> Magra
   244H 135V 5699233X 84C Mem:2 Exits:NESW>
   Joq massacres Magra with his slash.
   Port misses Syncill with his pierce.
   A hill giant annihilates Magra with its crush.
   A hill giant annihilates Magra with its crush.
   A knight of the sword massacres Magra with his shoot.
   Magra massacres Syncill with his slash.
   Syncill misses Magra with his hit.
   244H 135V 5699233X 84C Mem:2 Exits:NESW>
   Syncill focuses harshly on Port and CAST -----------> hold person.
   244H 135V 5699233X 84C Mem:2 Exits:NESW> cast 'lightning bolt' magra
   You can't remember how to cast that spell!
   244H 135V 5699233X 84C Mem:2 Exits:NESW> #TICK
   Joq slashes Magra very hard.
   Port misses Syncill with his pierce.
   A hill giant annihilates Magra with its crush.
   A knight of the sword massacres Magra with his shoot.
   Magra massacres Syncill with his slash.
   Your studies complete, you close your spellbook with a smile.
   Janelle shouts 'seeking nice prim axe or piercer have plenty cash and
   ...some trades'244H 139V 5699233X 84C Exits:NESW> cast 'force bolt'
   magra
   A hill giant delivers a quick snap kick to Magra. Magra staggers and
   tries to recover.
   244H 139V 5699233X 84C Exits:NESW>
   A street cleaner arrives from the west.
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   >>===> Port STANDS UP <===<<
   244H 139V 5699233X 84C Exits:NESW>
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   244H 139V 5699233X 84C Exits:NESW> YOU CAST -----------> force bolt
   You hear bones crack as your force bolt slams into Magra.
   244H 139V 5699233X 84C Mem:4 Exits:NESW>
   --> YOU ARE BASHED BY ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Syncill:Fair] [Port:Perfect] Mem:4
   Exits:NESW>
   You **MISS** Port with your whip.
   Joq massacres Magra with his slash.
   Port misses Syncill with his pierce.
   A hill giant annihilates Magra with its crush.
   A knight of the sword massacres Magra with his shoot.
   A knight of the sword massacres Magra with his shoot.
   Magra massacres Syncill with his slash.
   Syncill misses Magra with his hit.
   Joq heroically rescues Syncill.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:Perfect] Mem:4
   Exits:NESW>
   Syncill utters some strange words.
   Syncill heals Syncill.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:Perfect] Mem:4
   Exits:NESW>
   A hill giant delivers a quick snap kick to Magra. Magra staggers and
   tries to recover.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:Perfect] Mem:4
   Exits:NESW>
   A street cleaner leaves south.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:Perfect] Mem:4
   Exits:NESW>
   A knight of the sword looks at Magra and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:Perfect] Mem:4
   Exits:NESW> st
   Port misses Joq with his pierce.
   Joq slashes Port extremely hard.
   You **MISS** Port with your whip.
   A hill giant annihilates Magra with its crush.
   A knight of the sword massacres Magra with his shoot.
   A knight of the sword massacres Magra with his shoot.
   Magra slashes Syncill extremely hard.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   Joq ---> BASHES ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   >>===> Magra STANDS UP <===<<
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   Magra panics, and attempts to flee.
   Magra flies west.227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect]
   [Port:V.Good] Mem:4 Exits:NESW>
   Taoe arrives from the south.
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   Taoe leaves west.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   Taoe arrives from the west.
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Perfect] [Port:V.Good] Mem:4
   Exits:NESW>
   A knight of the sword massacres Joq with his shoot.
   Port misses Joq with his pierce.
   Joq massacres Port with his slash.
   You **MISS** Port with your whip.227H 139V 5699233X 84C [Me:V.Good]
   [Joq:V.Good] [Port:Good] Mem:4 Exits:NESW> order hill bash magra
   Miagi flies in from the west.
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   Miagi flies south.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   Taoe looks at Port.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW> You stand up.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW> order hill st
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   Taoe leaves south.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW> order hill bash port
   A knight of the sword misses Joq with his shoot.
   Port misses Joq with his pierce.
   Joq slashes Port extremely hard.
   You MASSACRE Port with your whip.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   Joq ---> BASHES ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   Lemme shouts 'book with silver gilded edges for sell'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW> A hill giant ---> BASHES ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:V.Good] [Port:Good] Mem:4
   Exits:NESW>
   A hill giant obliterates Port with its crush.
   A hill giant obliterates Port with its crush.
   A knight of the sword massacres Joq with his shoot.
   A knight of the sword massacres Joq with his shoot.
   Port misses Joq with his pierce.
   Joq slashes Port extremely hard.
   You whip Port hard.227H 139V 5699233X 84C [Me:V.Good] [Joq:Good]
   [Port:Fair] Mem:4 Exits:NESW>
   Syncill focuses harshly on Port and CAST -----------> hold person.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Fair] Mem:4
   Exits:NESW> cast 'force bolt' port
   YOU CAST -----------> force bolt
   You hear bones crack as your force bolt slams into Port.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Bad] Mem:5
   Exits:NESW>
   Miagi stops following Syncill.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Bad] Mem:5
   Exits:NESW>
   A hill giant massacres Port with its crush.
   A knight of the sword misses Joq with his shoot.
   A knight of the sword massacres Joq with his shoot.
   Port misses Joq with his pierce.
   Joq massacres Port with his slash.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:V.Bad] Mem:5
   Exits:NESW> cast 'force bolt' port
   Joq ---> BASHES ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:V.Bad] Mem:5
   Exits:NESW>
   Syncill focuses harshly on Port and CAST -----------> hold person.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:V.Bad] Mem:5
   Exits:NESW>
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:V.Bad] Mem:5
   Exits:NESW> YOU CAST -----------> force bolt
   You hear bones crack as your force bolt slams into Port.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:V.Bad] Mem:7
   Exits:NESW> order hill bash
   A hill giant annihilates Port with its crush.
   A knight of the sword shoots Joq extremely hard.
   A knight of the sword shoots Joq extremely hard.
   Port misses Joq with his pierce.Joq massacres Port with his slash.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Awful] Mem:7
   Exits:NESW> A hill giant ---> BASHES ---> Port
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Awful] Mem:7
   Exits:NESW>
   A knight of the sword looks at Joq and yells 'There's the scoundrel!'
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Awful] Mem:7
   Exits:NESW>
   Syncill misses Port with his hit.
   227H 139V 5699233X 84C [Me:V.Good] [Joq:Good] [Port:Awful] Mem:7
   Exits:NESW>
   Syncill misses Port with his hit.
   A hill giant annihilates Port with its crush.
   A knight of the sword shoots Joq extremely hard.
   A knight of the sword massacres Joq with his shoot.
   Port misses Joq with his pierce.
   Joq massacres Port with his slash.
   You receive 0 experience.get pile.steel.coins corpse
   exa corpse
   Port is dead! R.I.P.
   The death cry of Port echoes from somewhere nearby...
   Lemme stops following Port.
   227H 139V 5699233X 84C Mem:7 Exits:NESW> The corpse doesn't seem to
   have what you are looking for.
   227H 139V 5699233X 84C Mem:7 Exits:NESW> It's a pretty ghastly sight!
   Searching through the remains, you find:
   corpse (here) :
   an old and tarnished lance
   a sterling cuff
   a blacksmith's spiked wrist guard
   a woodsman's sash
   a crystalline shield
   a pair of woodsman's sleeves
   a pair of stitched dueling gloves
   a pair of pearl studded greaves..it glows dimlya dwarven face
   shield..it hums softly
   a suit of darkened tusk scalemail
   a small silver medallion
   a glowing scroll of recall..it glows dimly [2]
   lox on a bagel with cream cheese [6]
   a small canteen [2]
   a large waterskin [2]
   a crimson dust covered chest
   227H 139V 5699233X 84C Mem:7 Exits:NESW> get all corpse

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
