<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Zippy rip

   POV: Grishnakh

   Log Rating: 0.4000

   another kylarfollower

   601H 101V 2292621X 0C Exits:NESW>
   Tuco flies north.
   You follow Tuco north.
   A Path Through the Camp
   Genja, RGB Crash Bum Bang Beauty is standing here. (flying)
   Cromat the Male Hylar Dwarf is standing here. (flying)
   Clamp the Male Hill Dwarf is standing here. (flying) (invisible)
   Tuco the Male Human is standing here. (flying) (invisible)
   . . . is enveloped in flames.
   Zippy the Male Minotaur is standing here, fighting a Knight of the
   Sword. (flying)
   bash ZippyWeedy, The Choice of Perfection is standing here. (flying)
   . . . is outlined with a dim aura.
   Seuss is standing here, fighting a Knight of the Sword. (flying)
   A Knight of the Sword is standing here, fighting Seuss.
   A Solamnic guard slashes Genja hard.
   A Solamnic guard slashes Genja hard.
   A Solamnic guard slashes YOU extremely hard.
   A Knight of the Sword utters some strange words.
   A Knight of the Sword is surrounded by a white aura.
   586H 99V 2292621X 0C [Grishnakh:V.Good] [a Solamnic guard:Perfect]
   Exits:NESW> You crash into Zippy in a bone crunching bash, sending him
   sprawling to the ground.
   586H 99V 2292621X 0C [Grishnakh:V.Good] [a Solamnic guard:Perfect]
   Exits:NESW>
   Genja crashes into Seuss in a thundering collision, knocking him to the
   ground!
   586H 99V 2292621X 0C [Grishnakh:V.Good] [a Solamnic guard:Perfect]
   Exits:NESW>
   Tuco utters some strange words.
   Tuco slowly fades into existence.
   A Solamnic guard is shredded by shards of ice.
   A Solamnic guard is shredded by shards of ice.
   A Solamnic guard is shredded by shards of ice.
   Zippy is shredded by shards of ice.
   Weedy is shredded by shards of ice.
   Seuss is shredded by shards of ice.
   A Knight of the Sword is shredded by shards of ice.
   A Knight of the Sword is mortally wounded, and will die soon, if not
   aided.
   586H 99V 2292621X 0C [Grishnakh:V.Good] [a Solamnic guard:Good]
   Exits:NESW>
   Cromat turns Weedy's head to the side and sink his fangs into her neck.
   586H 99V 2292621X 0C [Grishnakh:V.Good] [a Solamnic guard:Good]
   Exits:NESW>
   Weedy smites Tuco extremely hard.
   Weedy is burned, as she swings at Tuco.
   Weedy is chilled, as she swings at Tuco.
   Tuco bludgeons a Solamnic guard hard.
   A Solamnic guard misses you with his slash.
   You crush a Solamnic guard extremely hard.
   A Solamnic guard misses Genja with his slash.
   A Solamnic guard slashes Genja hard.
   Genja massacres a Solamnic guard with her slash.
   Zippy obliterates a Knight of the Sword with his cleave.
   You receive 5465 experience.
   A Knight of the Sword is dead! R.I.P.
   get all.pile corpseexa corpseThe death cry of a Knight of the Sword
   echoes from somewhere nearby...
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Fair]
   Exits:NESW>
   Clamp focuses harshly on Seuss and utters some strange words.
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Fair]
   Exits:NESW>
   Seuss stands up.
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Fair]
   Exits:NESW>
   Cromat massacres a Solamnic guard with his crush.
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Fair]
   Exits:NESW>
   Seuss says 'eh?'
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Fair]
   Exits:NESW>
   Tuco utters some strange words.
   A Solamnic guard is shredded by shards of ice.
   A Solamnic guard is shredded by shards of ice.
   A Solamnic guard is shredded by shards of ice.
   Zippy ducks out of the way of Tuco's attack.
   Weedy is shredded by shards of ice.
   Seuss is shredded by shards of ice.
   586H 99V 2286892X 0C [Grishnakh:V.Good] [a Solamnic guard:Bad]
   Exits:NESW> bash Zippy
   Seuss massacres Tuco with his crush.
   Seuss is burned, as he swings at Tuco.
   Seuss is chilled, as he swings at Tuco.
   Cromat crushes a Solamnic guard extremely hard.
   You receive 10421 experience.
   A Solamnic guard is dead! R.I.P.
   get all.pile corpseexa corpseWeedy smites Tuco very hard.
   Weedy is burned, as she swings at Tuco.
   Weedy is chilled, as she swings at Tuco.
   A Solamnic guard misses you with his slash.
   You crush a Solamnic guard extremely hard.
   A Solamnic guard slashes Genja very hard.
   The death cry of a Solamnic guard echoes from somewhere nearby...
   586H 99V 2276174X 0C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW> You get a pile of coins from the corpse of a Solamnic
   guard.
   There were 27 coins.
   split 27
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW> It's a pretty ghastly sight! Searching through the remains,
   you find:
   corpse (here) :
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW> A Solamnic guard utters some strange words.
   A brilliant aura surrounds a Solamnic guard.
   You crash into Zippy in a bone crunching bash, sending him sprawling to
   the ground.
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   A Solamnic guard utters some strange words.
   A brilliant aura surrounds a Solamnic guard.
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Weedy utters some strange words.
   Weedy heals Weedy.
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Clamp focuses harshly on Seuss and utters some strange words.
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Genja crashes into Seuss in a thundering collision, knocking him to the
   ground!
   586H 99V 2276174X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Zippy massacres YOU with his cleave.
   Zippy cleaves YOU extremely hard.
   Tuco bludgeons Weedy.
   Genja slashes a Solamnic guard extremely hard.
   A Solamnic guard is stunned, but will likely regain consciousness
   again.
   Seuss massacres Tuco with his crush.
   Seuss is burned, as he swings at Tuco.
   Seuss is chilled, as he swings at Tuco.
   A Solamnic guard misses you with his slash.
   You massacre a Solamnic guard with your crush.
   Tuco looks really sick, and shivers uncomfortably.
   A Solamnic guard lays his hands on a Solamnic guard and utters a
   prayer.
   A Solamnic guard misses Genja with his slash.
   558H 129V 2275828X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Cromat crashes into Weedy in a thundering collision, knocking her to
   the ground!
   558H 129V 2275828X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Tuco focuses harshly on Zippy and utters some strange words.
   558H 129V 2275828X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Clamp focuses harshly on Seuss and utters some strange words.
   Seuss suddenly becomes very quiet.
   558H 129V 2275828X 27C [Grishnakh:V.Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   A Solamnic guard utters some strange words.
   A Solamnic guard is surrounded by a white aura.
   Cromat massacres Weedy with his crush.
   A Solamnic guard misses Genja with his slash.
   Zippy massacres YOU with his cleave.
   Zippy cleaves YOU extremely hard.
   Genja slashes a Solamnic guard extremely hard.
   Seuss crushes Tuco extremely hard.
   Seuss is burned, as he swings at Tuco.
   Seuss is chilled, as he swings at Tuco.
   Weedy smites Tuco extremely hard.
   Weedy is burned, as she swings at Tuco.
   Weedy is chilled, as she swings at Tuco.
   A Solamnic guard misses you with his slash.
   You massacre a Solamnic guard with your crush.
   515H 129V 2275482X 27C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW> bash Zippy
   Tuco gets a potion from his backpack.
   515H 129V 2275482X 27C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW> Tuco quaffs a blue potion.
   Tuco smiles as the healing hand of Mishakal is placed upon him.
   Tuco heals Tuco.
   Tuco looks better.
   The corpse doesn't seem to have what you are looking for.
   515H 129V 2275482X 27C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW> It's a pretty ghastly sight! Searching through the remains,
   you find:
   corpse (here) :
   515H 129V 2275482X 27C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW> You can't split 27 evenly among the people in the room;
   splitting 25 instead.
   You divide 25 coins equally among the group members present.
   515H 129V 2275482X 7C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW> You try to bash Zippy, but you miss and tumble forward onto
   your face.
   515H 129V 2275482X 7C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Clamp focuses on Tuco and utters some strange words.
   Clamp heals Tuco.
   Zippy stops using a gleaming pickaxe.
   Zippy grabs a scroll of recall.
   Zippy recites a scroll of recall.
   Seuss disappears.
   515H 129V 2275482X 7C [Grishnakh:Good] [a Solamnic guard:V.Bad]
   Exits:NESW>
   Cromat massacres Weedy with his crush.
   A Solamnic guard misses Genja with his slash.
   Zippy misses you with his cleave.
   Tuco bludgeons Weedy extremely hard.
   A Solamnic guard gracefully steps aside as Genja attacks!
   Weedy smites Tuco extremely hard.
   Weedy is burned, as she swings at Tuco.
   Weedy is chilled, as she swings at Tuco.
   A Solamnic guard slashes YOU very hard.
   You massacre a Solamnic guard with your crush.
   502H 129V 2275136X 7C [Grishnakh:Good] [a Solamnic guard:Awful]
   Exits:NESW>
   Weedy steps aside as Cromat attempts a bash, stumbles, and falls flat
   on his face.
   502H 129V 2275136X 7C [Grishnakh:Good] [a Solamnic guard:Awful]
   Exits:NESW>
   Tuco utters some strange words.
   A Solamnic guard is shredded by shards of ice.
   A Solamnic guard is torn to pieces by hundreds of shards of ice.
   You receive 8684 experience.
   A Solamnic guard is dead! R.I.P.
   get all.pile corpseexa corpseZippy is shredded by shards of ice.
   Weedy is shredded by shards of ice.
   502H 129V 2266452X 7C [a Solamnic guard:Dying] Exits:NESW>
   The death cry of a Solamnic guard echoes from somewhere nearby...
   You direct your attention to Zippy.
   502H 129V 2266452X 7C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   Genja gets a pile of coins from the corpse of a Solamnic guard.
   502H 129V 2266452X 7C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   A Solamnic guard utters some strange words.
   A Solamnic guard is surrounded by a white aura.
   502H 129V 2266452X 7C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   Weedy gets a scroll from her chest.
   502H 129V 2266452X 7C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   Genja divides 30 coins equally among the group members present.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   Weedy stops using a globe of radiance.
   Weedy grabs a glowing scroll of recall.
   Weedy recites a glowing scroll of recall.
   Weedy disappears.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   Clamp tells your group '-->>2 heal(s) left <<--'
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Good] Exits:NESW>
   You massacre Zippy with your crush.
   A Solamnic guard misses Genja with his slash.
   Zippy misses you with his cleave.
   Genja massacres a Solamnic guard with her slash.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW> stThe
   corpse doesn't seem to have what you are looking for.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW>
   Tuco focuses harshly on Zippy and utters some strange words.
   Tuco slowly fades into existence.
   Huge flames burn Zippy from above.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW> It's a
   pretty ghastly sight! Searching through the remains, you find:
   corpse (here) :
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW> You
   stand up.
   Zippy stands up.
   502H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW>
   You crush Zippy extremely hard.
   A Solamnic guard misses Genja with his slash.
   Zippy cleaves YOU extremely hard.
   Genja massacres a Solamnic guard with her slash.
   Zippy grabs a scroll of recall.
   482H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Fair] Exits:NESW>
   Genja crashes into Zippy in a thundering collision, knocking him to the
   ground!
   482H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Bad] Exits:NESW>
   Cromat stands up.
   482H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Bad] Exits:NESW>
   Zippy steps aside as Cromat attempts a bash, stumbles, and falls flat
   on his face.
   482H 129V 2266452X 13C [Grishnakh:Good] [Zippy:Bad] Exits:NESW> bas
   zippy
   Cromat massacres Zippy with his crush.
   You crush Zippy extremely hard.
   Genja gracefully steps aside as a Solamnic guard attacks!
   Zippy massacres YOU with his cleave.
   Genja slashes a Solamnic guard extremely hard.
   457H 129V 2266452X 13C [Grishnakh:Fair] [Zippy:V.Bad] Exits:NESW>
   Tuco focuses harshly on Zippy and utters some strange words.
   Tuco slowly fades into existence.
   Huge flames burn Zippy from above.
   457H 129V 2266452X 13C [Grishnakh:Fair] [Zippy:V.Bad] Exits:NESW> You
   try to bash Zippy, but you miss and tumble forward onto your face.
   457H 129V 2266452X 13C [Grishnakh:Fair] [Zippy:V.Bad] Exits:NESW>
   Clamp focuses on you and utters some strange words.
   Your entire body tingles for a few seconds.
   608H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:V.Bad] Exits:NESW> st
   Cromat massacres Zippy with his crush.
   You miss Zippy with your crush.
   A Solamnic guard slashes Genja very hard.
   Zippy massacres YOU with his cleave.
   Genja slashes a Solamnic guard extremely hard.
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW>
   Zippy steps aside as Genja attempts a bash, stumbles, and falls flat on
   her face.
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW>
   Tuco focuses harshly on Zippy and utters some strange words.
   Tuco slowly fades into existence.
   Huge flames burn Zippy from above.
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW> bas
   zippy
   Clamp tells your group '-->>1 heal(s) left <<--'
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW>
   Cromat stands up.
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW>
   Zippy steps aside as Cromat attempts a bash, stumbles, and falls flat
   on his face.
   581H 129V 2266452X 13C [Grishnakh:V.Good] [Zippy:Awful] Exits:NESW>
   Cromat massacres Zippy with his crush.
   Zippy is incapacitated and will slowly die, if not aided.
   You annihilate Zippy with your crush.
   You receive 0 experience.
   Zippy is dead! R.I.P.
   get all.pile corpseexa corpseA Solamnic guard misses Genja with his
   slash.
   Genja massacres a Solamnic guard with her slash.
   The death cry of Zippy echoes from somewhere nearby...
   Zippy sinks gently to the ground.
   581H 129V 2266452X 13C Exits:NESW> You stand up.
   581H 129V 2266452X 13C Exits:NESW> You couldn't find what you were
   looking for.
   581H 129V 2266452X 13C Exits:NESW> You get a large pile of coins from
   the corpse of Zippy.
   There were 622 coins.
   split 622
   581H 129V 2266452X 635C Exits:NESW> It's a pretty ghastly sight!
   Searching through the remains, you find:
   corpse (here) :
   a scroll of recall..it glows blue
   a black adamantite bardiche..it glows blue
   a granite bracer [2]
   a black silk sash..it glows blue
   a woodsman's cloak..it glows blue
   a green leather quiver
   some red dragon scale sleeves..it glows blue
   a pair of spiked demi-gauntlets..it glows blue
   a pair of lion skin boots
   a helmet of ergothian battle armor..it glows blue
   a polished plate of mithril..it glows dimly
   a warlock's cloak
   a crimson pendant..it glows blue..it hums softly
   a malachite ring..it glows blue
   a silver and gold banded ring..it glows blue
   a gleaming pickaxe..it glows dimly
   a silver-tinged blade..it glows blue..it glows dimly
   a small wooden chest

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
