<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Grome is dead.R.I.P

POV:

Log Rating: 0.3333

535H 116V 5174689X 1330C Exits:NESW>
Grome arrives from the north.
bash Grome
535H 116V 5174689X 1330C Exits:NESW> You crash into Grome in a bone
crunching bash, sending him sprawling to the ground.
535H 116V 5174689X 1330C [Me:Perfect] [Grome:V.Good] Exits:NESW>
Napas gives a hill giant an order.
Grome steps aside as a hill giant attempts a bash, stumbles, and falls
flat on its face.
535H 116V 5174689X 1330C [Me:Perfect] [Grome:V.Good] Exits:NESW>
Napas gives a hill giant an order.
535H 116V 5174689X 1330C [Me:Perfect] [Grome:V.Good] Exits:NESW>
Medjub tells your group 'KUDA idem'
535H 116V 5174689X 1330C [Me:Perfect] [Grome:V.Good] Exits:NESW>
A hill giant massacres Grome with its hit.
You miss Grome with your stab.
Grome bludgeons YOU very hard.
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW>
Napas gives a hill giant an order.
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW>
Tsabu focuses harshly on Grome and utters some strange words.
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW>
Medjub focuses harshly on Grome and utters some strange words.
Grome freezes in place.
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW>
Napas gives a hill giant an order.
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW> bash
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
522H 116V 5174689X 1330C [Me:V.Good] [Grome:V.Good] Exits:NESW>
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard slashes YOU extremely hard.
A hill giant massacres Grome with its hit.
You massacre Grome with your stab.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW>
Tsabu focuses harshly on Grome and utters some strange words.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW>
A hill giant stands up.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW>
Medjub flies west.
Napas flies west.
Tsabu flies west.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW> You crash
into Grome in a bone crunching bash, sending him sprawling to the
ground.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW>
Napas flies in from the west.
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
A hill giant delivers a vicious kick to Grome's face. Blood flies as
his head snaps back.
484H 116V 5174689X 1330C [Me:V.Good] [Grome:Good] Exits:NESW>
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard massacres YOU with his slash.
A hill giant massacres Grome with its hit.
A hill giant massacres Grome with its hit.
You massacre Grome with your stab.
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
Klara tells your group 'buki fighting?'
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
Napas gives a hill giant an order.
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
Napas focuses harshly on Grome and utters some strange words.
Napas slowly fades into existence.
The sound of bones cracking echoes as Napas's force bolt slams into
Grome.
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
A hill giant delivers a quick snap kick to Grome. Grome staggers and
tries to recover.
438H 116V 5174689X 1330C [Me:Good] [Grome:Fair] Exits:NESW>
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard massacres YOU with his slash.
A hill giant massacres Grome with its hit.
You massacre Grome with your stab.
395H 116V 5174689X 1330C [Me:Fair] [Grome:Fair] Exits:NESW>
Medjub tells your group 'grome'
395H 116V 5174689X 1330C [Me:Fair] [Grome:Fair] Exits:NESW> stand
Napas focuses harshly on Grome and utters some strange words.
The sound of bones cracking echoes as Napas's force bolt slams into
Grome.
395H 116V 5174689X 1330C [Me:Fair] [Grome:Bad] Exits:NESW> You are
already standing.
395H 116V 5174689X 1330C [Me:Fair] [Grome:Bad] Exits:NESW>
Klara appears before you in a puff of smoke.
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
A hill giant delivers a quick snap kick to Grome. Grome staggers and
tries to recover.
395H 116V 5174689X 1330C [Me:Fair] [Grome:Bad] Exits:NESW>
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
395H 116V 5174689X 1330C [Me:Fair] [Grome:Bad] Exits:NESW>
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard slashes YOU extremely hard.
A hill giant massacres Grome with its hit.
A hill giant massacres Grome with its hit.
You stab Grome extremely hard.
351H 116V 5174689X 1330C [Me:Fair] [Grome:V.Bad] Exits:NESW> bashYou
crash into Grome in a bone crunching bash, sending him sprawling to the
ground.
351H 116V 5174689X 1330C [Me:Fair] [Grome:V.Bad] Exits:NESW> stand
Klara focuses harshly on Grome and utters some strange words.
351H 116V 5174689X 1330C [Me:Fair] [Grome:V.Bad] Exits:NESW>
Tsabu flies in from the west.
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
A hill giant delivers a vicious kick to Grome's face. Blood flies as
his head snaps back.
351H 116V 5174689X 1330C [Me:Fair] [Grome:V.Bad] Exits:NESW>
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard slashes YOU extremely hard.
A hill giant massacres Grome with its hit.
A hill giant massacres Grome with its hit.
You stab Grome very hard.
309H 116V 5174689X 1330C [Me:Fair] [Grome:Awful] Exits:NESW>
Tsabu focuses on you and utters some strange words.
Your entire body tingles for a few seconds.
530H 116V 5174689X 1330C [Me:V.Good] [Grome:Awful] Exits:NESW>
Napas focuses harshly on Grome and utters some strange words.
Napas aims a magic missile at Grome, who staggers under the blow.
Napas aims a magic missile at Grome, who staggers under the blow.
Napas aims a magic missile at Grome, who staggers under the blow.
Napas aims a magic missile at Grome, who staggers under the blow.
Napas aims a magic missile at Grome, who staggers under the blow.
530H 116V 5174689X 1330C [Me:V.Good] [Grome:Awful] Exits:NESW>
A Kalaman cityguard looks at you and yells 'There's the scoundrel!'
530H 116V 5174689X 1330C [Me:V.Good] [Grome:Awful] Exits:NESW> bash
A Kalaman cityguard slashes YOU extremely hard.
A Kalaman cityguard slashes YOU extremely hard.
A hill giant's powerful hit makes Grome double over in pain.
A hill giant annihilates Grome with its hit.
A hill giant massacres Grome with its hit.
You receive 0 experience.
get all.coins corpseexam corpseGrome is dead! R.I.P.
The death cry of Grome echoes from somewhere nearby...
You direct your attention to a Kalaman cityguard.
496H 116V 5174689X 1330C [Me:V.Good] [a Kalaman cityguard:Perfect]
Exits:NESW>
Klara leaves north.
496H 116V 5174689X 1330C [Me:V.Good] [a Kalaman cityguard:Perfect]
Exits:NESW>
Medjub flies in from the west.
You dodge out of the way of a Kalaman cityguard's mistargeted kick.
496H 116V 5174689X 1330C [Me:V.Good] [a Kalaman cityguard:Perfect]
Exits:NESW>
Klara arrives from the north.
496H 116V 5174689X 1330C [Me:V.Good] [a Kalaman cityguard:Perfect]
Exits:NESW> You are already standing.
496H 116V 5174689X 1330C [Me:V.Good] [a Kalaman cityguard:Perfect]
Exits:NESW> You crash into a Kalaman cityguard in a bone crunching
bash, sending him sprawling to the ground.
496H 116V 5174257X 1330C [Me:V.Good] [a Kalaman cityguard:V.Good]
Exits:NESW>
Tsabu gets a petrified cannabis clavariaceae from the corpse of Grome.
Tsabu gets a band of power from the corpse of Grome.
Tsabu gets a white dragonarmy bracer from the corpse of Grome.
Tsabu is zapped by a shimmering green cloak and instantly drops it.
Tsabu gets a small brass ring from the corpse of Grome.
496H 116V 5174257X 1330C [Me:V.Good] [a Kalaman cityguard:V.Good]
Exits:NESW>
Napas gets a red leather scabbard from the corpse of Grome.
Napas gets a shield of the Black Watch from the corpse of Grome.
Napas gets some spiked minotaur gauntlets from the corpse of Grome.
Napas gets a pair of steel plated boots from the corpse of Grome.
Napas gets a pair of ergothian battle armor greaves from the corpse of
Grome.
Napas gets a metallic visor from the corpse of Grome.
Napas gets a thick, bloodstained chain from the corpse of Grome.
Napas gets a crystal shard necklace from the corpse of Grome.
496H 116V 5174257X 1330C [Me:V.Good] [a Kalaman cityguard:V.Good]
Exits:NESW>
Klara gets a large waterskin from the corpse of Grome.
Klara gets a large waterskin from the corpse of Grome.
Klara gets a large hide waterskin from the corpse of Grome.
Klara gets a large waterskin from the corpse of Grome.
Klara gets a large waterskin from the corpse of Grome.
Klara gets a large waterskin from the corpse of Grome.
Klara gets a white steel dragonarmy shield from the corpse of Grome.
496H 116V 5174257X 1330C [Me:V.Good] [a Kalaman cityguard:V.Good]
Exits:NESW>
You massacre a Kalaman cityguard with your stab.
A Kalaman cityguard massacres YOU with his slash.
A Kalaman cityguard massacres YOU with his slash.
448H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW>
Medjub gets a small wooden chest from the corpse of Grome.
448H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW> get allstandfl
You miss a Kalaman cityguard with your stab.
A Kalaman cityguard massacres YOU with his slash.
425H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW>
Napas gives a hill giant an order.
425H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW>
A Kalaman cityguard stands up.
425H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW>
Napas issues the order 'st'.
425H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW> The corpse doesn't seem to have what you are looking for.
425H 116V 5173544X 1330C [Me:Good] [a Kalaman cityguard:Good]
Exits:NESW>
Tsabu focuses on you and utters some strange words.
Your entire body tingles for a few seconds.
532H 116V 5173544X 1330C [Me:V.Good] [a Kalaman cityguard:Good]
Exits:NESW> It's a pretty ghastly sight! Searching through the remains,
you find:
corpse (here) :
532H 116V 5173544X 1330C [Me:V.Good] [a Kalaman cityguard:Good]
Exits:NESW> You get a shimmering green cloak.
Corpse : You can't carry that much weight.
532H 116V 5173544X 1330C [Me:V.Good] [a Kalaman cityguard:Good]
Exits:NESW>
Medjub focuses harshly on a Kalaman cityguard and utters some strange
words.
532H 116V 5173544X 1330C [Me:V.Good] [a Kalaman cityguard:Good]
Exits:NESW> You are already standing.
532H 116V 5173544X 1330C [Me:V.Good] [a Kalaman cityguard:Good]
Exits:NESW> Klara utters some strange words.
You flee head over heels.
Traveler's Lodge
A Knight of Solamnia walks about the inn, keeping it safe.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
