<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Marieo Dies

   POV: Yellow Kupa

   Log Rating: 1.2000

   Kupas have their Revenge

   606H 80V 12607659X 1838C Exits:SW> s;bash marieo
   Takyr flies in from the north.
   A hill giant flies in from the north.
   The Valley Floor
   A hill giant is roaming around looking for something to kill. (flying)
   (invisible)
   <STD> Takyr, Ghostly Apparition is standing here. (flying) (invisible)
   (red
   aura)
   . . . is followed by a hovering ball of light.
   <RAID> Marieo of the Kupa Troopa Patrol is standing here, fighting a
   huge
   triceratops. (flying)
   A huge triceratops is sitting here, fighting Marieo.
   606H 78V 12607659X 1838C Exits:NSWU> You crash into Marieo in a bone
   crunching bash,
   sending him sprawling to the ground.
   606H 78V 12607659X 1838C [a huge triceratops:V.Bad] [Marieo:Fair]
   Exits:NSWU>
   Takyr gives a hill giant an order.
   A hill giant slowly fades into existence.
   Marieo steps aside as a hill giant attempts a bash, stumbles, and falls
   flat on
   its face.
   606H 78V 12607659X 1838C [a huge triceratops:V.Bad] [Marieo:Fair]
   Exits:NSWU>
   A hill giant hits Marieo extremely hard.
   You slash Marieo very hard.
   Marieo massacres a huge triceratops with his cleave.
   Marieo cleaves a huge triceratops extremely hard.
   A huge triceratops pierces Marieo hard.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:Fair]
   Exits:NSWU> st
   Takyr focuses harshly on Marieo and utters some strange words.
   Marieo wavers under the impact of the lightning bolt sent by Takyr.
   Marieo stands up.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:Bad]
   Exits:NSWU> gt frag it
   b
   A hill giant hits Marieo extremely hard.
   You slash Marieo hard.
   Marieo massacres a huge triceratops with his cleave.
   A huge triceratops misses Marieo with its pierce.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:Bad]
   Exits:NSWU> bash marieo
   You are already
   standing.
   Takyr focuses harshly on Marieo and utters some strange words.
   Marieo wavers under the impact of the lightning bolt sent by Takyr.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU> You tell your
   group 'frag it'
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU>
   Marieo sighs loudly.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU> You crash into
   Marieo in a bone crunching bash, sending him sprawling to the ground.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU>
   A huge triceratops stands up.
   A hill giant hits Marieo extremely hard.
   You slash Marieo very hard.
   Marieo cleaves a huge triceratops very hard.
   A huge triceratops misses Marieo with its pierce.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU> bash
   A hill giant stands up.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU> bash marieo
   Takyr gives a hill giant an order.
   A hill giant crashes into Marieo in a thundering collision, knocking
   him to the
   ground!
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:V.Bad]
   Exits:NSWU>
   Takyr focuses harshly on Marieo and utters some strange words.
   Marieo wavers under the impact of the lightning bolt sent by Takyr.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:Awful]
   Exits:NSWU>
   A hill giant hits Marieo extremely hard.
   You miss Marieo with your slash.
   Marieo cleaves a huge triceratops very hard.
   Marieo cleaves a huge triceratops very hard.
   A huge triceratops pierces Marieo extremely hard.
   606H 78V 12607659X 1838C [a huge triceratops:Awful] [Marieo:Awful]
   Exits:NSWU> gt hahah You crash into
   Marieo in a bone crunching bash, sending him sprawling to the ground.
   Takyr focuses harshly on Marieo and utters some strange words.
   Marieo receives the full blast of a lightning bolt from Takyr ... and
   is no
   more.
   You receive 0 experience.
   Marieo is dead! R.I.P.
   606H 78V 12607659X 1838C [Marieo:Dying] Exits:NSWU> gt hahah ow
   The death cry of Marieo echoes from somewhere nearby...
   606H 78V 12607659X 1838C Exits:NSWU> gt hahah owned
   g all marieo
   bash courtnie
   Takyr tells your group 'giant got overbash!'
   606H 120V 12607659X 1838C Exits:NSWU>
   Takyr gets a large bloodstained battleaxe from the corpse of Marieo.
   Takyr gets a glinting blue zircon bracelet from the corpse of Marieo.
   Takyr gets a blue beaded bracelet from the corpse of Marieo.
   Takyr gets a black velvet robe from the corpse of Marieo.
   Takyr gets gauntlets of ogre power from the corpse of Marieo.
   Takyr gets a set of worn leather riding chaps from the corpse of
   Marieo.
   Takyr gets a massive diamond crown from the corpse of Marieo.
   Takyr gets some thick leather armour from the corpse of Marieo.
   Takyr gets a shimmering silver cape from the corpse of Marieo.
   Takyr gets a shimmering silver cape from the corpse of Marieo.
   Takyr gets a carved stone seal from the corpse of Marieo.
   Takyr gets a large pile of coins from the corpse of Marieo.
   Takyr gets the meat of a huge triceratops from the corpse of Marieo.
   606H 120V 12607659X 1838C Exits:NSWU>
   Marieo tells you 'what the fuck'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
