<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What would be the single best change for Arctic?

   (*) Remove sheafs
   ( ) Remove rent decay
   ( ) Add more spells/skills to current classes
   ( ) Add more zones
   ( ) Add a new class
   ( ) Other
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   We fight it out with NOBASH PWA

   POV: Torqe

   Log Rating: 3.6667

   Gotta love hard hitting mobs!

   Kylar flies in from the east.
   Wapaton flies in from the east.
   Wapaton studies the area intently.
   Dincauze flies in from the east.
   Grooblicker flies in from the east.
   Orliqq flies in from the east.
   Quisti flies in from the east.
   A hill giant arrives from the east.
   431H 120V 1X 57.78% 11837C Mem:1 Exits:(N)ES> tel telia thThe demon
   Marilith crashes into Wapaton in a
   thundering collision, knocking him to the ground!
   431H 120V 1X 57.78% 11837C Mem:1 Exits:(N)ES> tel telia they
   Agrafesta takes aim at Kylar.
   431H 120V 1X 57.78% 11837C Mem:1 Exits:(N)ES>
   Agrafesta tries to plunk Kylar but misses and destroys an image.
   431H 120V 1X 57.78% 11837C Mem:1 Exits:(N)ES> tel telia they #TICK-10
   tel telia they
   Orliqq comes out of hiding.
   Suddenly Orliqq stabs you in the back.
   That Really did HURT!
   You feel a sharp pain in your chest, as Orliqq's sword breaks skin,
   creating a small flesh wound.
   301H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> tel telia theyYou tell your group '--TICK
   IN 10ish--'
   301H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Ninety focuses harshly on Quisti and utters some strange words.
   301H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> tel telia they
   Lu slowly fades into existence.
   Lu slashes Kylar extremely hard.
   Lu is burned, as he swings at Kylar.
   301H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> tel teli
   Kylar utters some strange words.
   Kylar conjures a writhing mass of inky black tentacles!
   Saphyre the fearsome blue dragon screams in pain as inky black
   tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Lu screams in pain as inky black tentacles constrict him.
   Baelron screams in pain as inky black tentacles constrict him.
   Ninety screams in pain as inky black tentacles constrict her.
   Agrafesta ducks out of the way of Kylar's attack.
   Zoe screams in pain as inky black tentacles constrict her.
   The demon Marilith screams in pain as inky black tentacles constrict
   it.
   You scream in pain as inky black tentacles constrict you.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   269H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   269H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> tel
   Baelron attempts to break free of the black tentacles, but fails!
   269H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Agrafesta tries to plunk Kylar but misses and destroys an image.
   Ninety screams in pain as inky black tentacles constrict her.
   Baelron screams in pain as inky black tentacles constrict him.
   Saphyre the fearsome blue dragon screams in pain as inky black
   tentacles constrict him.
   You scream in pain as inky black tentacles constrict you.
   The demon Marilith screams in pain as inky black tentacles constrict
   it.
   A solamnic gateguard misses Kylar and destroys an image instead.
   A solamnic gateguard annihilates Kylar with his cleave.
   A solamnic gateguard is burned, as he swings at Kylar.
   A solamnic gateguard's mightly cleave almost cuts Kylar in two.
   A solamnic gateguard obliterates Kylar with his cleave.
   A solamnic gateguard is burned, as he swings at Kylar.
   Zoe misses Kylar with her slash.
   Zoe slashes Kylar very hard.
   Zoe is burned, as she swings at Kylar.
   Amarnath slashes Kylar extremely hard.
   Amarnath is burned, as he swings at Kylar.
   Kylar wavers under Lu's mighty slash!
   Lu massacres Kylar with his slash.
   Lu is burned, as he swings at Kylar.
   Orliqq misses you with his pierce.
   Orliqq pierces YOU hard.
   Orliqq sinks his blade into your wrist, draining vital forces.
   Orliqq touches you and you feel your life drain from you to him.
   Wapaton hits the tentacles constricting the demon Marilith instead!
   Wapaton slashes the demon Marilith very hard.
   Wapaton massacres the demon Marilith with his slash.
   243H 120V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Quisti utters the words, 'gjigrul'.
   Quisti's hands send forth blinding rays of sunlight!
   Saphyre the fearsome blue dragon withers as a ray of sunlight sent by
   Quisti engulfs him!
   Saphyre the fearsome blue dragon seems to be blinded!
   Amarnath withers as a ray of sunlight sent by Quisti engulfs him!
   Lu withers as a ray of sunlight sent by Quisti engulfs him!
   Lu seems to be blinded!
   Baelron withers as a ray of sunlight sent by Quisti engulfs him!
   Ninety withers as a ray of sunlight sent by Quisti engulfs her!
   Agrafesta ducks out of the way of Quisti's attack.
   Zoe withers as a ray of sunlight sent by Quisti engulfs her!
   The demon Marilith withers as a ray of sunlight sent by Quisti engulfs
   it!
   The demon Marilith seems to be blinded!
   You wither as a ray of sunlight engulfs you!
   A solamnic gateguard withers as a ray of sunlight sent by Quisti
   engulfs him!
   A solamnic gateguard withers as a ray of sunlight sent by Quisti
   engulfs him!
   181H 120V 1X 57.78% 11837C [Me:Bad] [Orliqq:Perfect] Mem:1 Exits:(N)ES>
   Grooblicker utters some strange words.
   Grooblicker conjures a writhing mass of inky black tentacles!
   Saphyre the fearsome blue dragon screams in pain as inky black
   tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Lu screams in pain as inky black tentacles constrict him.
   Baelron screams in pain as inky black tentacles constrict him.
   Ninety screams in pain as inky black tentacles constrict her.
   Agrafesta ducks out of the way of Grooblicker's attack.
   Zoe screams in pain as inky black tentacles constrict her.
   The demon Marilith screams in pain as inky black tentacles constrict
   it.
   You scream in pain as inky black tentacles constrict you.
   You manage to slip away from the tentacles.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> grou
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe v.bad rested fighting Y N N Y 1 1
   Zoe v.good rested fighting Y N N Y 0 0
   Agrafesta perfect rested standing Y N Y Y 0 0
   Ninety fair rested fighting Y N N Y 0 3
   Baelron good rested fighting Y N N Y 0 0
   Lu good rested fighting Y N Y Y 1 0
   Amarnath good rested fighting Y N N Y 0 0
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> heal
   Agrafesta massacres Kylar with a plunk.
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES> heal me
   The tentacles constricting
   you make that impossible!
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Wapaton stands up.
   Zoe attacks Kylar with lightning fast series of attacks that leaves him
   defenseless.
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Dincauze focuses on Grooblicker and utters the words, 'heal'.
   Dincauze heals Grooblicker.
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:Perfect] Mem:1
   Exits:(N)ES>
   A solamnic gateguard gives Kylar a solid punch in the face.
   Agrafesta annihilates Kylar with a plunk.
   Agrafesta massacres a hill giant with a plunk.
   Agrafesta massacres Quisti with a plunk.
   Agrafesta massacres Orliqq with a plunk.
   Agrafesta tries to plunk Grooblicker but misses and destroys an image.
   Agrafesta massacres Dincauze with a plunk.
   Agrafesta massacres Wapaton with a plunk.
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt
   Ninety attempts to break free of the black tentacles, but fails!
   172H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt recall
   Ninety screams in pain as inky black tentacles constrict her.
   Baelron screams in pain as inky black tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Saphyre the fearsome blue dragon screams in pain as inky black
   tentacles constrict him.
   You scream in pain as inky black tentacles constrict you.
   The demon Marilith screams in pain as inky black tentacles constrict
   it.
   Dincauze misses Agrafesta with his hit.
   A hill giant hits Agrafesta very hard.
   Grooblicker barely hits Saphyre the fearsome blue dragon.
   Grooblicker bruises Saphyre the fearsome blue dragon with his hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti bruises Saphyre the fearsome blue dragon with her hit.
   A solamnic gateguard annihilates Kylar with his slash.
   A solamnic gateguard is burned, as he swings at Kylar.
   A solamnic gateguard misses Kylar with his cleave.
   A solamnic gateguard obliterates Kylar with his cleave.
   A solamnic gateguard is burned, as he swings at Kylar.
   You receive 0 experience.
   Kylar is dead! R.I.P.
   Orliqq drives his sword to an opening in your armor.
   Orliqq massacres YOU with his pierce.
   Orliqq pierces YOU hard.
   Wapaton hits the tentacles constricting the demon Marilith instead!
   Wapaton slashes the demon Marilith extremely hard.
   Wapaton hits the tentacles constricting the demon Marilith instead!
   The death cry of Kylar echoes from somewhere nearby...
   Wapaton stops fgt recall meollowing Kylar.
   Kylar now follows Wapaton.
   Wapaton is the new leader of Kylar's group.
   Kylar stops following Wapaton.
   A hill giant stops following Kylar.
   A hill giant transcends this world and enters another plane.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt recall me
   The tentacles constricting
   you make that impossible!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> Lu tells your group 'lbind'
   The tentacles constricting you make that impossible!
   Orliqq gets a large pile of coins from the corpse of Kylar.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> You tell your group 'recall
   me'
   Ninety attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt
   Orliqq gets a pair of sapphire studded shoes from the corpse of Kylar.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt im
   Amarnath attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt im
   Baelron attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES> gt im
   Agrafesta panics, and attempts to flee.
   Agrafesta flies east.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Zoe gets a vial of sparkling pink liquid from the corpse of Kylar.
   Zoe gets a potion of liquid brass from the corpse of Kylar.
   Zoe gets a glowing scroll of recall from the corpse of Kylar.
   Zoe gets a glowing scroll of recall from the corpse of Kylar.
   Zoe gets a glowing scroll of recall from the corpse of Kylar.
   Zoe gets a glowing scroll of recall from the corpse of Kylar.
   Zoe gets a jug of oil from the corpse of Kylar.
   Zoe gets a loaf of rye bread from the corpse of Kylar.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   Agrafesta flies in from the east.
   126H 120V 1X 57.78% 11837C [Me:V.Bad] [Orliqq:V.Good] Mem:1
   Exits:(N)ES>
   You scream in pain as inky black tentacles constrict you.
   The tentacles constricting you weaken and drop away.
   122H 120V 1X 57.78% 11837C Mem:1 Exits:(N)ES> #OK NEW TICKSIZE SET
   The demon Marilith screams in pain as inky black tentacles constrict
   it.
   Grooblicker bruises Saphyre the fearsome blue dragon with his hit.
   Grooblicker misses Saphyre the fearsome blue dragon with his hit.
   The demon Marilith misses Wapaton with its hit.
   Wapaton massacres the demon Marilith with his slash.
   Wapaton slashes the demon Marilith very hard.
   Wapaton slashes the demon Marilith extremely hard.
   Your studies complete, you close your prayerbook with a smile.
   The lightning has stopped.
   You feel less righteous.
   Baelron screams in pain as inky black tentacles constrict him.
   You are thirsty.
   Ninety screams in pain as inky black tentacles constrict her.
   Amarnath screams in pain as inky black tentacles constrict him.
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Orliqq flies in from the east.
   The demon Marilith spins and tries to kick Wapaton, but Wapaton dodges
   out of the way.
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   A solamnic gateguard gives Quisti a solid punch in the face.
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> sa
   Wapaton sends forth a giant wave.
   Agrafesta is flattened by a rogue wave.
   Saphyre the fearsome blue dragon is flattened by a rogue wave.
   Amarnath is flattened by a rogue wave.
   Lu is flattened by a rogue wave.
   Baelron is flattened by a rogue wave.
   Ninety is flattened by a rogue wave.
   Zoe is flattened by a rogue wave.
   The demon Marilith is flattened by a rogue wave.
   You are crushed to the floor by a giant wave.
   A solamnic gateguard is flattened by a rogue wave.
   A solamnic gateguard is flattened by a rogue wave.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say
   Wapaton leaps past Agrafesta, unbalancing them.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say
   The demon Marilith stands up.
   Dincauze focuses on Quisti and utters the words, 'heal'.
   Dincauze heals Quisti.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say hit
   Amarnath attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say hit me
   You say 'hit me'
   139H 134V 1X 57.78% 11837C Exits:(N)ES> l
   Agrafesta barely hits Wapaton.
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   A solamnic gateguard massacres Quisti with his slash.
   A solamnic gateguard is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon misses Grooblicker with his claw.
   Saphyre the fearsome blue dragon claws Grooblicker very hard.
   Grooblicker barely hits Saphyre the fearsome blue dragon.
   Grooblicker misses Saphyre the fearsome blue dragon with his hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   The demon Marilith misses Wapaton with its hit.
   Wapaton slashes the demon Marilith extremely hard.
   Wapaton slashes the demon Marilith extremely hard.
   The demon Marilith is incapacitated and will slowly die, if not aided.
   Wapaton obliterates the demon Marilith with his slash.
   The demon Marilith is dead! R.I.P.
   The death cry of the demon Marilith echoes from somewhere nearby...
   The demon Marilith stops following you.
   The demon Marilith transcends this world and enters another plane.
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> l
   Lu stands up.
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> The Southern Portcullis
   The corpse of the demon Marilith is lying here.
   A shard of marble lies on the ground.
   A small green jewel glints here.
   The corpse of Kylar is lying here.
   A sheaf of spellbook pages has been left here.
   <PWA> Orliqq In Redenbacher is standing here. (flying)
   <CORE> Agrafesta the Beasty Kender is sitting here, fighting Wapaton.
   (flying)
   <PWA> Quisti the Female Human is standing here, fighting Saphyre the
   fearsome blue dragon. (flying)
   (white aura)
   . . . is outlined with a dim aura.
   <PWA> Grooblicker the Male Human is standing here, fighting Saphyre the
   fearsome blue dragon.
   (flying)
   . . . is surrounded by 3 shimmering spheres.
   Dincauze the Male Gnome is standing here. (flying)
   . . . is outlined with a dim aura.
   <PWA> Wapaton Waupatuli, Fruitaciously Boozalicious is standing here,
   fighting Agrafesta. (flying)
   (white aura)
   Saphyre the fearsome blue dragon is sitting here, fighting Grooblicker.
   <CORE> Amarnath Marc Anterrabae is sitting here. (flying)
   . . . is overwhelmed by inky black tentacles.
   <CORE> Lu the Male Human is standing here. (flying) (invisible)
   <CORE> Baelron Mcjigglepuffs, the Kender is sitting here. (flying)
   (white aura)
   . . . is overwhelmed by inky black tentacles.
   Ninety Night, Leader of Core's Secret Cell is sitting here. (flying)
   . . . has a tough exterior.
   <CORE> Lady Zoe, Mistress of the Lily is sitting here. (flying)
   A solamnic gateguard is sitting here, fighting Quisti. (white aura)
   A solamnic gateguard is sitting here, fighting Quisti. (white aura)
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> s
   Lu tells your group 'heal me'
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say hit
   A solamnic gateguard stands up.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> You say 'hit'
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   A solamnic gateguard stands up.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> me
   Wapaton sends a swarm of flying piranha at Agrafesta.
   A piranha tears into Agrafesta's flesh.
   A piranha tears into Agrafesta's flesh.
   A piranha tears into Agrafesta's flesh.
   A piranha tears into Agrafesta's flesh.
   A piranha tears into Agrafesta's flesh.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> me
   Spells currently memorized:
   1: [ 2]aid [ 2]bless [ 1]create food
   [ 1]create water [ 1]cure light [ 1]know alignment
   [ 3]restore strength
   2: [ 3]blindness [ 3]cure blindness [ 1]light
   [ 1]remove curse [ 3]silence
   3: [ 3]cause serious [ 3]cure serious [ 2]gust of wind
   [ 3]remove poison
   4: [ 1]cloak of bravery [ 3]dispel magic [ 1]free action
   [ 1]heroism [ 2]hold person [ 1]prayer
   [ 1]sanctuary
   5: [ 7]cure critical [ 1]fortify self [ 1]holy aura
   6: [ 5]harm [ 1]restoration [ 5]summon
   7: [ 1]negative plane prote [ 4]sunbolt
   8: [ 2]gate [ 1]steelskin
   Spells left (level-number): 1-1 2-0 3-0 4-0 5-0 6-0 7-0 8-0
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say
   Agrafesta stands up.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say hit
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say hit me
   Wapaton slashes Agrafesta extremely hard.
   Wapaton slashes Agrafesta extremely hard.
   Wapaton slashes Agrafesta extremely hard.
   Agrafesta misses Wapaton with his hit.
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   A solamnic gateguard slashes Quisti extremely hard.
   A solamnic gateguard is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon misses Grooblicker with his claw.
   Grooblicker gracefully steps aside as Saphyre the fearsome blue dragon
   attacks!
   Grooblicker misses Saphyre the fearsome blue dragon with his hit.
   Grooblicker misses Saphyre the fearsome blue dragon with his hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Agrafesta panics, and attempts to flee.
   Agrafesta flies south.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> You say 'hit me'
   139H 134V 1X 57.78% 11837C Exits:(N)ES> sc
   You are Lord Torqe, Lord High Priest of Takhisis, a level 30
   Cleric.
   You are an Elder in Coalition on Risky Endeavors.
   You are rank 14. You have completed 57.78% of your next rank.
   You are 41 years old.
   You are thirsty.
   You have 139(431) hit and 134(134) movement points.
   Your behaviour has been Evil.
   You have scored 89999999 exp, and have 11837(64933) steel coins.
   You need 1 more experience to advance.
   You have died 10 horrible deaths.
   You have been connected for 29 minute(s).
   You have been playing for 12 day(s), 14 hour(s) and 14 minute(s).
   Your equipment is currently being concealed.
   You could comfortably carry more.
   You are sitting.
   You are flying.
   You are affected by the following:
   anti-spam measures
   resist heat
   resist cold
   heroism
   cloak of bravery
   bless
   sanctuary
   fortify self
   steelskin
   139H 134V 1X 57.78% 11837C Exits:(N)ES> s
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say i
   Grooblicker utters some strange words.
   Grooblicker stops fighting Saphyre the fearsome blue dragon.
   Saphyre the fearsome blue dragon stops fighting Grooblicker.
   A solamnic gateguard stops fighting Quisti.
   A solamnic gateguard stops fighting Quisti.
   Saphyre the fearsome blue dragon looks calmer.
   A solamnic gateguard looks calmer.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say im te
   Agrafesta flies in from the south.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> say im tented
   #TICK+10
   You say 'im tented'
   139H 134V 1X 57.78% 11837C Exits:(N)ES> h
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> heal m
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> heal me
   You can't do this sitting!
   139H 134V 1X 57.78% 11837C Exits:(N)ES>
   Quisti utters the words, 'heal'.
   Quisti heals Quisti.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> s
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> st
   You stand up.
   139H 134V 1X 57.78% 11837C Exits:(N)ES> heal
   Baelron attempts to break free of the black tentacles, but fails!
   139H 134V 1X 57.78% 11837C Exits:(N)ES> heal me
   You utter the words, 'heal'
   You heal yourself.
   Your entire body tingles for a few seconds.
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Zoe stands up.
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES> heal
   Baelron attempts to break free of the black tentacles, but fails!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES> heal l
   A solamnic gateguard crashes into Quisti in a thundering collision,
   knocking her to the ground!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES> heal lu
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Amarnath tells your group 'wow'
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   427H 134V 1X 57.78% 11837C Mem:7 Exits:(N)ES>
   Orliqq comes out of hiding.
   Orliqq thrusts an emerald short sword into your back.
   That Really did HURT!
   You feel a sharp pain in your chest, as Orliqq's sword breaks skin,
   creating a small flesh wound.
   280H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   280H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Wapaton slashes YOU extremely hard.
   263H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   263H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   263H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   263H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES>
   Bumpkin arrives from the east.
   263H 134V 1X 57.78% 11837C [Me:Fair] [Orliqq:Perfect] Mem:7
   Exits:(N)ES> Wapaton slashes YOU
   extremely hard.
   Wapaton slashes YOU hard.
   Wapaton slashes YOU very hard.
   Orliqq drives his sword to an opening in your armor.
   Orliqq massacres YOU with his pierce.
   Orliqq pierces YOU hard.
   You crush Orliqq hard.
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti very hard.
   Zoe is burned, as she swings at Quisti.
   A solamnic gateguard massacres Quisti with his slash.
   A solamnic gateguard is burned, as he swings at Quisti.
   Quisti barely hits Saphyre the fearsome blue dragon.
   A solamnic gateguard delivers a quick snap kick to Quisti. Quisti
   staggers and tries to recover.
   You utter the words, 'heal'
   You heal Lu.
   190H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   190H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Ninety tells your group 'tented'
   190H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Bumpkin bludgeons YOU extremely hard.
   Baelron attempts to break free of the black tentacles, but fails!
   174H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Grooblicker focuses harshly on Zoe and utters the words, 'hold person'.
   174H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Zoe attacks Quisti with lightning fast series of attacks that leaves
   her defenseless.
   174H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   174H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   174H 134V 1X 57.78% 11837C [Me:Bad] [Orliqq:V.Good] Mem:10 Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   You direct your attention to Wapaton.
   174H 134V 1X 57.78% 11837C [Me:Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   174H 134V 1X 57.78% 11837C [Me:Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES> hea
   Baelron attempts to break free of the black tentacles, but fails!
   174H 134V 1X 57.78% 11837C [Me:Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES> heal me
   Wapaton unleashes a swarm of flying piranha at you!
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Orliqq is continually trying to get behind you.
   Hmmm...i wonder what he's up to?
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES> heal me
   Baelron attempts to break free of the black tentacles, but fails!
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Agrafesta takes aim at Grooblicker.
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Agrafesta tries to plunk Grooblicker but misses and destroys an image.
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   131H 134V 1X 57.78% 11837C [Me:V.Bad] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   You wince in pain as your wounds bleed.
   You crush Wapaton very hard.
   Bumpkin bludgeons YOU very hard.
   A solamnic gateguard obliterates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   A solamnic gateguard obliterates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon claws madly at Quisti.
   Saphyre the fearsome blue dragon claws Quisti very hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU hard.
   Wapaton slashes YOU extremely hard.
   You wish your wounds would stop BLEEDING so much!
   Zoe massacres Quisti with her slash.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   A solamnic gateguard massacres Quisti with his slash.
   A solamnic gateguard is burned, as he swings at Quisti.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   76H 134V 1X 57.78% 11837C [Me:Awful] [Wapaton:V.Good] Mem:10
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   76H 134V 1X 57.78% 11837C [Me:Awful] [Wapaton:V.Good] Mem:10
   Exits:(N)ES> You utter the words,
   'heal'
   You heal yourself.
   Your entire body tingles for a few seconds.
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Quisti stands up.
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Agrafesta tries to plunk Grooblicker but misses and destroys an image.
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   426H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Grooblicker utters some strange words.
   Grooblicker conjures a writhing mass of inky black tentacles!
   Bumpkin screams in pain as inky black tentacles constrict her.
   Agrafesta screams in pain as inky black tentacles constrict him.
   Saphyre the fearsome blue dragon screams in pain as inky black
   tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Lu screams in pain as inky black tentacles constrict him.
   Baelron screams in pain as inky black tentacles constrict him.
   Ninety screams in pain as inky black tentacles constrict her.
   Zoe screams in pain as inky black tentacles constrict her.
   You scream in pain as inky black tentacles constrict you.
   You manage to slip away from the tentacles.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   A solamnic gateguard screams in pain as inky black tentacles constrict
   him.
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Bumpkin focuses her purity on your leg!
   Bumpkin focuses on your legs, but is thwarted by your quickness.
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Lu crashes into Quisti in a thundering collision, knocking her to the
   ground!
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Zoe gazes at Quisti with a look of evilness.
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Dincauze focuses on Quisti and utters the words, 'heal'.
   Dincauze heals Quisti.
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES> grou
   Amarnath attempts to break free of the black tentacles, but fails!
   413H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Ninety screams in pain as inky black tentacles constrict her.
   Baelron screams in pain as inky black tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Lu misses Grooblicker and destroys an image instead.
   Agrafesta misses Grooblicker with his hit.
   Grooblicker misses Bumpkin with his hit.
   Grooblicker misses Bumpkin with his hit.
   Bumpkin bludgeons YOU extremely hard.
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   A solamnic gateguard annihilates Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon claws Quisti hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon misses Quisti with his claw.
   Wapaton slashes YOU extremely hard.
   Wapaton slashes YOU hard.
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti very hard.
   Zoe is burned, as she swings at Quisti.
   A solamnic gateguard slashes Quisti extremely hard.
   A solamnic gateguard is burned, as he swings at Quisti.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti barely hits Saphyre the fearsome blue dragon.
   Baelron attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES> Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe good rested fighting Y N N Y 1 13
   Zoe good rested fighting Y N N Y 0 0
   Agrafesta good rested fighting Y N Y Y 0 0
   Ninety fair rested fighting Y N N Y 0 3
   Baelron fair rested fighting Y N N Y 0 0
   Lu v.good rested fighting Y N Y Y 1 0
   Amarnath good rested fighting Y N N Y 0 0
   Amarnath attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   A solamnic gateguard gives Quisti a solid punch in the face.
   Amarnath attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES> Who should the spell be
   cast upon?
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Bumpkin heroically rescues Quisti.
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Quisti stands up.
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Agrafesta panics, and attempts to flee.
   Agrafesta flies east.
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES> Who should the spell be
   cast upon?
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:13
   Exits:(N)ES> You utter the words,
   'harm'
   You grab Orliqq, who screams in pain.
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o d
   Agrafesta flies in from the east.
   Quisti avoids Saphyre the fearsome blue dragon's lightning breath.
   A solamnic gateguard gives Bumpkin a solid punch in the face.
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o demon ba
   Amarnath attempts to break free of the black tentacles, but fails!
   374H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o demon bas
   Ninety screams in pain as inky black tentacles constrict her.
   Baelron screams in pain as inky black tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   Orliqq pierces YOU extremely hard.
   You feel a sharp pain in your chest, as Orliqq's sword breaks skin,
   creating a small flesh wound.
   Orliqq pierces YOU extremely hard.
   A solamnic gateguard annihilates Bumpkin with his slash.
   Bumpkin massacres a solamnic gateguard with her bludgeon.
   Lu massacres Grooblicker with his slash.
   Grooblicker misses Bumpkin with his hit.
   Grooblicker misses Bumpkin with his hit.
   A solamnic gateguard massacres Quisti with his cleave.
   A solamnic gateguard is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon misses Quisti with his claw.
   Saphyre the fearsome blue dragon misses Quisti with his claw.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU very hard.
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti hard.
   Zoe is burned, as she swings at Quisti.
   Agrafesta takes aim at Grooblicker.
   300H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o demon bas wap
   Baelron attempts to break free of the black tentacles, but fails!
   300H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Ninety attempts to break free of the black tentacles, but fails!
   300H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   300H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Wapaton unleashes a swarm of flying piranha at you!
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   Agrafesta massacres Grooblicker with a plunk.
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o demon bas wapaton
   Ninety attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> o demon bas wapaton
   Amarnath attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> gro
   Quisti gulps the viscous black fluid and winces with pain. After a
   moment, she looks much better.
   Quisti heals Quisti.
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> grou
   Dincauze focuses on Quisti and utters the words, 'heal'.
   Dincauze heals Quisti.
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> hea
   Agrafesta massacres Grooblicker with a plunk.
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> heal me
   Lu crashes into Quisti in a thundering collision, knocking her to the
   ground!
   Amarnath attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES>
   Amarnath attempts to break free of the black tentacles, but fails!
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> You couldn't find anyone
   to order around.
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> A solamnic gateguard stops
   fighting his opponent and turns to Bumpkin instead.
   Agrafesta massacres Grooblicker with a plunk.
   Your group of 7 members consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe fair rested fighting Y N N Y 1 17
   Zoe good rested fighting Y N N Y 0 0
   Agrafesta good rested standing Y N Y Y 0 0
   Ninety fair rested fighting Y N N Y 0 3
   Baelron fair rested fighting Y N N Y 0 0
   Lu v.good rested fighting Y N Y Y 1 0
   Amarnath fair rested fighting Y N N Y 0 0
   264H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:V.Good] Mem:17
   Exits:(N)ES> You utter the words,
   'heal'
   You heal yourself.
   Your entire body tingles for a few seconds.
   429H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Baelron attempts to break free of the black tentacles, but fails!
   429H 134V 1X 57.78% 11837C [Me:V.Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Ninety screams in pain as inky black tentacles constrict her.
   Baelron screams in pain as inky black tentacles constrict him.
   Amarnath screams in pain as inky black tentacles constrict him.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   Orliqq massacres YOU with his pierce.
   Orliqq pierces YOU very hard.
   A solamnic gateguard massacres Bumpkin with his slash.
   A solamnic gateguard stumbles back as Bumpkin slams her staff on his
   face.
   Bumpkin annihilates a solamnic gateguard with her bludgeon.
   Ninety misses Grooblicker with her pierce.
   Baelron stabs Grooblicker extremely hard.
   Lu slashes Grooblicker very hard.
   Amarnath slashes Grooblicker extremely hard.
   Saphyre the fearsome blue dragon misses Quisti with his claw.
   Saphyre the fearsome blue dragon claws Quisti hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Wapaton slashes YOU extremely hard.
   Wapaton slashes YOU hard.
   Zoe massacres Quisti with her slash.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti hard.
   Zoe is burned, as she swings at Quisti.
   Quisti bruises Saphyre the fearsome blue dragon with her hit.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Ninety stands up.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES> st
   Ninety utters some strange words.
   A huge swarm of biting, stinging insects fills the air.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Agrafesta misses Grooblicker with his shot.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Baelron quaffs a vial of orange flame.
   Baelron smiles as the air around him solidifies.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES> st
   heal
   Zoe attacks Quisti with lightning fast series of attacks that leaves
   her defenseless.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Agrafesta massacres Grooblicker with a plunk.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Baelron stands up.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Baelron crashes into Grooblicker in a thundering collision, knocking
   him to the ground!
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Amarnath stands up.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES> Agrafesta annihilates
   Grooblicker with a plunk.
   You are already standing.
   367H 134V 1X 57.78% 11837C [Me:Good] [Wapaton:V.Good] Mem:20
   Exits:(N)ES>
   Orliqq deftly ducks out of the way of the attack.
   Bumpkin seems unaffected by Ninety's swarm of insects.
   Grooblicker screams as a swarm of insects engulfs him.
   Dincauze screams as a swarm of insects engulfs him.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard seems unaffected by Ninety's swarm of insects.
   Dincauze misses Ninety with his hit.
   Dincauze misses Ninety with his hit.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   Orliqq massacres YOU with his pierce.
   Orliqq pierces YOU hard.
   A solamnic gateguard massacres Bumpkin with his slash.
   Bumpkin misses a solamnic gateguard with her bludgeon.
   Baelron stabs Grooblicker extremely hard.
   Baelron stabs Grooblicker extremely hard.
   Lu slashes Grooblicker extremely hard.
   Amarnath massacres Grooblicker with his slash.
   Grooblicker misses Bumpkin with his hit.
   Grooblicker misses Bumpkin with his hit.
   You crush Wapaton very hard.
   Saphyre the fearsome blue dragon claws Quisti hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Wapaton slashes YOU extremely hard.
   Wapaton slashes YOU very hard.
   Zoe massacres Quisti with her slash.
   Zoe is burned, as she swings at Quisti.
   Zoe massacres Quisti with her slash.
   Zoe is burned, as she swings at Quisti.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Bumpkin heroically rescues Quisti.
   Quisti stands up.
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   Amarnath crashes into Dincauze in a thundering collision, knocking him
   to the ground!
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   gr
   Ninety utters some strange words.
   A huge swarm of biting, stinging insects fills the air.
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   grou
   A solamnic gateguard gives Bumpkin a solid punch in the face.
   Agrafesta massacres Grooblicker with a plunk.
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe fair rested fighting Y N N Y 1 20
   Zoe fair rested fighting Y N N Y 0 0
   Agrafesta good rested standing Y N Y Y 0 0
   Ninety fair rested fighting Y N N Y 0 6
   Baelron good rested fighting Y N N Y 0 0
   Lu v.good rested fighting Y N Y Y 1 0
   Amarnath fair rested fighting Y N N Y 0 0
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   h
   Lu crashes into Quisti in a thundering collision, knocking her to the
   ground!
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   heal
   Agrafesta annihilates Grooblicker with a plunk.
   You receive 0 experience.
   Grooblicker is dead! R.I.P.
   The death cry of Grooblicker echoes from somewhere nearby...
   Grooblicker stops following Wapaton.
   309H 134V 1X 57.78% 11837C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   heal You get a pile of coins from
   the corpse of Grooblicker.
   There were 62 coins.
   309H 134V 1X 57.78% 11899C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   heal zoIt's a pretty ghastly sight!
   Searching through the remains, you find:
   corpse (here) :
   Mishakal's White potion
   309H 134V 1X 57.78% 11899C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   heal zoe
   You can't split 62 evenly
   among the people in the room; splitting 56 instead.
   You divide 56 coins equally among the group members present.
   Bumpkin spasms as Zoe places her hand on Bumpkin's chest.
   309H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:20 Exits:(N)ES>
   You utter the words, 'heal'
   You heal Zoe.
   309H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   Orliqq seems unaffected by Ninety's swarm of insects.
   Bumpkin screams as a swarm of insects engulfs her.
   Dincauze screams as a swarm of insects engulfs him.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   Orliqq deftly ducks out of the way of the attack.
   Bumpkin screams as a swarm of insects engulfs her.
   Dincauze screams as a swarm of insects engulfs him.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard seems unaffected by Ninety's swarm of insects.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   Ninety misses Dincauze with her pierce.
   Zoe slashes Bumpkin very hard.
   Zoe slashes Bumpkin extremely hard.
   Bumpkin bludgeons Zoe extremely hard.
   Dincauze misses Ninety with his hit.
   Dincauze misses Ninety with his hit.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   A solamnic gateguard annihilates Bumpkin with his cleave.
   Orliqq massacres YOU with his pierce.
   Orliqq pierces YOU hard.
   A solamnic gateguard massacres Bumpkin with his slash.
   Saphyre the fearsome blue dragon misses Quisti with his claw.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU hard.
   Wapaton slashes YOU extremely hard.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   get
   Orliqq gets Mishakal's White potion from the corpse of Grooblicker.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   get all
   Bumpkin gets a sheaf of spellbook pages.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   get all grooblicker
   Ninety gets a blood red adamantite shield from the corpse of the demon
   Marilith.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   Dincauze stands up.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   st
   Bumpkin panics, and attempts to flee.
   242H 134V 1X 57.78% 11851C [Me:Fair] [Wapaton:Good] Mem:23 Exits:(N)ES>
   A solamnic gateguard delivers a quick snap kick to Bumpkin. Bumpkin
   staggers and tries to recover.
   Bumpkin is mortally wounded, and will die soon, if not aided.
   Quisti steps aside as Baelron attempts a bash, stumbles, and falls flat
   on his face.
   Wapaton unleashes a swarm of flying piranha at you!
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   A piranha digs into your flesh.
   203H 134V 1X 57.78% 11851C [Me:Bad] [Wapaton:Good] Mem:23 Exits:(N)ES>
   st
   Dincauze panics, and attempts to flee.
   Dincauze flies east.
   203H 134V 1X 57.78% 11851C [Me:Bad] [Wapaton:Good] Mem:23 Exits:(N)ES>
   heal The corpse doesn't seem to
   have what you are looking for.
   203H 134V 1X 57.78% 11851C [Me:Bad] [Wapaton:Good] Mem:23 Exits:(N)ES>
   heal meYou are already standing.
   203H 134V 1X 57.78% 11851C [Me:Bad] [Wapaton:Good] Mem:23 Exits:(N)ES>
   heal me
   A horrible scream escapes
   Bumpkin's lips as thousands of swarming insects
   suck her life away.
   You receive 0 experience.
   Bumpkin is dead! R.I.P.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   Wapaton screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   Baelron stabs Quisti hard.
   Baelron is burned, as he swings at Quisti.
   Baelron stabs Quisti extremely hard.
   Baelron is burned, as he swings at Quisti.
   You crush Wapaton extremely hard.
   Saphyre the fearsome blue dragon claws Quisti hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon claws Quisti.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Wapaton slashes YOU extremely hard.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU very hard.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   Quisti bruises Saphyre the fearsome blue dragon with her hit.
   The death cry of Bumpkin echoes from somewhere nearby...
   You utter the words, 'heal'
   You heal yourself.
   Your entire body tingles for a few seconds.
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES>
   Orliqq is continually trying to get behind you.
   Hmmm...i wonder what he's up to?
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> g
   Zoe gets a long steel staff from the corpse of Bumpkin.
   Zoe gets a refracting robe of bronze dragon scales from the corpse of
   Bumpkin.
   Zoe gets a spired silver helm from the corpse of Bumpkin.
   Zoe is zapped by a silver Solamnic signet ring and instantly drops it.
   Zoe gets a large emerald ring from the corpse of Bumpkin.
   Zoe gets a sheaf of spellbook pages from the corpse of Bumpkin.
   Zoe gets a glowing bracer from the corpse of Bumpkin.
   Zoe gets a jeweled bracer from the corpse of Bumpkin.
   Zoe gets a pair of sterling gauntlets from the corpse of Bumpkin.
   Zoe is zapped by a golden battle ankh and instantly drops it.
   Zoe gets a plain component pouch from the corpse of Bumpkin.
   Zoe gets a crimson dust covered chest from the corpse of Bumpkin.
   Zoe gets a white snowy eagle feather from the corpse of Bumpkin.
   Zoe gets a bighorn sheep skull from the corpse of Bumpkin.
   Zoe gets a silk ribbon from the corpse of Bumpkin.
   Zoe gets a glowing scroll of recall from the corpse of Bumpkin.
   Zoe gets a glowing scroll of recall from the corpse of Bumpkin.
   Zoe gets a small canteen from the corpse of Bumpkin.
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> get al
   Quisti stands up.
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> get all bu
   Lu gets a scroll of improved transport from the corpse of Bumpkin.
   Lu gets a glowing scroll of recall from the corpse of Bumpkin.
   Lu gets a small circlet of bronze from the corpse of Bumpkin.
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> get all bump
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES>
   Orliqq is continually trying to get behind you.
   Hmmm...i wonder what he's up to?
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> get all bumpki
   Lu slowly fades into existence.
   Lu crashes into Quisti in a thundering collision, knocking her to the
   ground!
   428H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES> get all bumpkin
   Orliqq screams as a swarm of insects engulfs him.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   Orliqq screams as a swarm of insects engulfs him.
   Wapaton deftly ducks out of the way of the attack.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard massacres Ninety with his slash.
   A solamnic gateguard annihilates Ninety with his cleave.
   Orliqq gracefully steps aside as Ninety attacks!
   Ninety stumbles and accidentally attacks a solamnic gateguard!
   Ninety misses a solamnic gateguard with her pierce.
   Orliqq's sword flashes a brilliant green colour as he jams it between
   the ribs.
   Orliqq comes out of hiding.
   Ninety gracefully steps aside as Orliqq attacks!
   Orliqq stumbles and accidentally attacks a solamnic gateguard!
   Orliqq massacres a solamnic gateguard with his pierce.
   Orliqq pierces Ninety extremely hard.
   Lu slashes Quisti extremely hard.
   Lu is burned, as he swings at Quisti.
   Zoe slashes Quisti extremely hard.
   Zoe is burned, as she swings at Quisti.
   Zoe slashes Quisti very hard.
   Zoe is burned, as she swings at Quisti.
   Baelron stabs Quisti extremely hard.
   Baelron is burned, as he swings at Quisti.
   Baelron drives his pike to an opening in Quisti's armor.
   Baelron massacres Quisti with his stab.
   Baelron is burned, as he swings at Quisti.
   Saphyre the fearsome blue dragon claws Quisti hard.
   Saphyre the fearsome blue dragon is burned, as he swings at Quisti.
   Wapaton slashes YOU very hard.
   Wapaton slashes YOU very hard.
   Quisti misses Saphyre the fearsome blue dragon with her hit.
   402H 134V 1X 57.78% 11851C [Me:V.Good] [Wapaton:Good] Mem:26
   Exits:(N)ES>
   Wapaton panics, and attempts to flee.
   Wapaton flies south.
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> The corpse doesn't seem
   to have what you are looking
   for.
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> cIt's a pretty ghastly
   sight! Searching through the
   remains, you find:
   corpse (here) :
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> The corpse doesn't seem
   to have what you are looking
   for.
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> You couldn't find anyone
   to order around.
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> ch
   Ninety focuses harshly on Quisti and utters some strange words.
   402H 134V 1X 57.78% 11851C Mem:26 Exits:(N)ES> ch quisti
   You utter the words, 'hold person'
   Agrafesta takes aim at Quisti.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   Agrafesta annihilates Quisti with a plunk.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES> #TICK-10
   !
   Baelron stands up.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   Baelron crashes into Quisti in a thundering collision, knocking her to
   the ground!
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   Agrafesta massacres Quisti with a plunk.
   Zoe attacks Quisti with lightning fast series of attacks that leaves
   her defenseless.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   A solamnic gateguard screams as a swarm of insects engulfs him.
   A solamnic gateguard seems unaffected by Ninety's swarm of insects.
   The swarm of insects dissipates.
   Ninety misses a solamnic gateguard with her pierce.
   A solamnic gateguard massacres Ninety with his slash.
   A solamnic gateguard annihilates Ninety with his cleave.
   A solamnic gateguard annihilates Ninety with his cleave.
   Ninety is dead! R.I.P.
   Lu slashes Quisti very hard.
   Lu is burned, as he swings at Quisti.
   You receive 0 experience.
   Quisti is dead! R.I.P.
   The death cry of Quisti echoes from somewhere nearby...
   The death cry of Ninety echoes from somewhere nearby...
   Ninety stops following Zoe.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   Agrafesta gets a pile of coins from the corpse of Ninety.
   402H 134V 1X 57.78% 11851C Mem:28 Exits:(N)ES>
   Agrafesta divides 54 coins equally among the group members present.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES>
   Amarnath gets a flaming white whip from the corpse of Ninety.
   Amarnath gets a sharp twig from the corpse of Ninety.
   Amarnath gets a plain component pouch from the corpse of Ninety.
   Amarnath gets a length of rope from the corpse of Ninety.
   Amarnath gets a black velvet gown from the corpse of Ninety.
   Amarnath gets a small circlet of bronze from the corpse of Ninety.
   Amarnath gets a gold and ruby necklace from the corpse of Ninety.
   Amarnath gets a necklace made of finger bones from the corpse of
   Ninety.
   Amarnath gets a wedding ring from the corpse of Ninety.
   Amarnath gets a blood red adamantite shield from the corpse of Ninety.
   Amarnath gets an oversized pearl from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   Amarnath gets a piece of sweet bread from the corpse of Ninety.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> You tell your group
   '--TICK IN 10ish--'
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> geWho should the spell
   be cast upon?
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> get shThe corpse doesn't
   seem to have what you are looking
   for.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> get sheafIt's a pretty
   ghastly sight! Searching through the
   remains, you find:
   corpse (here) :
   a piece of sweet bread [3]
   a clear potion of invisibility
   a dozen roses
   a jug of oil [3]
   a length of rope
   a lump of blood red mud
   a map of Tarsis
   a miner's tunic
   a small wooden chest
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> get sheaf
   c You get a sheaf of spellbook pages.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> c 'harm'quist
   The swarm of insects dissipates.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> c 'harm'quisti
   Who should the spell be cast upon?
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES>
   Lu gets a piece of sweet bread from the corpse of Ninety.
   Lu gets a piece of sweet bread from the corpse of Ninety.
   Lu gets a piece of sweet bread from the corpse of Ninety.
   Lu gets a clear potion of invisibility from the corpse of Ninety.
   Lu gets a dozen roses from the corpse of Ninety.
   Lu gets a jug of oil from the corpse of Ninety.
   Lu gets a jug of oil from the corpse of Ninety.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> l
   The Southern Portcullis
   The corpse of Ninety is lying here.
   A quartz crystal sphere has been dropped here.
   The corpse of Quisti is lying here.
   A golden cross with a loop for its upper vertical arm is here...it
   glows dimly
   A gleaming silver signet ring lies on the ground.
   The corpse of Bumpkin is lying here.
   The corpse of Grooblicker is lying here.
   The corpse of the demon Marilith is lying here.
   A shard of marble lies on the ground.
   A small green jewel glints here.
   The corpse of Kylar is lying here.
   <CORE> Agrafesta the Beasty Kender is standing here. (flying)
   Saphyre the fearsome blue dragon is sitting here.
   <CORE> Amarnath Marc Anterrabae is standing here. (flying)
   <CORE> Lu the Male Human is standing here. (flying) (invisible)
   <CORE> Baelron Mcjigglepuffs, the Kender is standing here. (flying)
   (white aura)
   <CORE> Lady Zoe, Mistress of the Lily is standing here. (flying)
   A knight of the sword guards the gate here. (white aura)
   A solamnic gateguard stands here at rigid attention. (white aura)
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> s
   Agrafesta says 'e win'
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> say nice job
   You say 'nice job'
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> get sheaf
   You don't see what you are looking for here.
   402H 134V 1X 57.78% 11860C Mem:28 Exits:(N)ES> get sph
   The cloud-veiled sky becomes even darker as the sun sets.
   You feel less righteous.
   You are thirsty.
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES> get sphere
   Your clanmate Fifty has entered the game.
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES> get sphere
   You get a quartz crystal sphere.
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES> #TICK!!!
   Agrafesta says 'get all'
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES> i
   You are carrying:
   a quartz crystal sphere
   a sheaf of spellbook pages
   a tall candle stand
   a white wolf figurine
   a crimson dust covered chest
   a glowing scroll of recall..it glows dimly [5]
   a magic pouch..it glows dimly
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES>
   Amarnath tells your group 'nice'
   406H 134V 1X 57.78% 11860C Mem:27 Exits:(N)ES> l
   The Southern Portcullis
   The corpse of Ninety is lying here.
   The corpse of Quisti is lying here.
   A golden cross with a loop for its upper vertical arm is here...it
   glows dimly
   A gleaming silver signet ring lies on the ground.
   The corpse of Bumpkin is lying here.
   The corpse of Grooblicker is lying here.
   The corpse of the demon Marilith is lying here.
   A shard of marble lies on the ground.
   A small green jewel glints here.
   The corpse of Kylar is lying here.
   <CORE> Agrafesta the Beasty Kender is standing here. (flying)
   Saphyre the fearsome blue dragon is sitting here.
   <CORE> Amarnath Marc Anterrabae is standing here. (flying)
   <CORE> Lu the Male Human is standing here. (flying) (invisible)
   <CORE> Baelron Mcjigglepuffs, the Kender is standing here. (flying)
   (white aura)
   <CORE> Lady Zoe, Mistress of the Lily is standing here. (flying)
   A knight of the sword guards the gate here. (white aura)
   A solamnic gateguard stands here at rigid attention. (white aura)

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
