   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   Which zone do you hate the MOST?

   (*) Silvanesti
   ( ) Deepmines
   ( ) Caverns of Thorbardin
   ( ) Dun Mir
   ( ) Mithas
   ( ) Ravenshadow
   ( ) Castle Uth Wistan
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   Tourny Fight 2
   [26]View Comments (8)

   POV: Belvedere

   Log Rating: 0.0000

   VA Dominates Part 2

   491H 156V 1X 22.02% 96C Mem:2 Exits:NW> #OK NEW TICKSIZE SET
   Vayn closes his prayerbook with a content look on his face.
   Vayn utters the words, 'bless'.
   Vayn shines with a holy light.
   491H 158V 1X 22.02% 96C Mem:1 Exits:NW> n
   sca
   Moonglum flies in from the south.
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 156V 1X 22.02% 96C Mem:1 Exits:NSW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   491H 156V 1X 22.02% 96C Mem:1 Exits:NSW> n
   Vayn utters the words, 'aid'.
   Moonglum flies in from the south.
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 154V 1X 22.02% 96C Mem:1 Exits:SW> w
   Moonglum flies in from the east.
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 152V 1X 22.02% 96C Mem:1 Exits:ESW> w
   Moonglum flies in from the east.
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 150V 1X 22.02% 96C Mem:1 Exits:ES> s
   Moonglum flies in from the north.
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   A wall of force completely blocks off the exit to the south..it glows
   blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 148V 1X 22.02% 96C Mem:1 Exits:NES> e
   Moonglum flies in from the west.
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 146V 1X 22.02% 96C Mem:1 Exits:NESW> s
   Moonglum flies in from the north.
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   491H 144V 1X 22.02% 96C Mem:1 Exits:NEW> w
   Moonglum flies in from the east.
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   A wall of force completely blocks off the north exit...it glows blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <VA> Lord Moonglum is standing here. (flying)
   You sense a life form.
   <CORE> Mis Take, Letting Me Heal For You is standing here. (flying)
   (invisible)
   . . . is outlined by a dim aura.
   <CORE> Belefonte, Hiding In Your Alley is standing here. (flying)
   (invisible)
   . . . is surrounded by 3 shimmering spheres.
   <CORE> Rubie Red, Making You Dead is standing here. (flying)
   491H 142V 1X 22.02% 96C Mem:1 Exits:NE>
   Jonny deftly steps in front of the attack on you.
   Spidur slowly fades into existence.
   Spidur comes out of hiding.
   Spidur places an emerald short sword in Jonny's back, resulting in some
   strange noises and some
   blood.
   491H 142V 1X 22.02% 96C Mem:1 Exits:NE>
   Moonglum misses Belefonte and destroys an image instead.
   After briefly disappearing, Belefonte's mirror image pops back into
   view.
   491H 142V 1X 22.02% 96C Mem:1 Exits:NE> c 'su
   Rubie appears to be dancing around the room.
   491H 142V 1X 22.02% 96C Mem:1 Exits:NE> c 'sunr
   Mis focuses on Spidur and utters the words, 'aid'.
   491H 142V 1X 22.02% 96C Mem:1 Exits:NE> c 'sunr'
   You utter the words, 'sunray'
   Your hands send forth blinding rays of sunlight!
   Spidur withers as a ray of sunlight engulfs him!
   Spidur seems to be blinded!
   Mis withers as a ray of sunlight engulfs her!
   You destroy Belefonte's mirror images.
   Some of Belefonte's mirror images pop back into view.
   Belefonte withers as a ray of sunlight engulfs him!
   Rubie deftly ducks out of the way of your attack.
   491H 142V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE>
   Jonny deftly steps in front of you, pushing you out of the way.
   Jonny comes to your rescue! You're thankful, but a bit dazed.
   Mis misses Jonny with her hit.
   Jonny massacres Mis with his slash.
   Jonny massacres Mis with his slash.
   You sting Spidur extremely hard.
   Moonglum misses Belefonte and destroys an image instead.
   After briefly disappearing, Belefonte's mirror image pops back into
   view.
   Belefonte misses Moonglum with his bludgeon.
   Spidur misses Jonny with his pierce.
   Spidur pierces Jonny very hard.
   491H 142V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE>
   Vayn slowly fades into existence.
   Vayn massacres Mis with his slash.
   491H 142V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE>
   Rubie comes out of hiding.
   Rubie places an emerald short sword in Moonglum's back, resulting in
   some strange noises and some
   blood.
   491H 142V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE> #TICK+10
   Belefonte utters some strange words.
   A blastwave detonates from Belefonte's hands!
   Belefonte's thunderous blastwave brutally breaks against Mavlad the
   bronze dragon's chest.
   Mavlad the bronze dragon looks un-well after taking the brunt of the
   blastwave in the gut.
   Belefonte's thunderous blastwave brutally breaks against Jonny's chest.
   Belefonte's thunderous blastwave brutally breaks against Vez the
   fearsome blue dragon's chest.
   Belefonte's thunderous blastwave brutally breaks against Vayn's chest.
   Belefonte's thunderous blastwave brutally breaks against Moonglum's
   chest.
   Belefonte's thunderous blastwave breaks against your chest, shattering
   ribs.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE>
   Jonny focuses his purity on Mis's arm!
   Jonny focuses on Mis's arm, but is thwarted.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE>
   Moonglum nods solemnly.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE> g
   Mis utters the words, 'aid'.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:V.Good] Mem:2
   Exits:NE> grou
   Vez the fearsome blue dragon misses Belefonte and destroys an image
   instead.
   After briefly disappearing, Belefonte's mirror image pops back into
   view.
   Vez the fearsome blue dragon misses Belefonte and destroys an image
   instead.
   After briefly disappearing, Belefonte's mirror image pops back into
   view.
   Mavlad the bronze dragon misses Belefonte and destroys an image
   instead.
   Rubie pierces Moonglum extremely hard.
   Rubie pierces Moonglum very hard.
   Vayn massacres Mis with his slash.
   Vayn massacres Mis with his stab.
   Jonny massacres Mis with his slash.
   Jonny massacres Mis with his slash.
   You sting Spidur very hard.
   Moonglum misses Belefonte and destroys an image instead.
   Spidur pierces Jonny extremely hard.
   Spidur pierces Jonny extremely hard.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE> grou
   Belefonte is hit by Vez the fearsome blue dragon's lightning breath.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE> Your group of 4 members
   consists of:
   Member Hits Move Position Fly Inv Water iMT Here Light Mem
   -----------------------------------------------------------------------
   ----------
   Belvedere good rested fighting Y N N N Y 0 2
   Moonglum fair rested fighting Y N N N Y 0 0
   Vayn v.good rested fighting Y N N N Y 0 1
   Jonny fair rested fighting Y N N N Y 0 1
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE>
   Jonny attempts to strike at Mis with his halberd.
   Jonny slashes Mis extremely hard.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE> c 'sun
   Vayn gives Vez the fearsome blue dragon an order.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE> c 'sunr'
   Vayn attacks Mis with lightning fast series of attacks that leaves her
   defenseless.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE> You utter the words,
   'sunray'
   Your hands send forth blinding rays of sunlight!
   Spidur withers as a ray of sunlight engulfs him!
   Mis withers as a ray of sunlight engulfs her!
   You destroy Belefonte's mirror images.
   Some of Belefonte's mirror images pop back into view.
   Belefonte withers as a ray of sunlight engulfs him!
   Rubie withers as a ray of sunlight engulfs her!
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE>
   Belefonte focuses harshly on Moonglum and utters some strange words.
   Belefonte grins as his force missile crashes into Moonglum.
   Belefonte grins as his force missile crashes into Moonglum.
   Belefonte grins as his force missile crashes into Moonglum.
   Belefonte grins as his force missile crashes into Moonglum.
   The power of Belefonte's force missile knocks Moonglum onto his butt.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Fair] [Spidur:Good] Mem:2
   Exits:NE>
   Vez the fearsome blue dragon misses Belefonte and destroys an image
   instead.
   Mavlad the bronze dragon misses Belefonte and destroys an image
   instead.
   Rubie massacres Moonglum with her pierce.
   Rubie pierces Moonglum extremely hard.
   Vayn annihilates Mis with his slash.
   Vayn massacres Mis with his stab.
   Mis misses Jonny with her hit.
   Jonny annihilates Mis with his slash.
   Mis is stunned, but will likely regain consciousness again.
   Mis wavers under Jonny's mighty slash!
   Jonny obliterates Mis with his slash.
   Mis has been defeated.
   There is a flash of light and then Mis is gone.
   Moonglum slashes Belefonte very hard.
   Spidur massacres Jonny with his pierce.
   Spidur pierces Jonny very hard.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Bad] [Spidur:Good] Mem:2
   Exits:NE> heal jo
   Rubie arrives from the east.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Bad] [Spidur:Good] Mem:2
   Exits:NE> heal jonny
   Rubie comes out of hiding.
   Rubie places an emerald short sword in Moonglum's back, resulting in
   some strange noises and some
   blood.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:Bad] [Spidur:Good] Mem:2
   Exits:NE> You utter the words,
   'heal'
   You heal Jonny.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE>
   Belefonte focuses harshly on you and utters some strange words.
   Belefonte throws webbing all over you!
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt
   Rubie massacres Moonglum with her pierce.
   Rubie pierces Moonglum very hard.
   Vez the fearsome blue dragon misses Belefonte with his claw.
   Vez the fearsome blue dragon claws Belefonte hard.
   Mavlad the bronze dragon hits Belefonte.
   Moonglum slashes Belefonte very hard.
   Jonny blocks Spidur's blow with a quick raise of his shield.
   Jonny blocks Spidur's blow with a quick raise of his shield.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt OH DAM
   gt FREE
   Moonglum looks at Belefonte.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt FREE ACBelefonte is hit by
   Mavlad the bronze dragon's lightning breath.
   You tell your group 'OH DAM'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt FREE ACTIBelefonte focuses
   harshly on Moonglum and utters some strange words.
   Belefonte grins as his force missile crashes into Moonglum.
   Belefonte grins as his force missile crashes into Moonglum.
   Moonglum is incapacitated and will slowly die, if not aided.
   The force missile sent by Belefonte causes Moonglum to stagger and
   collapse in a
   lifeless heap.
   Moonglum has been defeated.
   There is a flash of light and then Moonglum is gone.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt FREE ACTION ME
   Your clanmate Gath has entered the game.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> gt FREE ACTION ME CLIFF
   You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> !
   Vayn slowly fades into existence.
   Vayn massacres Belefonte with his slash.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE> !
   You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Good] Mem:3
   Exits:NE>
   Vayn massacres Belefonte with his slash.
   Vayn massacres Belefonte with his stab.
   Jonny swings his halberd, catching Spidur's feet, tripping him up.
   Jonny massacres Spidur with his slash.
   Jonny annihilates Spidur with his slash.
   Vez the fearsome blue dragon claws Belefonte very hard.
   Mavlad the bronze dragon fumbles and fails to swing at his target.
   Spidur's sword flashes a brilliant green colour as he jams it between
   the ribs.
   Spidur massacres Jonny with his pierce.
   Jonny deflects part of Spidur's blow with his shield.
   Spidur barely pierces Jonny.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE> !
   You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE> !
   You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE> You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE> !
   You tell your group
   'FREE ACTION ME CLIFF'
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Rubie comes out of hiding.
   Rubie places an emerald short sword in Vayn's back, resulting in some
   strange noises and some blood.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Rubie massacres Vayn with her pierce.
   Rubie misses Vayn with her pierce.
   Vayn massacres Belefonte with his slash.
   Vayn massacres Belefonte with his stab.
   Jonny annihilates Spidur with his slash.
   Jonny annihilates Spidur with his slash.
   Vez the fearsome blue dragon claws Belefonte very hard.
   Mavlad the bronze dragon misses Belefonte with his hit.
   Jonny blocks Spidur's blow with a quick raise of his shield.
   Spidur pierces Jonny extremely hard.
   420H 142V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Belefonte focuses harshly on Vayn and utters some strange words.
   Belefonte grins as his force missile crashes into Vayn.
   Belefonte grins as his force missile crashes into Vayn.
   Belefonte grins as his force missile crashes into Vayn.
   Belefonte grins as his force missile crashes into Vayn.
   Mavlad the bronze dragon screams in horror and pain as Belefonte's
   force missile explodes!
   Jonny screams in horror and pain as Belefonte's force missile explodes!
   Vez the fearsome blue dragon tries in vain to protect himself as
   Belefonte's force missile explodes!
   There is a bright flash as Belefonte's force missile explodes in your
   face!
   The sticky strands of webbing binding you dissolve.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Jonny focuses his purity on Spidur's arm!
   Jonny forces Spidur to drop his weapon.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Vayn hugs himself gleefully for no apparent reason.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE> grou
   Your group of 4 members
   consists of:
   Member Hits Move Position Fly Inv Water iMT Here Light Mem
   -----------------------------------------------------------------------
   ----------
   Belvedere good rested fighting Y N N N Y 0 3
   Moonglum awful rested standing Y N N N N 0 0
   Vayn bad rested fighting Y N N N Y 0 1
   Jonny good rested fighting Y N N N Y 0 1
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE> get al
   Belefonte spasms as Vayn places his hand on Belefonte's chest.
   Belefonte shivers and begins to grow extremely pale.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE> get all
   You get an emerald
   short sword.
   You can't seem to get a wall.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Fair] Mem:3
   Exits:NE>
   Rubie pierces Vayn extremely hard.
   Rubie misses Vayn with her pierce.
   Vayn massacres Belefonte with his slash.
   Belefonte has been defeated.
   There is a flash of light and then Belefonte is gone.
   Rubie gracefully steps aside as Vayn attacks!
   Jonny swings his halberd, catching Spidur's feet, tripping him up.
   Jonny massacres Spidur with his slash.
   Jonny annihilates Spidur with his slash.
   Spidur misses Jonny with his hit.
   Spidur bruises Jonny with his pierce.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:V.Bad] Mem:3
   Exits:NE> heal vayn
   You utter the words,
   'heal'
   You heal Vayn.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:V.Bad] Mem:3
   Exits:NE>
   Jonny attempts to strike at Spidur with his halberd.
   Jonny massacres Spidur with his slash.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:V.Bad] Mem:3
   Exits:NE>
   Vayn attacks Rubie with lightning fast series of attacks that leaves
   her defenseless.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:V.Bad] Mem:3
   Exits:NE> c 'hr
   Vayn massacres Rubie with his slash.
   Vayn massacres Rubie with his stab.
   Rubie pierces Vayn extremely hard.
   Rubie misses Vayn with her pierce.
   Jonny massacres Spidur with his slash.
   Jonny massacres Spidur with his slash.
   Spidur misses Jonny with his hit.
   Spidur misses Jonny with his pierce.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:V.Bad] Mem:3
   Exits:NE> c 'harm'
   You utter the words,
   'harm'
   You grab Spidur, who screams in pain.
   386H 142V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Spidur:Awful] Mem:4
   Exits:NE>
   Jonny attempts to strike at Spidur with his halberd.
   Jonny annihilates Spidur with his slash.
   Spidur has been defeated.
   There is a flash of light and then Spidur is gone.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> !
   Vayn quickly dusts his clothes off.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE>
   Vayn strikes Rubie's weapon, nearly disarming it.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE>
   Rubie comes out of hiding.
   Rubie gives her sword a quick thrust and twist, as she strikes Vayn in
   the back with it.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> c '
   Rubie's sword flashes a brilliant green colour as she jams it between
   the ribs.
   Rubie pierces Vayn extremely hard.
   Rubie pierces Vayn extremely hard.
   Vayn slowly fades into existence.
   Vayn massacres Rubie with his slash.
   Vayn massacres Rubie with his stab.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> grWho should the spell be cast
   upon?
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> grou
   Your group of 4 members consists of:
   Member Hits Move Position Fly Inv Water iMT Here Light Mem
   -----------------------------------------------------------------------
   ----------
   Belvedere good rested standing Y N N N Y 0 4
   Moonglum awful rested standing Y N N N N 0 0
   Vayn fair rested fighting Y N N N Y 0 1
   Jonny good rested standing Y N N N Y 0 1
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> heal va
   Rubie wavers under Jonny's mighty slash!
   Jonny massacres Rubie with his slash.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> heal vayn
   You utter the words, 'heal'
   You heal Vayn.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE>
   Vayn strikes Rubie's weapon, nearly disarming it.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE>
   Jonny massacres Rubie with his slash.
   Jonny massacres Rubie with his slash.
   Rubie drives her sword to an opening in Vayn's armor.
   Rubie pierces Vayn extremely hard.
   Rubie pierces Vayn hard.
   Rubie gracefully steps aside as Vayn attacks!
   Vayn stumbles and accidentally attacks Jonny!
   Vayn annihilates Jonny with his slash.
   Vayn's sword turns the deepest black!
   Jonny's life is drained by a sword!
   Rubie gracefully steps aside as Vayn attacks!
   Vayn stumbles and accidentally attacks Jonny!
   Vayn annihilates Jonny with his slash.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> c 'harm'rubie
   Moonglum tells your group 'wow go kill'
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> Who should the spell be cast
   upon?
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> !
   Who should the spell be cast upon?
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> !
   Who should the spell be cast upon?
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> l
   The Arena of Champions
   A wall of force completely blocks off the north exit...it glows blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> c
   Vayn tells your group 'tick in 10'
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> c 'harm'miss
   Who should the spell be cast upon?
   386H 142V 1X 22.02% 96C Mem:4 Exits:NE> e
   #TICK-10
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 140V 1X 22.02% 96C Mem:4 Exits:NEW> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   386H 140V 1X 22.02% 96C Mem:4 Exits:NEW> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 138V 1X 22.02% 96C Mem:4 Exits:NW> n
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 136V 1X 22.02% 96C Mem:4 Exits:NSW> n
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 134V 1X 22.02% 96C Mem:4 Exits:SW> w
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 132V 1X 22.02% 96C Mem:4 Exits:ESW> s
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 130V 1X 22.02% 96C Mem:4 Exits:NESW> w
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   A wall of force completely blocks off the exit to the south..it glows
   blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   386H 128V 1X 22.02% 96C Mem:4 Exits:NES> n
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   <CORE> Rubie Red, Making You Dead is standing here. (flying)
   386H 126V 1X 22.02% 96C Mem:4 Exits:ES> e
   Jonny massacres Rubie with his slash.
   386H 126V 1X 22.02% 96C Mem:4 Exits:ES>
   Vayn slowly fades into existence.
   Vayn massacres Rubie with his slash.
   386H 126V 1X 22.02% 96C Mem:4 Exits:ES> wThe Arena of Champions
   386H 124V 1X 22.02% 96C Mem:4 Exits:ESW> w
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here, fighting Rubie. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here, fighting
   Rubie. (flying)
   <CORE> Rubie Red, Making You Dead is standing here, fighting Jonny.
   (flying)
   386H 122V 1X 22.02% 96C Mem:4 Exits:ES>
   Rubie arrives from the east.
   386H 122V 1X 22.02% 96C Mem:4 Exits:ES> c '
   Rubie comes out of hiding.
   Rubie gives her sword a quick thrust and twist, as she strikes Vayn in
   the back with it.
   386H 122V 1X 22.02% 96C Mem:4 Exits:ES> c 'harm'r
   Jonny massacres Rubie with his slash.
   386H 122V 1X 22.02% 96C Mem:4 Exits:ES> c 'harm'rubie
   You utter the words, 'harm'
   You grab Rubie, who screams in pain.
   386H 122V 1X 22.02% 96C Mem:5 Exits:ES>
   Jonny massacres Rubie with his slash.
   Jonny massacres Rubie with his slash.
   Rubie pierces Vayn very hard.
   Rubie pierces Vayn extremely hard.
   Vayn massacres Rubie with his slash.
   Rubie gracefully steps aside as Vayn attacks!
   Vayn stumbles and accidentally attacks Jonny!
   Vayn massacres Jonny with his slash.
   386H 122V 1X 22.02% 96C Mem:5 Exits:ES> !
   Jonny focuses his purity on Rubie's arm!
   Jonny forces Rubie to drop her weapon.
   386H 122V 1X 22.02% 96C Mem:5 Exits:ES> #OK NEW TICKSIZE SET
   #OK NEW TICKSIZE SET
   Vayn closes his prayerbook with a content look on his face.
   Jonny closes his prayerbook with a content look on his face.
   Who should the spell be cast upon?
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> get all;
   You get an emerald short sword.
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES>
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> l
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> sya haha
   Huh?!
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> say haha
   You say 'haha'
   404H 158V 1X 22.02% 96C Mem:4 Exits:ES> s
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   A wall of force completely blocks off the exit to the south..it glows
   blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 156V 1X 22.02% 96C Mem:4 Exits:NES> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 154V 1X 22.02% 96C Mem:4 Exits:NESW> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 152V 1X 22.02% 96C Mem:4 Exits:NSW> n
   Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   Jonny arrives from the south.
   Mavlad the bronze dragon arrives from the south.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 150V 1X 22.02% 96C Mem:4 Exits:SW> w
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 148V 1X 22.02% 96C Mem:4 Exits:ESW> w
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 146V 1X 22.02% 96C Mem:4 Exits:ES> s
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   A wall of force completely blocks off the exit to the south..it glows
   blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 144V 1X 22.02% 96C Mem:4 Exits:NES> s
   You feel along a wall, but you see no way past it.
   404H 144V 1X 22.02% 96C Mem:4 Exits:NES>
   Moonglum tells your group '3 on 1'
   404H 144V 1X 22.02% 96C Mem:4 Exits:NES> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 142V 1X 22.02% 96C Mem:4 Exits:NESW> s
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   Jonny arrives from the north.
   Mavlad the bronze dragon arrives from the north.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 140V 1X 22.02% 96C Mem:4 Exits:NEW> w
   Vayn arrives from the east.
   Vez the fearsome blue dragon arrives from the east.
   Jonny arrives from the east.
   Mavlad the bronze dragon arrives from the east.
   The Arena of Champions
   A wall of force completely blocks off the north exit...it glows blue
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 138V 1X 22.02% 96C Mem:4 Exits:NE> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 136V 1X 22.02% 96C Mem:4 Exits:NEW> e
   Vayn arrives from the west.
   Vez the fearsome blue dragon arrives from the west.
   Jonny arrives from the west.
   Mavlad the bronze dragon arrives from the west.
   The Arena of Champions
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here. (flying)
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   You sense a life form.
   404H 134V 1X 22.02% 96C Mem:4 Exits:NW> n
   Jonny massacres Rubie with his slash.
   404H 134V 1X 22.02% 96C Mem:4 Exits:NW> Vayn arrives from the south.
   Vez the fearsome blue dragon arrives from the south.
   The Arena of Champions
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   404H 132V 1X 22.02% 96C Mem:4 Exits:NSW> #TICK+10
   s
   Vayn arrives from the north.
   Vez the fearsome blue dragon arrives from the north.
   The Arena of Champions
   A fearsome blue dragon, Vez, is standing here, ignoring you.
   <VA> Vayn, Thinks the Song is About Him is standing here. (flying)
   (invisible)
   Mavlad the bronze dragon is standing here, awaiting a rider.
   <VA> Jonny the Male Human is standing here, fighting Rubie. (flying)
   You sense a life form.
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> c 'harm'rubie
   You utter the words, 'harm'
   You grab Rubie, who collapses in pain, then dies.
   Rubie has been defeated.
   There is a flash of light and then Rubie is gone.
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> clap
   Jonny tells your group 'nice!!!!'
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> You clap your hands together.
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> say why would they ever go for
   emerald shorts?
   You say 'why would they ever go for emerald shorts?'
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> say dont they know mithas
   javelins are way
   Jonny tells your group 'can strike with huma's!!!!'
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW> say dont they know mithas
   javelins are way more damage
   You say 'dont they know mithas javelins are way more damage'
   404H 130V 1X 22.02% 96C Mem:4 Exits:NW>
   Tezin tells your clan 'ROCK ON!'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2753.html?option=forums&action=displaythread&threadid=2753
