<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Elle, Skold R.I.P.

   POV: Burzt the Fatman

   Log Rating: 0.7500

   Started as a 2v1, turned into a 3v2, then a 3v3

   457H 149V 5350760X 0.00% 91C Exits:NESW> Sword Street
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here.
   (invisible)
   . . . is outlined with a dim aura.
   <BG> Shei Rok'a is standing here. (flying) (invisible)
   . . . is surrounded by 3 shimmering spheres.
   <BSP> Skold 'Ed Warmonger, Dragonrider of Takhisis is standing here.
   (flying)
   . . . has a granite appearance.
   <MAEL> Elle, the Smiling Assassin is standing here.
   . . . has a granite appearance.
   A mustang is tethered here.
   457H 148V 5350760X 0.00% 91C Exits:ESW>
   Skold slashes YOU extremely hard.
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW> You
   do the best you can!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW>
   Raijek focuses harshly on Elle and utters some strange words.
   Raijek slowly fades into existence.
   Elle cries out in pain as Raijek grabs her.
   Raijek stops watching you.
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW>
   Shei focuses harshly on Elle and utters some strange words.
   Shei throws webbing all over Elle!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW> fad
   e
   Elle tries to move, but she cannot break the webs around herself!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW> fad
   e
   You can't seem to escape
   the battle.
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW> ro
   Elle smirks.
   438H 148V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Good] Exits:ESW> roar
   Raijek's warhammer gets stuck to Elle!
   Skold slashes YOU extremely hard.
   Skold stabs YOU extremely hard.
   You bruise Skold with your slash.
   You miss Skold with your pierce.
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> roar
   ang
   th
   Skold attacks with lightning fast series of attacks that leaves you
   defenseless.
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> thr
   Elle tries to move, but she cannot break the webs around herself!
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Raijek focuses harshly on Elle and utters some strange words.
   Elle cries out in pain as Raijek grabs her.
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Shei focuses harshly on Elle and utters some strange words.
   Elle is caught in some of Shei's acid!
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> fad e
   w
   ki elle
   Elle tries to move, but she cannot break the webs around herself!
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Mim flies in from the east.
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Mim flies west.
   401H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Skold massacres YOU with his slash.
   Skold misses you with his stab.
   You miss Skold with your slash.
   You bruise Skold with your pierce.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Skold gazes at you with a look of evilness.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Raijek focuses harshly on Elle and utters some strange words.
   Elle cries out in pain as Raijek grabs her.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> You
   rear your head back and
   let out a mighty roar.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> You
   can not use anger just
   yet.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> You
   can not use thrash just
   yet.
   374H 148V 5350760X 0.00% 91C [Me:Good] [Skold:V.Good] Exits:ESW> Mim
   flies in from the west.
   Intersection: Sword Street and Southern Avenue
   374H 147V 5350760X 0.00% 91C Exits:NESW> Sword Street
   <DAK> Mim the Female Gnome is standing here. (flying)
   . . . is enveloped in flames.
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here, fighting
   Elle.
   . . . is outlined with a dim aura.
   <BG> Shei Rok'a is standing here. (flying) (invisible)
   . . . is outlined with a dim aura.
   <BSP> Skold 'Ed Warmonger, Dragonrider of Takhisis is standing here.
   (flying)
   . . . has a granite appearance.
   <MAEL> Elle, the Smiling Assassin is standing here, fighting Raijek.
   . . . has a granite appearance.
   A mustang is tethered here.
   374H 146V 5350760X 0.00% 91C Exits:ESW>
   Elle tries to move, but she cannot break the webs around herself!
   374H 146V 5350760X 0.00% 91C Exits:ESW> You bruise Elle with your
   slash.
   You feel a sharp chill as you swing through Elle's freezing aura.
   Elle crashes to the ground as you thrash them good.
   361H 146V 5350760X 0.00% 91C [Me:Good] [Raijek:Perfect] [Elle:Awful]
   Exits:ESW>
   Mim begins resting but stays aloft.
   361H 146V 5350760X 0.00% 91C [Me:Good] [Raijek:Perfect] [Elle:Awful]
   Exits:ESW> ga ll
   Raijek focuses harshly on Elle and utters some strange words.
   Elle collapses and dies as Raijek grabs her.
   You receive 0 experience.
   Elle is dead! R.I.P.
   361H 146V 5350760X 0.00% 91C [Me:Good] [Elle:Dying] Exits:ESW> ga ll
   ell
   The death cry of Elle echoes from somewhere nearby...
   Skold stops following Elle.
   Elle now follows Skold.
   Skold is the new leader of Elle's group.
   Elle stops following Skold.
   361H 146V 5350760X 0.00% 91C Exits:ESW> ga ll ell
   g all elle
   !
   Elle arrives from the south.
   361H 146V 5350760X 0.00% 91C Exits:ESW> ki sko
   Elle gets a lightning rod from the corpse of Elle.
   Elle gets a set of long obsidian fingernails from the corpse of Elle.
   Elle gets a jeweled bracer of the Skull from the corpse of Elle.
   Elle gets a red draconian bracelet from the corpse of Elle.
   Elle gets a pair of crystal crimson armbands from the corpse of Elle.
   Elle gets some heavy sand colored pants from the corpse of Elle.
   Elle gets a black runed ring from the corpse of Elle.
   Elle gets the seal of Newport from the corpse of Elle.
   Elle gets a large pile of coins from the corpse of Elle.
   Elle gets a warhammer from the corpse of Elle.
   Elle gets a milky potion of see invisible from the corpse of Elle.
   Elle gets a pit fiend skull from the corpse of Elle.
   Elle gets leather leggings covered with bark chips from the corpse of
   Elle.
   361H 146V 5350760X 0.00% 91C Exits:ESW> ki skold
   Huh?!
   361H 146V 5350760X 0.00% 91C Exits:ESW>
   Elle leaves south.
   361H 146V 5350760X 0.00% 91C Exits:ESW> The corpse doesn't seem to have
   what you are
   looking for.
   361H 146V 5350760X 0.00% 91C Exits:ESW> Skold slashes YOU extremely
   hard.
   The corpse doesn't seem to have what you are looking for.
   341H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW> You do
   the best you can!
   341H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW> gt
   hold
   You move aside quickly as Skold attacks!
   Skold stabs YOU very hard.
   You bruise Skold with your slash.
   You bruise Skold with your pierce.
   Skold crashes to the ground as you thrash them good.
   328H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW> gt
   hold skold
   A streetsweeper arrives from
   the west.
   You tell your group 'hold skold'
   328H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW> !
   You tell your group 'hold
   skold'
   328H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW>
   Raijek slowly fades into existence.
   Raijek misses Skold with her hit.
   328H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:V.Good] Exits:ESW>
   Shei focuses harshly on Skold and utters some strange words.
   The sound of bones cracking echoes as Shei's force bolt slams into
   Skold.
   328H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:Good] Exits:ESW>
   Raijek misses Skold with her hit.
   Skold massacres YOU with his slash.
   Skold stabs YOU extremely hard.
   You slash Skold very hard.
   You massacre Skold with your pierce.
   292H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW>
   Mim gets a quartz crystal sphere.
   292H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW>
   Shei focuses harshly on Skold and utters some strange words.
   The sound of bones cracking echoes as Shei's force bolt slams into
   Skold.
   292H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW> snic
   You snicker softly.
   292H 146V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW>
   Skold misses you with his slash.
   Skold stabs YOU hard.
   You slash Skold hard.
   You pierce Skold extremely hard.
   301H 152V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW>
   Skold stands up.
   301H 152V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:ESW>
   Skold panics, and attempts to flee.
   Skold flies west.
   301H 152V 5350760X 0.00% 91C Exits:ESW>
   Skold flies in from the west.
   301H 152V 5350760X 0.00% 91C Exits:ESW> w
   Sword Street
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here.
   . . . is outlined with a dim aura.
   <BG> Shei Rok'a is standing here. (flying) (invisible)
   . . . is surrounded by 3 shimmering spheres.
   A medium sized horse is here, awaiting a rider.
   301H 151V 5350760X 0.00% 91C Exits:ESW> ki skol
   They aren't here.
   301H 151V 5350760X 0.00% 91C Exits:ESW> e
   Sword Street
   The corpse of Elle is lying here.
   )()()()()Later()()()()()()(
   250H 107V 5350760X 0.00% 91C Exits:N> kiYou study the area for any sign
   of your prey.
   Your prey is right here!
   Knights' Post
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here.
   (invisible)
   . . . is outlined with a dim aura.
   <MAEL> Elle, the Smiling Assassin is standing here.
   <BSP> Skold 'Ed Warmonger, Dragonrider of Takhisis is standing here.
   (flying)
   <BG> Shei Rok'a is standing here. (flying)
   . . . is outlined with a dim aura.
   250H 106V 5350760X 0.00% 91C Exits:NESW>
   Skold flies west.
   250H 106V 5350760X 0.00% 91C Exits:NESW> ki chiv
   Elle leaves east.
   250H 106V 5350760X 0.00% 91C Exits:NESW> ki chivas
   They aren't here.
   250H 106V 5350760X 0.00% 91C Exits:NESW> !
   They aren't here.
   250H 106V 5350760X 0.00% 91C Exits:NESW> !
   They aren't here.
   250H 106V 5350760X 0.00% 91C Exits:NESW> !
   They aren't here.
   250H 106V 5350760X 0.00% 91C Exits:NESW> e
   Shei flies west.
   250H 106V 5350760X 0.00% 91C Exits:NESW> w
   You study the area for any sign of your prey.
   Your prey passed this way quite recently.
   Sword Street
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here.
   (invisible)
   . . . is outlined with a dim aura.
   <BG> Shei Rok'a is standing here. (flying)
   . . . is outlined by a pinkish flame.
   <BSP> Skold 'Ed Warmonger, Dragonrider of Takhisis is standing here.
   (flying)
   <MAEL> Chivas the Illmatic is standing here. (flying)
   A Palanthian guard is here serving and protecting the citizens of
   Palanthas.
   250H 105V 5350760X 0.00% 91C Exits:NES>
   Chivas crashes into Raijek in a thundering collision, knocking her to
   the
   ground!
   Raijek stops watching you.
   250H 105V 5350760X 0.00% 91C Exits:NES> ki sko
   Chivas massacres Raijek with his slash.
   Raijek slowly fades into existence.
   Raijek misses Chivas with her hit.
   250H 105V 5350760X 0.00% 91C Exits:NES> ki skold
   You slash Skold very hard.
   250H 105V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:NES>
   Shei focuses harshly on Skold and utters some strange words.
   Shei shoots webs at Skold but narrowly misses him!
   250H 105V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:NES>
   Elle arrives from the east.
   250H 105V 5350760X 0.00% 91C [Me:Fair] [Skold:Fair] Exits:NES>
   You slash Skold hard.
   You pierce Skold extremely hard.
   Skold slashes YOU extremely hard.
   Skold stabs YOU extremely hard.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   218H 105V 5350760X 0.00% 91C [Me:Bad] [Skold:Fair] Exits:NES>
   Skold attacks with lightning fast series of attacks that leaves you
   defenseless.
   218H 105V 5350760X 0.00% 91C [Me:Bad] [Skold:Fair] Exits:NES> roar
   Shei focuses harshly on Elle and utters some strange words.
   Elle is caught in some of Shei's acid!
   218H 105V 5350760X 0.00% 91C [Me:Bad] [Skold:Fair] Exits:NES>
   Shei barely hits Elle.
   Elle misses Shei with her claw.
   Elle rakes her fingernails over Shei's face!
   You slash Skold hard.
   You miss Skold with your pierce.
   Skold massacres YOU with his slash.
   Skold massacres YOU with his stab.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   Shei steps aside as Chivas attempts a bash, stumbles, and falls flat on
   his
   face.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES>
   Elle panics, and attempts to flee.
   Elle leaves east.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES> You
   rear your head back and let
   out a mighty roar.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES> gt h
   Raijek stands up.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES>
   Raijek panics, and attempts to flee.
   Raijek leaves north.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES> gt heal
   You tell your group 'heal'
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES> l n
   You see nothing special.
   <BG> Raijek Djisir, High Priestess of Zeboim is standing here.
   . . . is outlined with a dim aura.
   163H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Fair] Exits:NES>
   You slash Skold very hard.
   You pierce Skold very hard.
   Skold massacres YOU with his slash.
   Skold massacres YOU with his stab.
   104H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:Bad] Exits:NES> gt heal
   Shei focuses harshly on Skold and utters some strange words.
   The sound of bones cracking echoes as Shei's force bolt slams into
   Skold.
   104H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:V.Bad] Exits:NES> gt
   heal me
   Raijek arrives from the north.
   104H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:V.Bad] Exits:NES> gt
   heal me
   You tell your group 'heal me'
   104H 105V 5350760X 0.00% 91C [Me:V.Bad] [Skold:V.Bad] Exits:NES>
   Raijek focuses on you and utters some strange words.
   Your entire body tingles for a few seconds.
   456H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Bad] Exits:NES> rav
   Huh?!
   456H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Bad] Exits:NES> g all
   skold
   You return to your normal fighting style.
   You slash Skold very hard.
   You miss Skold with your pierce.
   Skold slashes YOU extremely hard.
   Skold stabs YOU very hard.
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Bad] Exits:NES> g all
   skold
   !
   !What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Bad] Exits:NES> !
   Chivas stands up.
   What are you trying to get from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:V.Bad] Exits:NES>
   Chivas crashes into Raijek in
   a thundering collision, knocking her to the ground!
   Shei focuses harshly on Skold and utters some strange words.
   The sound of bones cracking echoes as Shei's force bolt slams into
   Skold.
   What are you trying to get from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   Elle arrives from the east.
   What are you trying to get from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   Elle leaves south.
   What are you trying to get from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   !What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   !
   !
   !What are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> What
   are you trying to get
   from?
   422H 105V 5350760X 0.00% 91C [Me:V.Good] [Skold:Awful] Exits:NES> !
   Chivas massacres Raijek with
   his slash.
   Raijek slowly fades into existence.
   Raijek misses Chivas with her hit.
   You slash Skold very hard.
   You pierce Skold very hard.
   Skold massacres YOU with his slash.
   Skold stabs YOU extremely hard.
   What are you trying to get from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Awful] Exits:NES> !
   !What are you trying to get
   from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Awful] Exits:NES> !
   What are you trying to get
   from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Awful] Exits:NES> gt Shei
   focuses harshly on Skold
   and utters some strange words.
   Brains splatter on you as Shei's force bolt shatters Skold's skull.
   You receive 0 experience.
   Skold is dead! R.I.P.
   What are you trying to get from?
   382H 105V 5350760X 0.00% 91C [Me:Good] [Skold:Dying] Exits:NES> gt frag
   The death cry of Skold echoes from somewhere nearby...
   Skold sinks gently to the ground.
   382H 105V 5350760X 0.00% 91C Exits:NES> gt frag sko
   You tell your group 'frag sko'
   382H 105V 5350760X 0.00% 91C Exits:NES> g all corpse
   You get an iridescent black rapier from the
   corpse of Skold.
   You get a huge iron broad sword from the corpse of Skold.
   You get a bracelet of dragon teeth from the corpse of Skold.
   You get a bracelet of dragon teeth from the corpse of Skold.
   You get a girdle with a human skull buckle from the corpse of Skold.
   You get a white dragonwing cloak from the corpse of Skold.
   You get a black quiver from the corpse of Skold.
   You get a set of power brassards from the corpse of Skold.
   You get a pair of ice cold gauntlets from the corpse of Skold.
   You get a pair of wicked black boots from the corpse of Skold.
   You get a set of power cuisses from the corpse of Skold.
   You get a blue dragonmask from the corpse of Skold.
   You get a suit of gold dragonscale battle armor from the corpse of
   Skold.
   You get a hypnotic medallion from the corpse of Skold.
   You get a ruby encrusted obsidian pentagram from the corpse of Skold.
   You get a serpentine ring from the corpse of Skold.
   You get an ashen stone ring from the corpse of Skold.
   You get a large pile of coins from the corpse of Skold.
   There were 916 coins.
   You get Mishakal's White potion from the corpse of Skold.
   You get a milky potion of see invisible from the corpse of Skold.
   You get a scroll of legend lore from the corpse of Skold.
   You get a loaf of rye bread from the corpse of Skold.
   You get a loaf of rye bread from the corpse of Skold.
   You get a scroll of legend lore from the corpse of Skold.
   You get a scroll of legend lore from the corpse of Skold.
   You get a small wooden chest from the corpse of Skold.
   You get a blue potion from the corpse of Skold.
   You get a small joint from the corpse of Skold.
   You get a glowing scroll of recall from the corpse of Skold.
   You get a golden goblet from the corpse of Skold.
   You get a glowing scroll of recall from the corpse of Skold.
   You get a milky potion of see invisible from the corpse of Skold.
   You get a milky potion of see invisible from the corpse of Skold.
   You get a wooden shield from the corpse of Skold.
   You get a silver tuille from the corpse of Skold.
   You get a ring of the Dark Merchant from the corpse of Skold.
   Rapier : You can't carry that many items.
   Joint : You can't carry that many items.
   Joint : You can't carry that many items.
   Spear : You can't carry that many items.
   Pearl : You can't carry that many items.
   Camel : You can't carry that many items.
   382H 105V 5350760X 0.00% 1007C Exits:NES> l
   Elle arrives from the south.
   Sword Street
   The corpse of Skold is lying here.
   <MAEL> Elle, the Smiling Assassin is standing here.
   <BG> Raijek Djisir, High Priestess of Zeboim is sitting here, fighting
   Chivas.
   . . . is outlined with a dim aura.
   <BG> Shei Rok'a is standing here. (flying)
   . . . is outlined with a dim aura.
   <MAEL> Chivas the Illmatic is standing here, fighting Raijek. (flying)
   A Palanthian guard is here serving and protecting the citizens of
   Palanthas.
   382H 105V 5350760X 0.00% 1007C Exits:NES> as
   Elle gets a long swordmaster's rapier from the corpse of Skold.
   Elle gets a small joint from the corpse of Skold.
   Elle gets a small joint from the corpse of Skold.
   Elle gets a sharp throwing spear from the corpse of Skold.
   Elle gets a black pearl from the corpse of Skold.
   Elle gets a camel pack from the corpse of Skold.
   382H 105V 5350760X 0.00% 1007C Exits:NES> ass
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   You attempt to assist Raijek.
   You slash Chivas hard.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:V.Good]
   Exits:NES>
   Elle leaves north.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:V.Good]
   Exits:NES>
   You step aside as Chivas tries to bash you, causing him to tumble and
   fall face
   down.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:V.Good]
   Exits:NES>
   A Palanthian guard leaves south.
   Shei focuses harshly on Chivas and utters some strange words.
   The sound of bones cracking echoes as Shei's force bolt slams into
   Chivas.
   Raijek stands up.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES>
   A citizen arrives from the south.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt
   Elle arrives from the north.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt h
   Elle leaves east.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt hea
   Elle arrives from the east.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt heal
   Elle leaves south.
   382H 105V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt heal sel
   You slash Chivas very hard.
   You massacre Chivas with your pierce.
   Chivas massacres Raijek with his slash.
   You throw away your bloody bandages.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Bad] [Chivas:Good]
   Exits:NES> gt heal self
   Raijek utters some strange words.
   Raijek heals Raijek.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> You tell your
   group 'heal self'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> i
   You are
   carrying:
   a ring of the Dark Merchant..it glows dimly
   a silver tuille
   a wooden shield
   a milky potion of see invisible [2]
   a glowing scroll of recall..it glows dimly
   a golden goblet
   a glowing scroll of recall..it glows dimly
   a small joint
   a blue potion
   a small wooden chest
   a scroll of legend lore [2]
   a loaf of rye bread [2]
   a scroll of legend lore
   a milky potion of see invisible
   Mishakal's White potion
   an ashen stone ring..it hums softly
   a serpentine ring
   a ruby encrusted obsidian pentagram
   a hypnotic medallion
   a suit of gold dragonscale battle armor
   a blue dragonmask
   a set of power cuisses
   a pair of wicked black boots
   a pair of ice cold gauntlets..it glows dimly
   a set of power brassards
   a black quiver
   a white dragonwing cloak
   a girdle with a human skull buckle
   a bracelet of dragon teeth (invisible)..it glows dimly [2]
   a huge iron broad sword
   an iridescent black rapier
   a putrid potion
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> gt HAHHA
   You tell your
   group 'HAHHA'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> w
   You slash Chivas very hard.
   You pierce Chivas extremely hard.
   Chivas massacres Raijek with his slash.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> werar
   Huh?!
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> wea all
   Chivas stands up.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES> wea all
   Darkness
   enshrouds you as you slide the ring onto your finger.
   You cannot use the ring.
   Darkness enshrouds you as you slide the ring onto your finger.
   You cannot use the ring.
   You wear a silver tuille on your legs.
   You can't use a shield while holding a weapon.
   You couldn't find anywhere to use a milky potion of see invisible.
   You couldn't find anywhere to use a milky potion of see invisible.
   You couldn't find anywhere to use a glowing scroll of recall.
   You couldn't find anywhere to use a golden goblet.
   You couldn't find anywhere to use a glowing scroll of recall.
   You couldn't find anywhere to use a small joint.
   You couldn't find anywhere to use a blue potion.
   You couldn't find anywhere to use a small wooden chest.
   You couldn't find anywhere to use a scroll of legend lore.
   You couldn't find anywhere to use a scroll of legend lore.
   You couldn't find anywhere to use a loaf of rye bread.
   You couldn't find anywhere to use a loaf of rye bread.
   You couldn't find anywhere to use a scroll of legend lore.
   You couldn't find anywhere to use a milky potion of see invisible.
   You couldn't find anywhere to use Mishakal's White potion.
   You wear the ring on a finger of your right hand.
   You wear the ring on a finger of your left hand.
   You wear a ruby encrusted obsidian pentagram around your neck.
   You cannot use the pentagram.
   You wear a ruby encrusted obsidian pentagram around your neck.
   You cannot use the pentagram.
   You notice all eyes upon your medallion when you put it on your neck.
   You wear a suit of gold dragonscale battle armor on your body.
   You wear a blue dragonmask on your head.
   You already wear something on your legs.
   You wear a pair of wicked black boots on your feet.
   You wear a pair of ice cold gauntlets on your hands.
   You wear a set of power brassards on your arms.
   You sling a black quiver over your shoulder.
   You wear a white dragonwing cloak about your body.
   You wear a girdle with a human skull buckle about your waist.
   You wear the bracelet around your right wrist.
   The bracelet feels too uncomfortable to wear.
   You wear the bracelet around your left wrist.
   The bracelet feels too uncomfortable to wear.
   You wear the bracelet around your right wrist.
   The bracelet feels too uncomfortable to wear.
   You wear the bracelet around your left wrist.
   The bracelet feels too uncomfortable to wear.
   You couldn't find anywhere to use a huge iron broad sword.
   You couldn't find anywhere to use an iridescent black rapier.
   You couldn't find anywhere to use a putrid potion.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   You step aside as Chivas tries to bash you, causing him to tumble and
   fall face
   down.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   Elle arrives from the south.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   Elle leaves north.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   Raijek says 'STOp'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   Raijek says 'STOp'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:V.Good] [Chivas:Good]
   Exits:NES>
   You massacre Chivas with your slash.
   You miss Chivas with your pierce.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   Raijek says 'STOp'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Good]
   Exits:NES>
   Raijek says 'STOp'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Good]
   Exits:NES> 'flee
   Raijek says 'mike'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Good]
   Exits:NES> '
   You miss Chivas with your slash.
   You massacre Chivas with your pierce.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mikYou say 'flee'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mike
   You say 'mike'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES>
   Shei focuses harshly on Chivas and utters some strange words.
   Chivas is caught in some of Shei's acid!
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> '
   Raijek says 'get out'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mike
   Elle arrives from the north.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mike FL
   Elle leaves south.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mike FLE
   Raijek says 'get out'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES> 'mike FLEE
   You say 'mike
   FLEE'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES>
   Chivas stands up.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Good] [Chivas:Fair]
   Exits:NES>
   Chivas crashes into Raijek in a thundering collision, knocking her to
   the
   ground!
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> !
   You say 'mike
   FLEE'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> !
   You say 'mike
   FLEE'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> !
   You slash Chivas extremely hard.
   You pierce Chivas extremely hard.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> You say 'mike
   FLEE'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> !
   You say 'mike
   FLEE'
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> re
   Monstro arrives from the south.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES> resc
   Your feeble rescue
   efforts end in failure.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES>
   Monstro leaves east.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES>
   Shei focuses harshly on Chivas and utters some strange words.
   Chivas is caught in some of Shei's acid!
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Fair]
   Exits:NES>
   You slash Chivas extremely hard.
   You pierce Chivas very hard.
   Chivas massacres Raijek with his slash.
   Raijek misses Chivas with her hit.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Bad]
   Exits:NES> i
   You are carrying:
   a bracelet of dragon teeth (invisible)..it glows dimly [2]
   a ruby encrusted obsidian pentagram
   a ring of the Dark Merchant..it glows dimly
   a wooden shield
   a milky potion of see invisible [2]
   a glowing scroll of recall..it glows dimly
   a golden goblet
   a glowing scroll of recall..it glows dimly
   a small joint
   a blue potion
   a small wooden chest
   a scroll of legend lore [2]
   a loaf of rye bread [2]
   a scroll of legend lore
   a milky potion of see invisible
   Mishakal's White potion
   a set of power cuisses
   a huge iron broad sword
   an iridescent black rapier
   a putrid potion
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:Bad]
   Exits:NES>
   Shei focuses harshly on Chivas and utters some strange words.
   Chivas is caught in some of Shei's acid!
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:V.Bad]
   Exits:NES>
   Elle arrives from the south.
   401H 138V 5350760X 0.00% 1007C [Me:Good] [Raijek:Fair] [Chivas:V.Bad]
   Exits:NES>
   Elle recites a glowing scroll of recall.
   Chivas disappears.
   ---
   Now in fairness, they did hunt down 2 of us afterwards.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
