<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   How many times have you been spooned by another Arctic player?

   (*) 0
   ( ) 1
   ( ) 2-5
   ( ) 5-10
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Searching for Wipeouts Eq

   POV: Over

   Log Rating: -1.0000

   ehlana does not load

   429H 189V 3652288X 0.00% 1680C [**a hill giant:Perfect**] Mem:3
   Exits:NSWU> scan
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   A small child plays with some colorful objects.
   An old beggar hobbles along here looking for handouts.
   Looking west:
   You see nothing special.
   <LoS> Ehlana the Female Qualinesti is standing here.
   A janitor is walking around, cleaning up.
   A medium sized horse is here, awaiting a rider.
   Looking up:
   You see nothing special.
   A secretary is sitting at the desk, messing with her hair.
   Looking down:
   You see nothing special.
   429H 189V 3652288X 0.00% 1680C [**a hill giant:Perfect**] Mem:3
   Exits:NSWU> w
   A hill giant flies in from the east.
   A hill giant kneels down and studies the ground.
   A hill giant points at Ehlana.
   A hill giant says 'There they are!'
   A Small Side Street
   You stand before the largest vallenwood you have ever seen. It towers
   up above the rest of the huge vallenwoods and appears to touch the
   clouds
   above. When you look up into the vallenwood, you see an extravagantly
   decorated tavern that has been built in and among the limbs of the
   tree.
   The clearing stretches on towards the north and you see Northern Avenue
   to
   the east. A spiral stairway winds down from the tavern above, reaching
   the
   ground a short distance away. A small sign is posted next to the
   stairway.
   A long torch functions as a street lamp here.
   A hill giant is roaming around looking for something to kill. (flying)
   <LoS> Ehlana the Female Qualinesti is standing here.
   A janitor is walking around, cleaning up.
   A medium sized horse is here, awaiting a rider.
   429H 188V 3652288X 0.00% 1680C [**a hill giant:Perfect**] Mem:3
   Exits:NEU> o hill bash ehlana
   c 'a b' ehlana
   A hill giant is busy doing something, try again in a moment.
   429H 188V 3652288X 0.00% 1680C [**a hill giant:Perfect**] Mem:3
   Exits:NEU> You utter the words, 'acid blast'
   Some of your acid hits Ehlana!
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Fair] Mem:4
   Exits:NEU>
   Truar flies in from the east.
   The demon Marilith flies in from the east.
   The demon Marilith kneels down and studies the ground.
   The demon Marilith points at Ehlana.
   The demon Marilith says 'There they are!'
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Fair] Mem:4
   Exits:NEU>
   You bludgeon Ehlana very hard.
   Ehlana misses you with her bludgeon.
   Truar focuses harshly on Ehlana and utters the words, 'hold person'.
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Fair] Mem:4
   Exits:NEU> c 'f b' ehlana
   Ameliana shouts 'I don't see what the big deal is with edible
   underwear. After you wear it a few times, they taste like all the other
   pairs anyway.'
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Fair] Mem:4
   Exits:NEU> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Ehlana.
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU>
   Ehlana misses you with her bludgeon.
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU>
   Truar focuses harshly on Ehlana and utters the words, 'hold person'.
   Ehlana freezes in place.
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   take all corpse
   take all corpse
   take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> You slam your cane on Ehlana's face and she stumbles back.
   You bludgeon Ehlana extremely hard.
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> What are you trying to get from?
   Truar gives the demon Marilith an order.
   The demon Marilith crashes into Ehlana in a thundering collision,
   knocking her to the ground!
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   Truar looks at Ehlana.
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU> take all corpse
   What are you trying to get from?
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Awful] Mem:5
   Exits:NEU>
   Truar focuses harshly on Ehlana and utters some strange words.
   Ehlana collapses and dies as Truar grabs her.
   You receive 0 experience.
   Ehlana is dead! R.I.P.
   take pile corpse
   exa corpse
   429H 188V 3652288X 0.00% 1680C [Me:Perfect] [Ehlana:Dying] Mem:5
   Exits:NEU>
   The death cry of Ehlana echoes from somewhere nearby...
   Ehlana stops following the janitor.
   429H 188V 3652288X 0.00% 1680C Mem:5 Exits:NEU> You get a pile of coins
   from the corpse of Ehlana.
   There were 84 coins.
   split 84
   429H 188V 3652288X 0.00% 1764C Mem:5 Exits:NEU> o hill bash ehlana
   c 'a b' ehlana
   It's a pretty ghastly sight! Searching through the remains, you find:
   corpse (here) :
   a rare yellow apatite crystal
   an enchanted hoopak
   a jeweled bracer
   a thick leather belt
   a seeker's robe
   a pair of sleek leather boots
   a wolf's head helm
   some bamboo armor
   a hooded lantern
   a crafted aspen staff..it hums softly
   a waterskin
   a small leather bag
   a pinch of powdered malachite
   a map of Solace
   429H 188V 3652288X 0.00% 1764C Mem:5 Exits:NEU> You divide 84 coins
   equally among the group members present.
   429H 188V 3652288X 0.00% 1722C Mem:5 Exits:NEU>
   429H 188V 3652288X 0.00% 1722C Mem:5 Exits:NEU> Who should the spell be
   cast upon?
   429H 188V 3652288X 0.00% 1722C Mem:5 Exits:NEU> take all corpse
   You get a rare yellow apatite crystal from the corpse of Ehlana.
   You get an enchanted hoopak from the corpse of Ehlana.
   You get a jeweled bracer from the corpse of Ehlana.
   You get a thick leather belt from the corpse of Ehlana.
   You get a seeker's robe from the corpse of Ehlana.
   You get a pair of sleek leather boots from the corpse of Ehlana.
   You get a wolf's head helm from the corpse of Ehlana.
   You get some bamboo armor from the corpse of Ehlana.
   You get a hooded lantern from the corpse of Ehlana.
   You get a crafted aspen staff from the corpse of Ehlana.
   You get a waterskin from the corpse of Ehlana.
   Bag : You can't carry that much weight.
   You get a pinch of powdered malachite from the corpse of Ehlana.
   Map : You can't carry that much weight.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
