<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

How many times have you been spooned by another Arctic player?

(*) 0
( ) 1
( ) 2-5
( ) 5-10
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Kadaj,semaj,trei vs PZC! Fight

POV: Over

Log Rating: 2.8000

PZC vs Randoms

396H 192V 1X 28.21% 2236C Mem:2 Exits:NE>
Wipeout crashes into Semaj in a thundering collision, knocking her to
the ground!
396H 192V 1X 28.21% 2236C Mem:2 Exits:NE> c 'b' wipeout
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C Mem:2 Exits:NE> You utter the words, 'blur'
Wipeout begins to become blurry and hard to see.
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE>
Sherm licks you.
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE>
Kadaj says 'that's lame'
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE>
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE>
Penol tells your group 'k hope he not triggered on me'
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE>
Kylar tells you 'he lives 3hrs away but i was in town for a appointment
for school'
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE> TICK IN 7 SECONDS.
watch semaj
Kadaj says 'form up you losers'
396H 192V 1X 28.21% 2236C Mem:3 Exits:NE> You now watch Semaj.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:3
Exits:NE>
Semaj says 'HEY ASS !'
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:3
Exits:NE>
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:2
Exits:NE>
Kadaj buys a scroll of recall.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:2
Exits:NE>
Kadaj begins resting but stays aloft.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:2
Exits:NE>
Semaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Perfect**] Mem:2
Exits:NE>
Wipeout crashes into Semaj in a thundering collision, knocking her to
the ground!
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Perfect**] Mem:2
Exits:NE>
Wipeout misses Semaj with his cleave.
Semaj bludgeons Wipeout hard.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Kylar tells you 'and semaj used to live in same towna s i'
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Sherm says 'fight fight fight'
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout massacres Semaj with his cleave.
Wipeout gracefully steps aside as Semaj attacks!
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
*Semaj stands up
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Semaj says 'Semaj stands up'
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Semaj says 'Semaj stands up.'
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout massacres Semaj with his cleave.
Semaj bludgeons Wipeout hard.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Sherm giggles.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Kadaj says 'maybe semaj stands up.'
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Semaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout crashes into Semaj in a thundering collision, knocking her to
the ground!
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout massacres Semaj with his cleave.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Sherm laughs heartily.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:V.Good**] Mem:2
Exits:NE>
Kadaj stops using a shadow blade.
Kadaj grabs a scroll of recall.
Kadaj recites a scroll of recall.
Semaj disappears.
Round 2 FIGHT
Wipeout flies east.
You follow Wipeout east.
A lesser displacer beast arrives from the west.
Penol flies in from the west.
The Tollhouse
This small stone building stands at the junction of the roads from
Palanthas to the west, Kalaman to the east, and Solanthus to the south.
A
road leads north to the gates of the City of Vingaard, and east to the
main
keep atop the hill. Inside the tollhouse there are some long benches
for
those waiting to meet with the tax collector, who sits behind the large
table toward the back. Behind this table is a large safe mounted in the
wall, storing the collected taxes waiting to be added to the city's
coffers. A small staircase leads up to a small hatch in the ceiling.
Travelers wishing to pass must pay the toll, then head west to
Palanthas,
north through the city and east to Kalaman, or south toward the Newsea.
A wooden sign on a pole directs travellers to their destinations.
Penol the Female Hill Dwarf is standing here. (flying)
. . . has a tough exterior.
A demon is here, phasing in and out of reality at random points in
space.
. . . is followed by a shimmering sphere.
<PZC> Wipeout the Male Hylar Dwarf is standing here. (flying)
The Demon Marilith is here, writhing its snake-like tail.
(flying) Semaj the Female Gnome is stretched out on a wooden bench.
*(flying) Kadaj Blacktide, Shockwave is stretched out on a wooden
bench.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:2 Exits:NESWU>
Kadaj stands up.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:2 Exits:NESWU>
Wipeout crashes into Kadaj in a thundering collision, knocking him to
the ground!
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:2 Exits:NESWU> o
demon kill kadaj
c 'f b' kadaj
A lesser displacer beast misses Kadaj with his hit.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:2 Exits:NESWU> You
utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Kadaj.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU>
A lesser displacer beast misses Kadaj with his hit.
Wipeout massacres Kadaj with his cleave.
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj massacres Wipeout with his pierce.
Kadaj pierces Wipeout extremely hard.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU> o
demon kill kadaj
c 'f b' kadaj
Penol focuses harshly on Kadaj and utters some strange words.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU> A
lesser displacer beast utters the words, 'fireshield'.
A lesser displacer beast smiles as the air around him is set ablaze.
A lesser displacer beast is busy doing something, try again in a
moment.
396H 190V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU> A
lesser displacer beast misses Kadaj with his hit.
Wipeout cleaves Kadaj extremely hard.
Kadaj pierces Wipeout extremely hard.
Kadaj pierces Wipeout extremely hard.
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Kadaj.
Semaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU>
Semaj focuses on Kadaj and utters some strange words.
Semaj heals Kadaj.
396H 192V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU>
Penol focuses harshly on Kadaj and utters some strange words.
396H 192V 1X 28.21% 2236C [**Semaj:Perfect**] Mem:3 Exits:NESWU> TICK
IN 7 SECONDS.
Wipeout crashes into Semaj in a thundering collision, knocking her to
the ground!
396H 192V 1X 28.21% 2236C [**Semaj:V.Good**] [**Wipeout:Good**] Mem:3
Exits:NESWU>
Kadaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:V.Good**] [**Wipeout:Good**] Mem:3
Exits:NESWU> o demon kill semaj
c 'sil' semaj
Kadaj appears to be dancing around the room.
396H 192V 1X 28.21% 2236C [**Semaj:V.Good**] [**Wipeout:Good**] Mem:3
Exits:NESWU>
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Good**] Mem:3
Exits:NESWU> A lesser displacer beast massacres Semaj with his hit.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Good**] Mem:3
Exits:NESWU> You utter the words, 'silence'
The magic fails!
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Good**] Mem:4
Exits:NESWU>
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj places a shadow spear in Penol's back, resulting in some strange
noises and some blood.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Good**] Mem:4
Exits:NESWU> o demon kill semaj
c 'sil' semaj
Penol focuses harshly on Kadaj and utters some strange words.
Flesh burns as Penol enshrouds Kadaj in a cloak of flames.
396H 192V 1X 28.21% 2236C [**Semaj:Good**] [**Wipeout:Good**] Mem:4
Exits:NESWU>
Kadaj pierces Penol extremely hard.
Kadaj is chilled, as he swings at Penol.
Kadaj pierces Penol extremely hard.
Kadaj is chilled, as he swings at Penol.
A lesser displacer beast massacres Semaj with his hit.
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Good**] Mem:4
Exits:NESWU>
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Good**] Mem:4
Exits:NESWU> You utter the words, 'silence'
The magic fails!
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Good**] Mem:4
Exits:NESWU>
Wipeout crashes into Kadaj in a thundering collision, knocking him to
the ground!
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Good**] Mem:4
Exits:NESWU>
A lesser displacer beast utters the words, 'antimagic shell'.
The air shimmers and crackles around a lesser displacer beast.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Good**] Mem:4
Exits:NESWU> o demon kill semaj
c 'sil' semaj
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj pierces Wipeout extremely hard.
Kadaj massacres Wipeout with his pierce.
A lesser displacer beast massacres Semaj with his hit.
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> A lesser displacer beast is busy doing something, try
again in a moment.
Semaj gives a lesser displacer beast an order.
A lesser displacer beast has an indifferent look.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Penol focuses harshly on Kadaj and utters some strange words.
Flesh burns as Penol enshrouds Kadaj in a cloak of flames.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> You can't remember how to cast that spell!
Semaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Semaj focuses on Kadaj and utters some strange words.
Semaj heals Kadaj.
396H 192V 1X 28.21% 2236C [**Semaj:Fair**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Kadaj massacres Wipeout with his pierce.
Kadaj massacres Wipeout with his pierce.
A lesser displacer beast hits Semaj extremely hard.
Wipeout massacres Semaj with his cleave.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> c 'web' semah
A lesser displacer beast utters the words, 'boost'.
Penol focuses harshly on Kadaj and utters some strange words.
Flesh burns as Penol enshrouds Kadaj in a cloak of flames.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> You can't remember how to cast that spell!
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Wipeout crashes into Semaj in a thundering collision, knocking her to
the ground!
Kadaj stands up.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Kadaj panics, and attempts to flee.
Kadaj flies north.
396H 192V 1X 28.21% 2236C [**Semaj:Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
A lesser displacer beast hits Semaj extremely hard.
Wipeout massacres Semaj with his cleave.
Semaj bludgeons Wipeout very hard.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> c 'web' semaj
You can't remember how to cast that spell!
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Bono flies in from the west.
Bono studies the area intently.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Kadaj flies in from the north.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
A twisted look of pain appears on Penol's face as she suddenly
discovers Kadaj's spear in her back.
Penol is dead! R.I.P.
take pile corpse
exa corpse
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
Bono flies north.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
The death cry of Penol echoes from somewhere nearby...
Penol stops following Wipeout.
396H 192V 1X 28.21% 2236C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> You get a very large pile of coins from the corpse of
Penol.
There were 3964 coins.
split 3964
396H 192V 1X 28.21% 6200C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> It's a pretty ghastly sight! Searching through the
remains, you find:
corpse (here) :
Greenswathe..it glows blue
some rugged black leather breeches..it glows blue
the Queen's diamond wedding ring [2]
a yellow dragon's tooth
a black runed ring..it glows blue
a weatherbeaten rucksack
a hooded lantern
396H 192V 1X 28.21% 6200C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> You divide 3964 coins equally among the group members
present.
396H 192V 1X 28.21% 4218C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> o demon kill semaj
c 'sil' semaj
396H 192V 1X 28.21% 4218C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> You can't remember how to cast that spell!
396H 192V 1X 28.21% 4218C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU>
A lesser displacer beast hits Semaj extremely hard.
Wipeout massacres Semaj with his cleave.
Semaj misses Wipeout with her bludgeon.
396H 192V 1X 28.21% 4218C [**Semaj:V.Bad**] [**Wipeout:Fair**] Mem:4
Exits:NESWU> c 'f b' semaj
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Semaj.
396H 192V 1X 28.21% 4218C [**Semaj:Awful**] [**Wipeout:Fair**] Mem:5
Exits:NESWU>
Kadaj is zapped by Greenswathe and instantly drops it.
Kadaj gets some rugged black leather breeches from the corpse of Penol.
Kadaj gets the Queen's diamond wedding ring from the corpse of Penol.
Kadaj gets the Queen's diamond wedding ring from the corpse of Penol.
Kadaj gets a yellow dragon's tooth from the corpse of Penol.
Kadaj gets a black runed ring from the corpse of Penol.
Kadaj gets a weatherbeaten rucksack from the corpse of Penol.
Kadaj gets a hooded lantern from the corpse of Penol.
396H 192V 1X 28.21% 4218C [**Semaj:Awful**] [**Wipeout:Fair**] Mem:5
Exits:NESWU>
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj thrusts a shadow spear into your back.
That Really did HURT!
235H 192V 1X 28.21% 4218C [Me:Fair] [Kadaj:Good] Mem:5 Exits:NESWU>
You stop watching Semaj.
235H 192V 1X 28.21% 4218C [Me:Fair] [Kadaj:Good] Mem:5 Exits:NESWU>
Kadaj misses you and destroys an image.
Kadaj massacres YOU with his pierce.
You miss Kadaj with your bludgeon.
A lesser displacer beast hits Semaj extremely hard.
Wipeout massacres Semaj with his cleave.
Semaj is incapacitated and will slowly die, if not aided.
214H 192V 1X 28.21% 4218C [Me:Fair] [Kadaj:Good] Mem:5 Exits:NESWU>
Wipeout crashes into Kadaj in a thundering collision, knocking him to
the ground!
214H 192V 1X 28.21% 4218C [Me:Fair] [Kadaj:Fair] Mem:5 Exits:NESWU>
Kadaj has lost his link.
214H 192V 1X 28.21% 4218C [Me:Fair] [Kadaj:Fair] Mem:5 Exits:NESWU>
Kadaj misses you and destroys an image.
Kadaj massacres YOU with his pierce.
You miss Kadaj with your bludgeon.
A lesser displacer beast annihilates Semaj with his hit.
You receive 0 experience.
Semaj is dead! R.I.P.
take pile corpse
exa corpse
The death cry of Semaj echoes from somewhere nearby...
Semaj stops following Kadaj.
The demon Marilith stops following Semaj.
The demon Marilith transcends this world and enters another plane.
190H 192V 1X 28.21% 4218C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> You
get a very large pile of coins from the corpse of Semaj.
There were 1163 coins.
split 1163
190H 192V 1X 28.21% 5381C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> It's
a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a nine sectional staff..it glows blue
a furry white cloak..it glows blue [2]
a milky potion of see invisible..it glows blue
a bright ball of light..it glows dimly
a milky potion of see invisible..it glows blue
a putrid potion
a skull caked with dirt..it glows blue
a piece of sweet bread..it glows blue
a putrid potion [2]
an aquamarine potion..it glows blue
a glowing scroll of recall..it glows blue..it glows dimly [3]
a black ice sphere..it glows blue
a bronze shield
a glowing scroll of recall..it glows blue..it glows dimly [2]
a large waterskin
a shard of obsidian..it glows blue
a small bag of white stones
a small wooden chest
a waterskin [2]
190H 192V 1X 28.21% 5381C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> You
can't split 1163 evenly among the people in the room; splitting 1162
instead.
You divide 1162 coins equally among the group members present.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU>
Kadaj has reconnected.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> take
all corpse
You get a nine sectional staff from the corpse of Semaj.
You get a furry white cloak from the corpse of Semaj.
You get a furry white cloak from the corpse of Semaj.
You get a milky potion of see invisible from the corpse of Semaj.
You get a bright ball of light from the corpse of Semaj.
You get a milky potion of see invisible from the corpse of Semaj.
You get a putrid potion from the corpse of Semaj.
You get a skull caked with dirt from the corpse of Semaj.
You get a piece of sweet bread from the corpse of Semaj.
You get a putrid potion from the corpse of Semaj.
You get a putrid potion from the corpse of Semaj.
You get an aquamarine potion from the corpse of Semaj.
You get a glowing scroll of recall from the corpse of Semaj.
You get a glowing scroll of recall from the corpse of Semaj.
You get a glowing scroll of recall from the corpse of Semaj.
You get a black ice sphere from the corpse of Semaj.
You get a bronze shield from the corpse of Semaj.
You get a glowing scroll of recall from the corpse of Semaj.
You get a glowing scroll of recall from the corpse of Semaj.
You get a large waterskin from the corpse of Semaj.
You get a shard of obsidian from the corpse of Semaj.
You get a small bag of white stones from the corpse of Semaj.
Chest : You can't carry that much weight.
You get a waterskin from the corpse of Semaj.
You get a waterskin from the corpse of Semaj.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> take
all corpse
Chest : You can't carry that much weight.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU>
You move aside quickly as Kadaj attacks!
You move aside quickly as Kadaj attacks!
You miss Kadaj with your bludgeon.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> c 'h
p' kadaj
Tao appears before Wipeout in a puff of smoke.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU> You
can't remember how to cast that spell!
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU>
Wipeout massacres Kadaj with his cleave.
190H 192V 1X 28.21% 4800C [Me:Bad] [Kadaj:Fair] Mem:5 Exits:NESWU>
Kadaj stops using a shadow blade.
Kadaj grabs a scroll of recall.
Kadaj recites a scroll of recall.
Kadaj disappears.
Round 3 FIGHT
Trei flies in from the west.
Kadaj flies in from the west.
396H 141V 1X 28.21% 4800C Mem:3 Exits:NES>
Wipeout flies south.
You follow Wipeout south.
A lesser displacer beast flies in from the north.
Guild Lane
The cobbled lane leads you through a large training center. Major
occupations each have a constructed station in which they train their
skills. You can hear the clashing of metal as trainees in each of the
guilds receive their daily instructions. A small garden lies to the
west of
here, while to your east a somber looking warrior gazes at you from
afar.
A demon is here, phasing in and out of reality at random points in
space. (flying) (invisible)
<PZC> Wipeout the Male Hylar Dwarf is standing here. (flying)
(invisible)
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> o demon c 'f b' kadaj
c 'h p' kadaj
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> You can't remember how to
cast that spell!
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> o demon c 'f b' kadaj
c 'h p' kadaj
Trei flies in from the north.
Kadaj flies in from the north.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> A lesser displacer beast
focuses harshly on Kadaj and utters the words, 'force bolt'.
A lesser displacer beast slowly fades into existence.
The sound of bones cracking echoes as a lesser displacer beast's force
bolt slams into Kadaj.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Trei flies south.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> You can't remember how to
cast that spell!
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Trei flies in from the south.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Wipeout slowly fades into existence.
Wipeout crashes into Kadaj in a thundering collision, knocking him to
the ground!
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Wipeout massacres Kadaj with his cleave.
A lesser displacer beast hits Kadaj extremely hard.
Kadaj massacres a lesser displacer beast with his pierce.
Kadaj pierces a lesser displacer beast very hard.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> o demon c 'a b' kadaj
c 'f b' kadaJ
A lesser displacer beast is busy doing something, try again in a
moment.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kadaj.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Trei focuses harshly on Wipeout and utters some strange words.
Wipeout cries out in pain as Trei grabs him.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> o demon c 'a b' kadaj
c 'f b' kadaJ
A lesser displacer beast utters the words, 'fireball'.
A lesser displacer beast smirks as his fireball explodes into the face
of Trei.
A lesser displacer beast smirks as his fireball explodes into the face
of Kadaj.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW>
Trei crushes a lesser displacer beast hard.
Wipeout massacres Kadaj with his cleave.
A lesser displacer beast massacres Kadaj with his hit.
Kadaj massacres a lesser displacer beast with his pierce.
Kadaj pierces a lesser displacer beast extremely hard.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> A lesser displacer beast is
busy doing something, try again in a moment.
Trei focuses harshly on Wipeout and utters some strange words.
Wipeout cries out in pain as Trei grabs him.
396H 140V 1X 28.21% 4800C Mem:3 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kadaj.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW>
Wipeout crashes into Trei in a thundering collision, knocking him to
the ground!
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> o demon c 'a b' kadaj
c 'f b' kadaJ
Kadaj stands up.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW>
Wipeout cleaves Kadaj extremely hard.
A lesser displacer beast misses Kadaj with his hit.
Kadaj massacres a lesser displacer beast with his pierce.
Kadaj pierces a lesser displacer beast extremely hard.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW>
A lesser displacer beast focuses harshly on Trei and utters the words,
'force bolt'.
The sound of bones cracking echoes as a lesser displacer beast's force
bolt slams into Trei.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> A lesser displacer beast is
busy doing something, try again in a moment.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> Who should the spell be
cast upon?
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW>
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj gives his spear a quick thrust and twist, as he strikes Wipeout
in the back with it.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW>
Kadaj pierces Wipeout extremely hard.
Kadaj pierces Wipeout extremely hard.
Wipeout cleaves Kadaj very hard.
A lesser displacer beast misses Trei with his hit.
Trei crushes a lesser displacer beast hard.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> o demon c 'f b' kadaj
c 'h p' kadaj
A lesser displacer beast focuses harshly on Kadaj and utters the words,
'force bolt'.
The sound of bones cracking echoes as a lesser displacer beast's force
bolt slams into Kadaj.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> You can't remember how to
cast that spell!
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> o demon c 'a b' kadaj
c 'f b' kadaJ
A lesser displacer beast is busy doing something, try again in a
moment.
396H 140V 1X 28.21% 4800C Mem:4 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kadaj.
Wipeout crashes into Kadaj in a thundering collision, knocking him to
the ground!
396H 140V 1X 28.21% 4800C Mem:5 Exits:NESW>
Kadaj massacres Wipeout with his pierce.
Kadaj pierces Wipeout extremely hard.
Wipeout cleaves Kadaj extremely hard.
Kadaj is stunned, but will likely regain consciousness again.
A lesser displacer beast hits Trei very hard.
Trei misses a lesser displacer beast with his crush.
396H 140V 1X 28.21% 4800C Mem:5 Exits:NESW>
Trei stands up.
396H 140V 1X 28.21% 4800C Mem:5 Exits:NESW>
Trei focuses on Kadaj and utters some strange words.
Trei heals Kadaj.
396H 140V 1X 28.21% 4800C Mem:5 Exits:NESW> o demon c 'a b' kadaj
c 'f b' kadaJ
Wipeout massacres Kadaj with his cleave.
A lesser displacer beast hits Trei hard.
A lesser displacer beast focuses harshly on Kadaj and utters the words,
'acid blast'.
Kadaj is caught in some of a lesser displacer beast's acid!
396H 140V 1X 28.21% 4800C Mem:5 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Kadaj.
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW>
Trei utters some strange words.
Trei heals Trei.
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW>
Kadaj misses Wipeout with his pierce.
Kadaj pierces Wipeout very hard.
Wipeout cleaves Kadaj extremely hard.
A lesser displacer beast hits Trei.
Kadaj panics, and attempts to flee.
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW>
Wipeout stops using a clear sphere.
Wipeout grabs a glowing scroll of recall.
Wipeout recites a glowing scroll of recall.
Wipeout disappears.
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW>
A lesser displacer beast focuses harshly on Trei and utters the words,
'acid blast'.
Trei is caught in some of a lesser displacer beast's acid!
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW>
Kadaj leaves south.
396H 140V 1X 28.21% 4800C Mem:6 Exits:NESW> c 'relo' wipeout
You utter the words, 'relocate'
And the close call!
396H 192V 1X 33.33% 5053C Mem:2 Exits:D>
Kadaj slowly fades into existence.
Kadaj comes out of hiding.
Kadaj thrusts a shadow spear into your back.
That Really did HURT!
130H 192V 1X 33.33% 5053C [Me:V.Bad] [Kadaj:Fair] Mem:2 Exits:D>
Kadaj annihilates YOU with his pierce.
Kadaj massacres YOU with his pierce.
You wish your wounds would stop BLEEDING so much!
You should probably stand up!
You bludgeon Kadaj extremely hard.
57H 192V 1X 33.33% 5053C [Me:Awful] [Kadaj:Fair] Mem:2 Exits:D> st
You stand up.
57H 192V 1X 33.33% 5053C [Me:Awful] [Kadaj:Fair] Mem:6 Exits:D>
57H 192V 1X 33.33% 5053C [Me:Awful] [Kadaj:Fair] Mem:6 Exits:D> recite
recall self
You stop using a clear sphere.
You grab a glowing scroll of recall.
You recite a glowing scroll of recall which dissolves.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
