   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   Which zone do you hate the MOST?

   (*) Silvanesti
   ( ) Deepmines
   ( ) Caverns of Thorbardin
   ( ) Dun Mir
   ( ) Mithas
   ( ) Ravenshadow
   ( ) Castle Uth Wistan
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   When Keeping it real, goes wrong.
   [26]View Comments (0)

   POV: Namtara

   Log Rating: 0.0000

   I told them I was fighting!

   318H 170V 3265145X 65.00% 395C Mem:2 Exits:EW> l w
   You see nothing special.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 170V 3265145X 65.00% 395C Mem:2 Exits:EW> c 'haste'giant
   You utter the words, 'haste'
   A hill giant starts to fidget.
   318H 170V 3265145X 65.00% 395C Mem:2 Exits:EW> watch giant
   You now watch a hill giant.
   318H 170V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:EW> w;h jonny;j jonny
   A pech arrives from the
   east.
   A hill giant arrives from the east.
   The Halls of Vague Ambition
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> A pech tries to punch
   Jonny, but he deftly avoids the blow.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> Jonny steps aside as a
   hill giant attempts a bash, stumbles, and falls flat on its face.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**]
   [**Jonny:Perfect**] Mem:2 Exits:NESW>
   A hill giant slashes Jonny extremely hard.
   A hill giant slashes Jonny extremely hard.
   A pech hits Jonny very hard.
   Jonny massacres a pech with his slash.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**]
   [**Jonny:V.Good**] Mem:2 Exits:NESW> ch jonny
   You
   utter the words, 'hold person'
   The magic fails!
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**]
   [**Jonny:V.Good**] Mem:2 Exits:NESW>
   A hill giant stands up.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**]
   [**Jonny:V.Good**] Mem:2 Exits:NESW> o giant
   Jonny panics, and attempts to flee.
   Jonny leaves south.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> o giant st
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> s
   Jonny arrives from the south.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> h jonny
   A pech gives Jonny a
   solid punch in the face.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> j jon
   Perrin arrives from the north.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> j jonny
   Perrin leaves east.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> j jonny
   Jonny steps aside as a
   hill giant attempts a bash, stumbles, and falls flat on its face.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**]
   [**Jonny:V.Good**] Mem:2 Exits:NESW> ch jonn
   Jonny panics, and attempts to flee.
   Jonny leaves south.
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW> ch jonny
   Who should the spell be
   cast upon?
   318H 169V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:2
   Exits:NESW>
   The spheres around you blink out of existance.
   You are hungry.
   You are thirsty.
   318H 183V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:3
   Exits:NESW> e
   A pech arrives from the
   west.
   The Entrance to the Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A small pigmy-like creature stands here.
   318H 182V 3265145X 65.00% 395C Mem:3 Exits:EW> eat all
   Your stomach refuses to eat an ancient jade ring!
   Your stomach refuses to eat a skull shaped medallion!
   Your stomach refuses to eat a robe of swirling shadows!
   Your stomach refuses to eat a spider crown!
   Your stomach refuses to eat a pair of colourful spellcasting gloves!
   Your stomach refuses to eat a pair of finely crafted circlets!
   Your stomach refuses to eat a renegade's robe!
   Your stomach refuses to eat a glowing bracer!
   Your stomach refuses to eat a brass dragonscale battle orb!
   Your stomach refuses to eat a fragmented glowing shard!
   Your stomach refuses to eat a long sword!
   Your stomach refuses to eat a long sword!
   Your stomach refuses to eat a glowing scroll of recall!
   Your stomach refuses to eat a glowing scroll of recall!
   You eat a rat ration.
   You are full.
   There is nothing left now.
   You are too full to eat more!
   Your stomach refuses to eat a large waterskin!
   Your stomach refuses to eat a large waterskin!
   Your stomach refuses to eat a large waterskin!
   318H 182V 3265145X 65.00% 395C Mem:3 Exits:EW> dr water
   You drink the water.
   You are full.
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> !
   Perrin arrives from the east.
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> !
   You drink the water.
   You do not feel thirsty.
   You are full.
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> !
   Perrin leaves west.
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> l wYour stomach can't
   contain anymore!
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> l w
   You see nothing special.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   A hill giant is sitting here.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 182V 3265145X 65.00% 395C Mem:1 Exits:EW> e
   A pech arrives from the west.
   Traders Street
   A wooden sign has been hammered into the ground.
   A small pigmy-like creature stands here.
   A muscular watchman quietly patrols the streets of Port Balifor.
   A peasant girl smiles at you and tries to sell you some fruit.
   318H 181V 3265145X 65.00% 395C Mem:1 Exits:NSW> w
   A pech arrives from the east.
   The Entrance to the Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A small pigmy-like creature stands here.
   318H 180V 3265145X 65.00% 395C Mem:1 Exits:EW> w
   A pech arrives from the east.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A small pigmy-like creature stands here.
   A hill giant is sitting here.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 179V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> o
   Jonny arrives from the west.
   318H 179V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> o giant st
   A hill giant stands up.
   318H 179V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> e
   A pech arrives from the
   west.
   A hill giant arrives from the west.
   The Entrance to the Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   318H 178V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:EW> h jonny;j jonny;ch jonny
   Perrin arrives from the west.
   318H 178V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:EW> h jonny;j jonny;ch jonny
   Perrin leaves west.
   318H 178V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:EW> w;h jonny;j jonny;ch jonny
   A pech arrives from the
   east.
   A hill giant arrives from the east.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . has an earthen hue.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW>
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW>
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW>
   Kratos buys a milky potion of see invisible.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> Who should the spell be
   cast upon?
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW>
   Kratos buys a milky potion of see invisible.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> s
   Kratos buys a milky potion of see invisible.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> sca
   Looking north:
   You see nothing special.
   <VA> Perrin the Male Silvanesti is standing here.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   The stronghold's blacksmith is standing here, flexing his muscles.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW>
   Kratos buys a milky potion of see invisible.
   318H 177V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> n
   A pech arrives from the
   south.
   A hill giant arrives from the south.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A faint blue aura radiates from the walls.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   <VA> Perrin the Male Silvanesti is standing here.
   318H 176V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:SW> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . enveloped in shadows.
   The stronghold's alchemist is standing here, mixing some potions.
   Looking west:
   You see nothing special.
   <VA> Vladia is standing here.
   The stronghold's innkeeper is standing here, giving you a suspicious
   look.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   318H 176V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:SW> s
   A pech arrives from the
   north.
   A hill giant arrives from the north.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . has an earthen hue.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 175V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> sca
   Looking north:
   You see nothing special.
   <VA> Perrin the Male Silvanesti is standing here.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   The stronghold's blacksmith is standing here, flexing his muscles.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   318H 175V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> w
   A pech arrives from the
   east.
   A hill giant arrives from the east.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   318H 174V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:EW> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . has an earthen hue.
   The stronghold's alchemist is standing here, mixing some potions.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   318H 174V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:EW> e
   A pech arrives from the
   west.
   A hill giant arrives from the west.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . enveloped in shadows.
   The stronghold's alchemist is standing here, mixing some potions.
   318H 173V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:NESW> s
   A pech arrives from the
   north.
   A hill giant arrives from the north.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   The stronghold's blacksmith is standing here, flexing his muscles.
   318H 172V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:N> sca
   Looking north:
   You see nothing special.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . enveloped in shadows.
   The stronghold's alchemist is standing here, mixing some potions.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   318H 172V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:N> n;h jonny;j jonny;
   Jonny arrives from the north.
   318H 172V 3265145X 65.00% 395C [**a hill giant:Perfect**] Mem:1
   Exits:N> n;h jonny;j jonny;ch jonn
   Jonny massacres YOU with his slash.
   292H 172V 3265145X 65.00% 395C [Me:V.Good] [Jonny:V.Good] Mem:1
   Exits:N> n;h jonny;j jonny;ch jonny
   You can't do that while
   fighting.
   292H 172V 3265145X 65.00% 395C [Me:V.Good] [Jonny:V.Good] Mem:1
   Exits:N> A pech tries to punch
   Jonny, but he deftly avoids the blow.
   292H 172V 3265145X 65.00% 395C [Me:V.Good] [Jonny:V.Good] Mem:1
   Exits:N> flJonny steps aside as a hill
   giant attempts a bash, stumbles, and falls flat on its face.
   292H 172V 3265145X 65.00% 395C [Me:V.Good] [Jonny:V.Good] Mem:1
   Exits:N> fleYou utter the words, 'hold
   person'
   The magic fails!
   292H 172V 3265145X 65.00% 395C [Me:V.Good] [Jonny:V.Good] Mem:2
   Exits:N> fle
   A hill giant slashes Jonny extremely hard.
   A hill giant misses Jonny with its slash.
   A pech bruises Jonny with his hit.
   Jonny massacres YOU with his slash.
   267H 172V 3265145X 65.00% 395C [Me:Good] [Jonny:V.Good] Mem:2 Exits:N>
   Jonny focuses his purity on your leg!
   Jonny focuses on your legs, but is thwarted by your quickness.
   267H 172V 3265145X 65.00% 395C [Me:Good] [Jonny:V.Good] Mem:2 Exits:N>
   You flee head over heels.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   <VA> Perrin the Male Silvanesti is standing here.
   The spirit of a minotaur captain is hovering here.
   <VA> Kratos, Ravan's Child is standing here. (flying)
   . . . has a tough exterior.
   The stronghold's alchemist is standing here, mixing some potions.
   267H 171V 3265145X 65.00% 395C Mem:2 Exits:NESW> s
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here, fighting a hill
   giant.
   A hill giant is standing here, fighting Jonny.
   A pech is standing here, fighting Jonny.
   The stronghold's blacksmith is standing here, flexing his muscles.
   A hill giant tries to punch Jonny, but he deftly avoids the blow.
   A pech gives Jonny a solid punch in the face.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> o
   Jonny massacres a hill giant with his slash.
   Jonny blocks a hill giant's blow with a quick raise of his shield.
   A pech hits Jonny.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> o giant st
   A hill giant is busy doing something, try again in a
   moment.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   !Jonny strikes at a hill giant, but misses completely.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> o giant st
   A pech tries to sweep Jonny's legs, but misses badly.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> o giant st
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   Jonny massacres a hill giant with his slash.
   Jonny blocks a hill giant's blow with a quick raise of his shield.
   A pech misses Jonny with his hit.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> !
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> j
   A hill giant crashes into Jonny in a thundering
   collision, knocking him to the ground!
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> c 'power'
   You utter the words, 'power word stun'
   Jonny is stunned!
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N>
   A hill giant massacres Jonny with its slash.
   A pech massacres Jonny with his hit.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> watch giant
   A pech gives Jonny a solid punch in the face.
   267H 170V 3265145X 65.00% 395C Mem:2 Exits:N> fb jonYou now watch a
   hill giant.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Good**]
   Mem:2 Exits:N> fb jonn
   A hill giant gives Jonny a solid punch in the face.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Good**]
   Mem:2 Exits:N> fb jonny
   You utter the
   words, 'force bolt'
   You hear bones crack as your force bolt slams into Jonny.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Fair**]
   Mem:3 Exits:N>
   A hill giant massacres Jonny with its slash.
   A hill giant massacres Jonny with its slash.
   A pech hits Jonny hard.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Fair**]
   Mem:3 Exits:N> o giant bash
   A pech gives Jonny a solid punch in the face.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Fair**]
   Mem:3 Exits:N> A hill giant
   crashes into Jonny in a thundering collision, knocking him to the
   ground!
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Fair**]
   Mem:3 Exits:N> !
   A hill giant massacres Jonny with its slash.
   A hill giant slashes Jonny extremely hard.
   A pech hits Jonny hard.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Bad**]
   Mem:3 Exits:N> A hill giant
   is busy doing something, try again in a moment.
   267H 170V 3265145X 65.00% 395C [**a hill giant:Good**] [**Jonny:Bad**]
   Mem:3 Exits:N> c 'mal'
   You utter the
   words, 'malevolent tentacles'
   You conjure a writhing mass of inky black tentacles!
   Jonny appears to grow stronger.
   Jonny narrowly escapes the gruesome black tentacles!
   267H 170V 3265145X 65.00% 395C [Me:Good] [a hill giant:Good]
   [Jonny:Bad] Mem:3 Exits:N> ooh
   Jonny screams in pain as inky black tentacles constrict him.
   You hit Jonny.
   A hill giant massacres Jonny with its slash.
   A pech hits Jonny hard.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Good]
   [Jonny:Bad] Mem:3 Exits:N> mm jonA pech
   delivers a vicious kick to Jonny's face. Blood flies as his head snaps
   back.
   You ooh and ahh, as if extremely impressed.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Good]
   [Jonny:V.Bad] Mem:3 Exits:N> mm jonny
   You utter
   the words, 'magic missile'
   You watch with selfpride as the magic missile hits Jonny.
   You watch with selfpride as the magic missile hits Jonny.
   You watch with selfpride as the magic missile hits Jonny.
   You watch with selfpride as the magic missile hits Jonny.
   You watch with selfpride as the magic missile hits Jonny.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Good]
   [Jonny:V.Bad] Mem:3 Exits:N>
   A hill giant gives Jonny a solid punch in the face.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Good]
   [Jonny:V.Bad] Mem:3 Exits:N> !
   Jonny brings his halberd down with a mighty cleave, crushing a hill
   giant.
   Jonny massacres a hill giant with his slash.
   Jonny blocks a hill giant's blow with a quick raise of his shield.
   A pech misses Jonny with his hit.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Fair]
   [Jonny:V.Bad] Mem:3 Exits:N> !
   Jonny stands up.
   285H 183V 3265145X 65.00% 395C [Me:Good] [a hill giant:Fair]
   [Jonny:V.Bad] Mem:3 Exits:N> !
   Jonny panics, and attempts to flee.
   Jonny leaves north.
   285H 183V 3265145X 65.00% 395C Mem:3 Exits:N> o giant st
   A hill giant is busy doing something, try again in a
   moment.
   285H 183V 3265145X 65.00% 395C Mem:3 Exits:N> n
   A pech arrives from the south.
   A hill giant arrives from the south.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   <VA> Perrin the Male Silvanesti is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW> j jo
   Jonny lays his hands on Jonny and utters a prayer.
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW> j jonny
   A hill giant crashes into Jonny in a thundering
   collision, knocking him to the ground!
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW>
   A hill giant massacres Jonny with its slash.
   Jonny thrusts the point of his halberd into a hill giant, deeply
   wounding it.
   Jonny massacres a hill giant with his slash.
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW> h jonny
   A pech tries to sweep Jonny's legs, but misses
   badly.
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW>
   A pech misses Jonny with his hit.
   A hill giant massacres Jonny with its slash.
   Jonny slashes a hill giant extremely hard.
   285H 182V 3265145X 65.00% 395C Mem:3 Exits:NESW> c 'power'
   You utter the words, 'power word stun'
   Jonny is stunned momentarily, recovering quickly.
   Perrin is stunned momentarily, recovering quickly.
   285H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:V.Bad]
   [Jonny:Good] Mem:4 Exits:NESW>
   Perrin gasps in astonishment.
   285H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:V.Bad]
   [Jonny:Good] Mem:4 Exits:NESW>
   Perrin bludgeons YOU extremely hard.
   You miss Jonny with your hit.
   A pech hits Jonny very hard.
   Jonny blocks a hill giant's blow with a quick raise of his shield.
   Jonny massacres a hill giant with his slash.
   Jonny stands up.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:V.Bad]
   [Jonny:Good] Mem:4 Exits:NESW>
   Jonny attempts to strike at a hill giant with his halberd.
   Jonny slashes a hill giant extremely hard.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:4 Exits:NESW> !
   Perrin focuses harshly on you and utters the words, 'silence'.
   You feel a slight chill.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:4 Exits:NESW> You
   utter the words, 'power word stun'
   Jonny is stunned!
   Perrin is stunned momentarily, recovering quickly.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:5 Exits:NESW> fle
   fl
   A pech spins and tries to kick Jonny, but Jonny dodges out of the way.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:5 Exits:NESW> fle
   fle
   A pech hits Jonny very hard.
   A hill giant massacres Jonny with its slash.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:5 Exits:NESW>
   Perrin focuses harshly on you and utters the words, 'silence'.
   You feel a slight chill.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:5 Exits:NESW>
   A hill giant gives Jonny a solid punch in the face.
   267H 182V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Good] Mem:5 Exits:NESW> You
   flee head over heels.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A faint blue aura radiates from the walls.
   267H 181V 3265145X 65.00% 395C Mem:5 Exits:SW> You're not fighting, why
   bother fleeing?
   267H 181V 3265145X 65.00% 395C Mem:5 Exits:SW> You're not fighting, why
   bother fleeing?
   267H 181V 3265145X 65.00% 395C Mem:5 Exits:SW> s
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A hill giant is standing here, fighting Jonny.
   A pech is standing here, fighting Jonny.
   <VA> Jonny Boy, Way Cooler Than Rafo is sitting here, fighting a hill
   giant.
   <VA> Perrin the Male Silvanesti is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   267H 180V 3265145X 65.00% 395C Mem:5 Exits:NESW> wat
   A pech hits Jonny very hard.
   A hill giant massacres Jonny with its slash.
   267H 180V 3265145X 65.00% 395C Mem:5 Exits:NESW> watch giant
   You now watch a hill giant.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW>
   Perrin shrugs helplessly.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW>
   A pech tries in vain to disarm Jonny's weapon.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW> fb jonny
   A hill giant gives Jonny a solid punch in the face.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW> You utter
   the words, 'force bolt'
   You hear bones crack as your force bolt slams into Jonny.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW>
   A pech hits Jonny extremely hard.
   A hill giant massacres Jonny with its slash.
   267H 180V 3265145X 65.00% 395C [**a hill giant:Awful**]
   [**Jonny:Fair**] Mem:5 Exits:NESW> c 'mal'
   A pech
   delivers a quick snap kick to Jonny. Jonny staggers and tries to
   recover.
   You utter the words, 'malevolent tentacles'
   You conjure a writhing mass of inky black tentacles!
   Jonny appears to grow stronger.
   Jonny narrowly escapes the gruesome black tentacles!
   Perrin screams in pain as inky black tentacles constrict him.
   267H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Fair] Mem:5 Exits:NESW>
   Perrin focuses harshly on you and utters some strange words.
   You feel a slight chill.
   267H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Fair] Mem:5 Exits:NESW>
   Jonny screams in pain as inky black tentacles constrict him.
   You hit Jonny.
   A pech hits Jonny very hard.
   A hill giant massacres Jonny with its slash.
   267H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:Bad] Mem:5 Exits:NESW>
   A hill giant delivers a vicious kick to Jonny's face. Blood flies as
   his head snaps back.
   267H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:5 Exits:NESW> lb
   Perrin bludgeons YOU extremely hard.
   You bruise Jonny with your hit.
   A pech hits Jonny extremely hard.
   A hill giant massacres Jonny with its slash.
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:5 Exits:NESW> You
   utter the words, 'lightning bolt'
   The lightning bolt hits Jonny with full impact.
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:6 Exits:NESW>
   Perrin says 'friggin saves'
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:6 Exits:NESW>
   A pech gives Jonny a solid punch in the face.
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:6 Exits:NESW> fb
   Perrin says 'friggin saves'
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:6 Exits:NESW>
   A hill giant strikes Jonny's weapon, nearly disarming it.
   252H 180V 3265145X 65.00% 395C [Me:Good] [a hill giant:Awful]
   [Jonny:V.Bad] Mem:6 Exits:NESW>
   Perrin massacres YOU with his bludgeon.
   A pech hits Jonny very hard.
   Jonny deflects part of a hill giant's blow with his shield.
   A hill giant slashes Jonny extremely hard.
   Jonny massacres a hill giant with his slash.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [a hill giant:Awful]
   [Jonny:Awful] Mem:6 Exits:NESW>
   Perrin focuses harshly on you and utters some strange words.
   You feel a slight chill.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [a hill giant:Awful]
   [Jonny:Awful] Mem:6 Exits:NESW>
   Jonny stands up.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [a hill giant:Awful]
   [Jonny:Awful] Mem:6 Exits:NESW> You
   utter the words, 'force bolt'
   Your force bolt shatters Jonny's skull into lifeless goo.
   You receive 0 experience.
   Jonny is dead! R.I.P.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [Jonny:Dying] Mem:6
   Exits:NESW>
   The death cry of Jonny echoes from somewhere nearby...
   You direct your attention to Perrin.
   Your clanmate Jonny has left the game.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct
   Your clanmate Jonny has entered the game.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct w
   Perrin dodges your attack!
   231H 180V 3265145X 65.00% 395C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct wow
   Jonny arrives from the north.
   231H 180V 3265145X 65.00% 395C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct wow.You get a very large pile
   of coins from the corpse of Jonny.
   There were 5947 coins.
   231H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct wow..It's a pretty ghastly
   sight! Searching through the remains, you find:
   corpse (here) :
   an arena champion's medal..it glows blue
   a keen-edged mithril halberd..covered in blood
   a thick dwarven bracelet..covered in blood..it glows blue
   a heavy black belt..covered in blood..it glows blue
   a cloak of a chimera..covered in blood
   a heavy spiked shield..covered in blood..it glows blue
   a pair of steel armplates inlaid with ebony..covered in blood..it glows
   blue..it glows dimly
   a pair of ice cold gauntlets..covered in blood..it glows blue..it glows
   dimly
   a pair of wicked black boots..covered in blood..it glows blue
   a set of treated steel legplates..it glows blue..it glows dimly
   a sapphire circlet..covered in blood
   a dark smoked breastplate..it glows blue
   a chain of office..covered in blood
   a swamp dragontooth medallion..covered in blood
   a silver skull ring..covered in blood..it glows blue
   an orb of justice..covered in blood..it glows blue..it glows dimly
   an erudite's sword..covered in blood..it glows blue..it glows dimly
   a pair of sterling gauntlets..covered in blood
   a papal cross..it glows dimly
   [return for more, q to stop]ct wow..
   231H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> You tell your clan
   'wow..'
   231H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct i t
   You barely hit Perrin.
   Perrin bludgeons YOU extremely hard.
   212H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> ct i thought you were more hps than that
   You tell your clan 'i
   thought you were more hps than that'
   212H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> fl
   Jonny tells your clan 'wtf idiot!'
   212H 180V 3265145X 65.00% 6342C [Me:Fair] [Perrin:V.Good] Mem:6
   Exits:NESW> fle
   You flee head over
   heels.
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   A faint blue aura radiates from the walls.
   212H 179V 3265145X 65.00% 6342C Mem:6 Exits:SW> !
   You're not fighting, why bother fleeing?
   212H 179V 3265145X 65.00% 6342C Mem:6 Exits:SW> s
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   The corpse of Jonny is lying here.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   A hill giant is roaming around looking for something to kill.
   A small pigmy-like creature stands here.
   <VA> Perrin the Male Silvanesti is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   212H 178V 3265145X 65.00% 6342C Mem:6 Exits:NESW> sad
   Awwww! Don't give up hope. I'm sure your mother
   loves you...
   212H 178V 3265145X 65.00% 6342C Mem:6 Exits:NESW> say now i feel bad
   You say 'now i feel bad'
   212H 178V 3265145X 65.00% 6342C Mem:6 Exits:NESW>
   Jonny gets an arena champion's medal from the corpse of Jonny.
   Jonny gets a keen-edged mithril halberd from the corpse of Jonny.
   Jonny gets a thick dwarven bracelet from the corpse of Jonny.
   Jonny gets a heavy black belt from the corpse of Jonny.
   Jonny gets a cloak of a chimera from the corpse of Jonny.
   Jonny gets a heavy spiked shield from the corpse of Jonny.
   Jonny gets a pair of steel armplates inlaid with ebony from the corpse
   of Jonny.
   Jonny gets a pair of ice cold gauntlets from the corpse of Jonny.
   Jonny gets a pair of wicked black boots from the corpse of Jonny.
   Jonny gets a set of treated steel legplates from the corpse of Jonny.
   Jonny gets a sapphire circlet from the corpse of Jonny.
   Jonny gets a dark smoked breastplate from the corpse of Jonny.
   Jonny gets a chain of office from the corpse of Jonny.
   Jonny gets a swamp dragontooth medallion from the corpse of Jonny.
   Jonny gets a silver skull ring from the corpse of Jonny.
   Jonny gets an orb of justice from the corpse of Jonny.
   Jonny gets an erudite's sword from the corpse of Jonny.
   Jonny gets a pair of sterling gauntlets from the corpse of Jonny.
   Jonny gets a papal cross from the corpse of Jonny.
   Jonny gets a glowing scroll of recall from the corpse of Jonny.
   Jonny gets a glowing scroll of recall from the corpse of Jonny.
   Jonny gets a glowing scroll of recall from the corpse of Jonny.
   Jonny gets a small wooden chest from the corpse of Jonny.
   Jonny gets a blackened chest from the corpse of Jonny.
   212H 178V 3265145X 65.00% 6342C Mem:6 Exits:NESW> release giant
   You release a hill giant from your service.
   A hill giant transcends this world and enters another plane.
   A hill giant stops following you.
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> get shield
   You get a bronze shield.
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> get scimitar
   You get a diabolic crimson-stained scimitar.
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> l
   The Halls of Vague Ambition
   You notice some bloody footprints on the ground.
   The corpse of Jonny is lying here.
   <VA> Jonny Boy, Way Cooler Than Rafo is standing here.
   A small pigmy-like creature stands here.
   <VA> Perrin the Male Silvanesti is standing here.
   The stronghold's alchemist is standing here, mixing some potions.
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> release pech
   You release a pech from your service.
   A pech transcends this world and enters another plane.
   A pech stops following you.
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> say i
   Jonny says 'u fuckin should!!!'
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> say im so po
   Kratos tells your clan 'brotherly love'
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW> say im so posting
   that
   You say 'im so posting that'
   230H 183V 3265145X 65.00% 6342C Mem:5 Exits:NESW>
   Perrin says 'yeah, i didn't think you were actually going to kill him'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2755.html?option=forums&action=displaythread&threadid=2755
