<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

How many times have you been spooned by another Arctic player?

(*) 0
( ) 1
( ) 2-5
( ) 5-10
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Alxius Dies AFK

POV: Crispen

Log Rating: 0.8750

391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:3 Exits:N> o s
The weaponsmith says 'I don't trade with someone I can't see!'
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:3 Exits:N> l
Weapons R Us
Penol the Female Hill Dwarf is standing here. (invisible)
. . . has a tough exterior.
A gargoyle is standing here.
<PZC> Alxius, Relapsing Whiskey Czar is standing here. (flying)
A cityguard stands here, keeping a wary eye out for troublemakers.
The weaponsmith is here polishing a longsword.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:3 Exits:N> r
You sit down and rest your tired
bones.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N>
Penol stops using a black leather buckler.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N>
Penol smiles warmly at you.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N> say hi
Penol says 'sup guys'
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N> say hi
You say 'hi'
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N> who
Immortals
---------
[Grd 32] Helati de-Orilg, Matriarch of the Kazelati
Heroes
------
[Hero 31] Sappe Ling
Mortals
-------
<Otlw> Idril, That's All
<MAN> Brannigan, The Man With No Name
<MYTH> Master Borwin, Mythical Jedi
<MAEL> Nada the Female Human
Droog the Female Gnome
Ruff the Male Human
<Otlw> Mortlock Cyanslayer, Baker of Pies
Blaine the Male Hylar Dwarf
<Otlw> Gram the Male Hylar Dwarf
Gord the Male Kagonesti (deaf)
Penol the Female Hill Dwarf
Darz the Male Goblin
[return for more, q to stop]
Gustaf Nilsson, Old Farmer of Holmsjo
<PZC> Alxius, Relapsing Whiskey Czar
<CAS> Salanthalas the Male Gnome
Srid the Female Silvanesti
<LoS> Crispen Ash, Burning Flames of the Legion of Steel
<Otlw> Gorass the Male Kagonesti
<Otlw> Stax the Male Hylar Dwarf
Pap the Male Goblin
<Otlw> Aplaenych Aire, Buffeted by a Strong Wind
<Otlw> Infama the Female Human
Total visible people : 24 Total people online : 24
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N>
Penol buys a short sword.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N>
Penol buys a short sword.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N>
Penol leaves north.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:1 Exits:N> #TICK-10
#TICK!!!
#OK NEW TICKSIZE SET
Your studies complete, you close your spellbook with a smile.
You hear a loud "cock-a-doodle-doo" from far away.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Exits:N> st
You stand up.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Exits:N> ch alxius
You utter the words, 'hold person'
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:2 Exits:N> sni
ch alxius
You snicker softly.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:2 Exits:N> You utter
the words, 'hold person'
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:2 Exits:N> o stone
kil al#TICK+10
o stone kil alxiu
A Kalaman cityguard arrives from the north.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] Mem:2 Exits:N> o stone
kil alxius
A gargoyle gives Alxius a solid punch
in the face.
391H 126V 1X 0.00% 0C [**a gargoyle:Perfect**] [**Alxius:V.Good**]
Mem:2 Exits:N> lb alxius
A gargoyle claws Alxius extremely hard.
A gargoyle pierces Alxius very hard.
A gargoyle claws Alxius extremely hard.
Alxius slashes a gargoyle extremely hard.
Alxius slashes a gargoyle hard.
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:V.Good**] Mem:2
Exits:N> lb alxius
You utter the words,
'lightning bolt'
The lightning bolt hits Alxius with full impact.
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:Good**] Mem:3
Exits:N> say wak
A gargoyle claws Alxius extremely hard.
A gargoyle pierces Alxius very hard.
A gargoyle claws Alxius extremely hard.
Alxius slashes a gargoyle very hard.
Alxius slashes a gargoyle hard.
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:Good**] Mem:3
Exits:N> say wake up!
A gargoyle delivers a vicious kick to Alxius's face. Blood flies as his
head snaps back.
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:Good**] Mem:3
Exits:N> lb alxius
You say 'wake up!'
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:Good**] Mem:3
Exits:N> You utter the words,
'lightning bolt'
The lightning bolt hits Alxius with full impact.
391H 126V 1X 0.00% 0C [**a gargoyle:Good**] [**Alxius:Fair**] Mem:3
Exits:N> lb alxius
A gargoyle claws Alxius extremely hard.
A gargoyle pierces Alxius very hard.
Alxius misses a gargoyle with his slash.
Alxius slashes a gargoyle very hard.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:Fair**] Mem:3
Exits:N> You utter the words,
'lightning bolt'
The lightning bolt hits Alxius with full impact.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:Bad**] Mem:3
Exits:N>
A gargoyle delivers a vicious kick to Alxius's face. Blood flies as his
head snaps back.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:Bad**] Mem:3
Exits:N> lb alxius
A gargoyle claws Alxius extremely hard.
A gargoyle pierces Alxius very hard.
A gargoyle misses Alxius with its claw.
Alxius slashes a gargoyle very hard.
Alxius slashes a gargoyle very hard.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:Bad**] Mem:3
Exits:N> You utter the words,
'lightning bolt'
The lightning bolt hits Alxius with full impact.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:V.Bad**] Mem:4
Exits:N> lb alxius
A gargoyle claws Alxius extremely hard.
A gargoyle pierces Alxius extremely hard.
A gargoyle misses Alxius with its claw.
Alxius slashes a gargoyle extremely hard.
Alxius slashes a gargoyle hard.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:V.Bad**] Mem:4
Exits:N>
A gargoyle spins and tries to kick Alxius, but Alxius dodges out of the
way.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:V.Bad**] Mem:4
Exits:N> fbYou utter the words,
'lightning bolt'
The lightning bolt hits Alxius with full impact.
391H 126V 1X 0.00% 0C [**a gargoyle:Fair**] [**Alxius:Awful**] Mem:4
Exits:N> fb alxius
A gargoyle massacres Alxius with its claw.
A gargoyle pierces Alxius extremely hard.
Alxius slashes a gargoyle extremely hard.
Alxius barely slashes a gargoyle.
391H 126V 1X 0.00% 0C [**a gargoyle:V.Bad**] [**Alxius:Awful**] Mem:4
Exits:N>
A gargoyle delivers a quick snap kick to Alxius. Alxius staggers and
tries to recover.
391H 126V 1X 0.00% 0C [**a gargoyle:V.Bad**] [**Alxius:Awful**] Mem:4
Exits:N> You utter the words,
'force bolt'
You hear bones crack as your force bolt slams into Alxius.
391H 126V 1X 0.00% 0C [**a gargoyle:V.Bad**] [**Alxius:Awful**] Mem:5
Exits:N>
A gargoyle claws Alxius very hard.
A gargoyle pierces Alxius extremely hard.
Alxius is stunned, but will likely regain consciousness again.
A gargoyle annihilates Alxius with its claw.
Alxius is dead! R.I.P.
The death cry of Alxius echoes from somewhere nearby...
Alxius sinks gently to the ground.
391H 126V 1X 0.00% 0C [**a gargoyle:V.Bad**] Mem:5 Exits:N> g#TICK-10
get all xHuh?!
391H 126V 1X 0.00% 0C [**a gargoyle:V.Bad**] Mem:5 Exits:N> get all
alxius
You get a grim looking sword from the
corpse of Alxius.
You get a gold and black laced sickle from the corpse of Alxius.
You get a thin jeweled belt from the corpse of Alxius.
You get a set of demon wings from the corpse of Alxius.
You get a pair of black ice arm guards from the corpse of Alxius.
You get a pair of cord sandals from the corpse of Alxius.
You get a pair of fur-trimmed leather breeches from the corpse of
Alxius.
You get a great helm from the corpse of Alxius.
You get a suit of red dragonscale plate from the corpse of Alxius.
You get a black velvet cloak from the corpse of Alxius.
You get a dark elven piwafi from the corpse of Alxius.
You get a foul smelling ring from the corpse of Alxius.
You get a foul smelling ring from the corpse of Alxius.
You get a very large pile of coins from the corpse of Alxius.
There were 6545 coins.
You get a milky potion of see invisible from the corpse of Alxius.
Medallion : You can't carry that much weight.
You get a black key from the corpse of Alxius.
Scroll : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.
Scroll : You can't carry that much weight.
Scroll : You can't carry that much weight.
You get a large waterskin from the corpse of Alxius.
Medallion : You can't carry that much weight.
Keg : You can't carry that much weight.
Waterskin : You can't carry that much weight.
Waterskin : You can't carry that much weight.
391H 126V 1X 0.00% 6545C [**a gargoyle:V.Bad**] Mem:5 Exits:N> You
belong to no group.
391H 126V 1X 0.00% 6545C [**a gargoyle:V.Bad**] Mem:5 Exits:N> o stone
get all alcius
391H 126V 1X 0.00% 6545C [**a gargoyle:V.Bad**] Mem:5 Exits:N> l in
corpse
corpse (here) :
a light medallion..it glows dimly
a glowing scroll of recall..it glows dimly
a bottle of firebreather [4]
a glowing scroll of recall..it glows dimly [2]
a light medallion..it glows dimly
a portable keg
a waterskin [2]

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
