<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Quintley steps out for his last breath of fresh air.

POV:

Log Rating: -0.7646

Quintley had been sitting in the inn for a while and decided to step
out and get a breath of fresh air. Resulting in his death.

499H 118V 2412979X 0C Exits:NESW>
Tikk flies west.
You follow Tikk west.
Traveler's Lodge
The lodge is famous for its hospitality and friendly service. The
lodge also has its own cafe, where they make great tasting coffee.
There is
also a lounge for the guests to rest and relax or do some reading. The
entrance is quite large and open; you get a feeling you will enjoy your
stay here already.
Lady Raymie, Renshai Songstress is standing here. (flying) (invisible)
. . . has a tough exterior.
Neugen Ch'Tath, Renshai's Renegade Mage of Many Colors is standing
here. (flying) (invisible)
Lasan Renshai, Knight of the Lance is standing here. (flying)
(invisible)
Tikk Tock, Renshai's Supa Timekeeper is standing here. (flying)
(invisible)
A Knight of Solamnia walks about the inn, keeping it safe.
499H 117V 2412979X 0C Exits:NESW>
Arjuna arrives from the south.
499H 117V 2412979X 0C Exits:NESW>
Arjuna leaves west.
499H 117V 2412979X 0C Exits:NESW>
Quintley arrives from the south.
499H 117V 2412979X 0C Exits:NESW>
Lasan attempts to strike at Quintley with her glaive.
Lasan slowly fades into existence.
Lasan cleaves Quintley very hard.
499H 117V 2412979X 0C Exits:NESW> You BASHED -->Quintley<--
499H 117V 2412979X 0C [Me:Perfect] [Lasan:Perfect] [Quintley:V.Good]
Exits:NESW>
Neugen focuses harshly on Quintley and utters some strange words.
499H 117V 2412979X 0C [Me:Perfect] [Lasan:Perfect] [Quintley:V.Good]
Exits:NESW>
Arjuna arrives from the west.
A knight of the sword looks at you and yells 'There's the scoundrel!'
499H 117V 2412979X 0C [Me:Perfect] [Lasan:Perfect] [Quintley:V.Good]
Exits:NESW>
Raymie focuses harshly on Quintley and utters some strange words.
Raymie slowly fades into existence.
Raymie sends a chilling blast of air at Quintley, giving him a severe
case of frostbite.
499H 117V 2412979X 0C [Me:Perfect] [Lasan:Perfect] [Quintley:Good]
Exits:NESW>
Arjuna leaves east.
499H 117V 2412979X 0C [Me:Perfect] [Lasan:Perfect] [Quintley:Good]
Exits:NESW>
A knight of the sword slashes YOU very hard.
You massacre Quintley with your slash.
Lasan massacres Quintley with her cleave.
Lasan blocks Quintley's blow with a quick raise of her shield.
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Good]
Exits:NESW> #TICK+10
A knight of the sword looks at you and yells 'There's the scoundrel!'
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Good]
Exits:NESW>
Tikk focuses harshly on Quintley and utters some strange words.
Quintley is paralyzed!
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Good]
Exits:NESW>
Lasan attempts to strike at Quintley with her glaive.
Lasan annihilates Quintley with her cleave.
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW>
Horek arrives from the south.
A knight of the sword looks at you and yells 'There's the scoundrel!'
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW>
Neugen focuses harshly on Quintley and utters some strange words.
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW> ba
Raymie focuses harshly on Quintley and utters some strange words.
Raymie slowly fades into existence.
Raymie sends a chilling blast of air at Quintley, giving him a severe
case of frostbite.
485H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW> bas
A knight of the sword slashes YOU extremely hard.
A knight of the sword slashes YOU extremely hard.
You slash Quintley extremely hard.
Lasan massacres Quintley with her cleave.
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW> bas
You BASHED -->Quintley<--
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Fair]
Exits:NESW>
Lasan attempts to strike at Quintley with her glaive.
Lasan cleaves Quintley extremely hard.
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Bad]
Exits:NESW>
Horek waves goodbye to Quintley.
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Bad]
Exits:NESW>
A knight of the sword looks at you and yells 'There's the scoundrel!'
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Bad]
Exits:NESW>
Neugen pierces Quintley very hard.
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Bad]
Exits:NESW>
Calen arrives from the south.
A griffon flies in from the south.
A knight of the sword looks at you and yells 'There's the scoundrel!'
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:Bad]
Exits:NESW>
Raymie focuses harshly on Quintley and utters some strange words.
Raymie slowly fades into existence.
Raymie sends a chilling blast of air at Quintley, giving him a severe
case of frostbite.
450H 117V 2412979X 0C [Me:V.Good] [Lasan:Perfect] [Quintley:V.Bad]
Exits:NESW>
Neugen pierces Quintley extremely hard.
A knight of the sword slashes YOU extremely hard.
A knight of the sword slashes YOU extremely hard.
You massacre Quintley with your slash.
Lasan cleaves Quintley extremely hard.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:V.Bad]
Exits:NESW>
Lasan attempts to strike at Quintley with her glaive.
Lasan massacres Quintley with her cleave.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:V.Bad]
Exits:NESW>
Arjuna arrives from the east.
A knight of the sword looks at you and yells 'There's the scoundrel!'
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:V.Bad]
Exits:NESW>
Calen attempts to strike at Quintley with his blade.
Calen slashes Quintley extremely hard.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:Awful]
Exits:NESW>
Arjuna leaves south.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:Awful]
Exits:NESW>
Raymie slowly fades into existence.
Raymie slashes Quintley extremely hard.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:Awful]
Exits:NESW> bas
Neugen focuses harshly on Quintley and utters some strange words.
The sound of bones cracking echoes as Neugen's force bolt slams into
Quintley.
413H 117V 2412979X 0C [Me:Good] [Lasan:Perfect] [Quintley:Awful]
Exits:NESW>
Raymie slashes Quintley extremely hard.
Calen massacres Quintley with his slash.
You receive 0 experience.
Quintley is dead! R.I.P.
A knight of the sword slashes YOU extremely hard.
The death cry of Quintley echoes from somewhere nearby...
You direct your attention to a knight of the sword.
Tikk gets a glowing scroll of recall from the corpse of Quintley.
Tikk gets an erudite's sword from the corpse of Quintley.
Tikk gets an animal skull bracelet from the corpse of Quintley.
Tikk gets a black sword belt from the corpse of Quintley.
Tikk gets a backpack from the corpse of Quintley.
Tikk gets a kender hide shield from the corpse of Quintley.
Tikk gets a pair of black boots from the corpse of Quintley.
Tikk gets some black studded dragonarmy greaves from the corpse of
Quintley.
Tikk gets a charred helm and visor from the corpse of Quintley.
Tikk gets a large pile of coins from the corpse of Quintley.
Tikk gets a swollen mouse bladder from the corpse of Quintley.
Tikk gets a swollen mouse bladder from the corpse of Quintley.
Tikk gets a swollen mouse bladder from the corpse of Quintley.
396H 117V 2412979X 0C [Me:Good] [a knight of the sword:Perfect]
Exits:NESW>
Horek gets a bright orange potion from the corpse of Quintley.
Horek gets a bright orange potion from the corpse of Quintley.
Horek gets a small wooden chest from the corpse of Quintley.
Horek gets a yellow potion from the corpse of Quintley.
396H 117V 2412979X 0C [Me:Good] [a knight of the sword:Perfect]
Exits:NESW>
A knight of the sword utters some strange words.
A knight of the sword is bathed in a blinding white light.
396H 117V 2412979X 0C [Me:Good] [a knight of the sword:Perfect]
Exits:NESW>
Horek leaves east.
396H 117V 2412979X 0C [Me:Good] [a knight of the sword:Perfect]
Exits:NESW> You BASHED -->a knight of the sword<--
396H 117V 2412647X 0C [Me:Good] [a knight of the sword:V.Good]
Exits:NESW>
Horek arrives from the east.
396H 117V 2412647X 0C [Me:Good] [a knight of the sword:V.Good]
Exits:NESW>
You slash a knight of the sword extremely hard.
A knight of the sword slashes YOU extremely hard.
A knight of the sword slashes YOU extremely hard.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW>
Neugen focuses harshly on a knight of the sword and utters some strange
words.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW>
Horek has left the game.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW>
Raymie laughs heartily.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW> gt MY B
Arjuna arrives from the south.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW> gt MY BASH WI
Calen leaves west.
A griffon flies west.
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW>
Tikk says 'flee'
358H 117V 2412274X 0C [Me:Fair] [a knight of the sword:V.Good]
Exits:NESW> gt MY BASH WINS
You slash a knight of the sword hard.
A knight of the sword massacres YOU with his slash.
334H 117V 2412087X 0C [Me:Fair] [a knight of the sword:Good]
Exits:NESW> gt MY BAS
Neugen focuses harshly on a knight of the sword and utters some strange
words.
Neugen aims a magic missile at a knight of the sword, who staggers
under the blow.
Neugen aims a magic missile at a knight of the sword, who staggers
under the blow.
Neugen aims a magic missile at a knight of the sword, who staggers
under the blow.
Neugen aims a magic missile at a knight of the sword, who staggers
under the blow.
Neugen aims a magic missile at a knight of the sword, who staggers
under the blow.
334H 117V 2412087X 0C [Me:Fair] [a knight of the sword:Good]
Exits:NESW> fle
You flee head over heels.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
