   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   What I really want for 2012 is...

   (*) More classes/Races to play
   ( ) More high level zones
   ( ) Did voting help?
   ( ) Ppl upload Logs
   ( ) Mavlad to play again
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   CQ Take 2
   [26]View Comments (12)

   POV: Bit

   Log Rating: -1.3333

   Tried to solo the 3, lacked one darkness and had to retreat. In the
   process, clannies' implanted pk chip activated and we promptly form a 3
   man hit skqwad

   628H 144V 3404674X 8.90% 4384C Exits:EW> w
   The Crystal Quest
   The corpse of a three-headed snake is lying here. [4]
   <NME> Jabes the Male Kagonesti is standing here. (aggressor) (flying)
   <NME> Reynan Payne, Pugilist of Krynn is standing here. (aggressor)
   (flying)
   (white aura)
   <NME> Onirf Dareshoomin is standing here. (aggressor) (flying)
   (invisible)
   . . . emits an eerie glow.
   A fearsome blue dragon, Neurominion, is standing here, ignoring you.
   <VA> Marusaki the Male Hylar Dwarf is standing here. (flying)
   <VA> Aglarel, Red Shirt Mage is standing here. (flying) (invisible)
   . . . is surrounded by 3 shimmering spheres.
   628H 142V 3404674X 8.90% 4384C Exits:NE>
   Reynan gives Aglarel a solid punch in the face.
   628H 142V 3404674X 8.90% 4384C Exits:NE> ki
   Onirf closes the door.
   Reynan crashes into Aglarel in a thundering collision, knocking him to
   the
   ground!
   628H 142V 3404674X 8.90% 4384C Exits:(N)E>
   Jabes takes aim at you.
   628H 142V 3404674X 8.90% 4384C Exits:(N)E> ki jab
   Marusaki gives Jabes a solid punch in the face.
   628H 142V 3404674X 8.90% 4384C Exits:(N)E> ki jabes
   You slash Jabes hard.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:V.Good]
   Exits:(N)E>
   Marusaki crashes into Jabes in a thundering collision, knocking him to
   the
   ground!
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Good]
   Exits:(N)E>
   Onirf focuses harshly on Aglarel and utters some strange words.
   Onirf calls forth some dark and file spirits and sends them at Aglarel!
   Onirf slowly fades into existence.
   Onirf's spell misses Aglarel and destroys a sphere instead.
   Onirf's spell misses Aglarel and destroys a sphere instead.
   Aglarel screams in pain as a vile spirit tears into his flesh.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Good]
   Exits:(N)E> im
   You massacre Jabes with your slash.
   You pierce Jabes extremely hard.
   Marusaki slashes Jabes very hard.
   Jabes misses Marusaki with his hit.
   Reynan slashes Aglarel extremely hard.
   Aglarel bludgeons Reynan hard.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Good]
   Exits:(N)E> im
   After lightning fast
   strikes from your sword, Jabes is wheeling to regain his balance.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Good]
   Exits:(N)E>
   Onirf utters some strange words.
   Onirf's wounds begin to heal.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Good]
   Exits:(N)E> o d
   You massacre Jabes with your slash.
   You massacre Jabes with your pierce.
   Marusaki misses Jabes with his slash.
   Jabes misses Marusaki with his hit.
   Aglarel wavers under Reynan's mighty slash!
   Reynan slashes Aglarel very hard.
   Aglarel misses Reynan with his bludgeon.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E> o dragon swoop jabes
   gaz
   Aglarel stands up.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E> gaz
   Reynan delivers a quick snap kick to Aglarel. Aglarel staggers and
   tries to
   recover.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E>
   Aglarel utters some strange words.
   Aglarel unleashes a wave of crippling power!
   Onirf slumps her shoulders and appears crippled, weak.
   Marusaki crashes into Jabes in a thundering collision, knocking him to
   the
   ground!
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E> Neurominion the
   fearsome blue dragon swoops at Jabes.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E> You gaze at Jabes
   with pathetic amount of evilness.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E>
   Neurominion the fearsome blue dragon claws Jabes extremely hard.
   Onirf bludgeons Aglarel extremely hard.
   You massacre Jabes with your slash.
   You pierce Jabes extremely hard.
   Marusaki massacres Jabes with his slash.
   Jabes misses Marusaki with his hit.
   Reynan slashes Aglarel hard.
   Reynan slashes Aglarel hard.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E>
   Onirf focuses on Jabes and utters some strange words.
   Jabes's wounds begin to heal.
   628H 142V 3404674X 8.90% 4384C [Marusaki:Perfect] [Jabes:Fair]
   Exits:(N)E> gaz onirf
   Reynan heroically rescues Jabes.
   628H 142V 3404674X 8.90% 4384C [Jabes:Fair] Exits:(N)E> You gaze at
   Onirf with all the
   evilness you can muster.
   Onirf is paralyzed!
   628H 142V 3404674X 8.90% 4384C [Jabes:Fair] Exits:(N)E>
   You return to your normal fighting style.
   Marusaki slashes Reynan extremely hard.
   Marusaki deflects part of Reynan's blow with his shield.
   Reynan slashes Marusaki very hard.
   Neurominion the fearsome blue dragon claws Jabes very hard.
   Neurominion the fearsome blue dragon claws Jabes hard.
   You massacre Jabes with your slash.
   You pierce Jabes extremely hard.
   Aglarel misses Reynan with his bludgeon.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Fair]
   Exits:(N)E>
   Aglarel focuses harshly on Reynan and utters some strange words.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   BOOM! Aglarel's force missile explodes on contact, blasting Jabes!
   Reynan screams in horror and pain as Aglarel's force missile explodes!
   BOOM! Aglarel's force missile explodes on contact, blasting Onirf!
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Fair]
   Exits:(N)E> im
   Marusaki gives Jabes a solid punch in the face.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Bad]
   Exits:(N)E>
   Marusaki stumbles and falls while trying to bash Jabes.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Bad]
   Exits:(N)E>
   Reynan delivers a quick snap kick to Marusaki. Marusaki staggers and
   tries to
   recover.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Bad]
   Exits:(N)E> Jabes misses Neurominion the fearsome blue dragon with his
   hit.
   Marusaki slashes Reynan hard.
   Marusaki deflects part of Reynan's blow with his shield.
   Reynan slashes Marusaki extremely hard.
   Reynan slashes Marusaki extremely hard.
   Neurominion the fearsome blue dragon barely claws Jabes.
   Neurominion the fearsome blue dragon claws Jabes very hard.
   You massacre Jabes with your slash.
   You pierce Jabes extremely hard.
   After lightning fast strikes from your sword, Jabes is wheeling to
   regain his
   balance.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Fair]
   Exits:(N)E> th
   Aglarel focuses harshly on Reynan and utters some strange words.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   Aglarel grins as his force missile crashes into Reynan.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Fair]
   Exits:(N)E> thr
   Neurominion the fearsome blue dragon stands up.
   Your eyes tingle as a sense of darkness returns to you.
   Jabes misses Neurominion the fearsome blue dragon with his hit.
   Marusaki slashes Reynan extremely hard.
   Reynan massacres Marusaki with his slash.
   Neurominion the fearsome blue dragon claws Jabes hard.
   Neurominion the fearsome blue dragon claws Jabes very hard.
   You massacre Jabes with your slash.
   You massacre Jabes with your pierce.
   Reynan utters the words, 'hear'.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:Bad]
   Exits:(N)E> Your precision thrust connects, leaving Jabes bleeding and
   hurt.
   Reynan gives Aglarel a solid punch in the face.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:V.Bad]
   Exits:(N)E>
   Reynan crashes into Aglarel in a thundering collision, knocking him to
   the
   ground!
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:V.Bad]
   Exits:(N)E> dra
   Jabes stands up.
   628H 142V 3404674X 8.90% 4384C [Neurominion the fearsome blue
   dragon:Perfect] [Jabes:V.Bad]
   Exits:(N)E> dra
   Jabes stops using a dusted red bow.
   Jabes grabs a glowing scroll of recall.
   Jabes recites a glowing scroll of recall.
   Jabes disappears.
   628H 142V 3404674X 8.90% 4384C Exits:(N)E> dra
   Marusaki misses Reynan with his slash.
   Reynan massacres Marusaki with his slash.
   Aglarel bludgeons Reynan hard.
   628H 142V 3404674X 8.90% 4384C Exits:(N)E> resc a
   Marusaki stands up.
   628H 142V 3404674X 8.90% 4384C Exits:(N)E> resc aglarel
   What a self-sacrificing act! You're such a
   hero!
   You massacre Onirf with your slash.
   628H 142V 3404674X 8.90% 4384C [Bitkioladaieo:Perfect] [Onirf:V.Good]
   Exits:(N)E>
   Marusaki stumbles and falls while trying to bash Reynan.
   628H 142V 3404674X 8.90% 4384C [Bitkioladaieo:Perfect] [Onirf:V.Good]
   Exits:(N)E> gt
   Onirf massacres YOU with her bludgeon.
   You massacre Onirf with your slash.
   You pierce Onirf extremely hard.
   Marusaki slashes Reynan extremely hard.
   Reynan misses Marusaki with his slash.
   Aglarel misses Reynan with his bludgeon.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> gt onirf
   Onirf stands up.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> gt onirf
   Aglarel stands up.
   Reynan crashes into Marusaki in a thundering collision, knocking him to
   the
   ground!
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> gt onirf i
   Onirf utters some strange words.
   Onirf's wounds begin to heal.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> gt onirf is
   Aglarel focuses harshly on Reynan and utters some strange words.
   Aglarel unleashes tendrils of electricity at Reynan, electrocuting him.
   A thick dwarven bracelet in use by Reynan is destroyed.
   Reynan's fists start to glow with an electric charge.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> gt onirf is , was parad
   You slash Onirf extremely hard.
   You miss Onirf with your pierce.
   Reynan blocks Marusaki's blow with a quick raise of his shield.
   Reynan massacres Marusaki with his slash.
   Reynan shudders as electricity shocks him.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E> gaz
   imYou tell your
   group 'onirf is , was parad'
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E> im
   You gaze at
   Onirf with all the evilness you can muster.
   The magic fails!
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E>
   Aglarel focuses harshly on Reynan and utters some strange words.
   Aglarel unleashes tendrils of electricity at Reynan, electrocuting him.
   605H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E>
   Onirf massacres YOU with her bludgeon.
   You slash Onirf extremely hard.
   Onirf dodges your attack!
   Marusaki misses Reynan with his slash.
   Reynan slashes Marusaki very hard.
   Reynan shudders as electricity shocks him.
   576H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E>
   Reynan delivers a vicious kick to Marusaki's face. Blood flies as his
   head snaps
   back.
   576H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E> After
   lightning fast strikes from your sword, Onirf is wheeling to regain her
   balance.
   576H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E>
   Aglarel focuses harshly on Reynan and utters some strange words.
   Aglarel aims a magic missile at Reynan, who staggers under the blow.
   Aglarel aims a magic missile at Reynan, who staggers under the blow.
   Aglarel aims a magic missile at Reynan, who staggers under the blow.
   Aglarel aims a magic missile at Reynan, who staggers under the blow.
   Aglarel aims a magic missile at Reynan, who staggers under the blow.
   576H 142V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E>
   Your muscles swell, you are ready for another thrust.
   Onirf massacres YOU with her bludgeon.
   You massacre Onirf with your slash.
   You pierce Onirf extremely hard.
   Reynan wavers under Marusaki's mighty slash!
   Marusaki slashes Reynan extremely hard.
   Reynan bruises Marusaki with his slash.
   Reynan shudders as electricity shocks him.
   Your eyes tingle as a sense of darkness returns to you.
   You are hungry.
   You are thirsty.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E> gaze rey
   Marusaki stands up.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:V.Good]
   Exits:(N)E> gaze reynan
   Marusaki gives Onirf a solid punch in the face.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E>
   Marusaki crashes into Onirf in a thundering collision, knocking her to
   the
   ground!
   Reynan utters the words, 'pzar'.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E>
   Reynan stops using a stone rose.
   Reynan grabs a glowing scroll of recall.
   Reynan recites a glowing scroll of recall.
   Reynan disappears.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> You couldn't
   find what you were looking for.
   576H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Good]
   Exits:(N)E> ga
   Onirf massacres YOU with her bludgeon.
   Onirf wavers under your mighty slash!
   You massacre Onirf with your slash.
   You massacre Onirf with your pierce.
   550H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Good]
   Exits:(N)E> gaz
   You gaze at Onirf
   with all the evilness you can muster.
   The magic fails!
   550H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Good]
   Exits:(N)E> im
   Aglarel slowly fades into existence.
   Aglarel misses Onirf with his bludgeon.
   550H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Good]
   Exits:(N)E>
   You return to your normal fighting style.
   Aglarel bludgeons Onirf hard.
   Onirf massacres YOU with her bludgeon.
   You massacre Onirf with your slash.
   You massacre Onirf with your pierce.
   525H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Fair]
   Exits:(N)E> After lightning
   fast strikes from your sword, Onirf is wheeling to regain her balance.
   525H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Fair]
   Exits:(N)E> thr
   Marusaki crashes into Onirf in a thundering collision, knocking her to
   the
   ground!
   525H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Fair]
   Exits:(N)E>
   Marusaki slashes Onirf extremely hard.
   Aglarel bludgeons Onirf very hard.
   Onirf massacres YOU with her bludgeon.
   You massacre Onirf with your slash.
   You pierce Onirf extremely hard.
   497H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:V.Bad]
   Exits:(N)E>
   Aglarel focuses harshly on Onirf and utters some strange words.
   The sound of bones cracking echoes as Aglarel's force bolt slams into
   Onirf.
   There is a bright flash as Aglarel's force bolt explodes in Onirf's
   face!
   497H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:V.Bad]
   Exits:(N)E> Onirf slides out
   of the way of your uninspired thrust.
   497H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:V.Bad]
   Exits:(N)E> 'die moth fuc
   Your eyes tingle as a sense of darkness returns to you.
   Marusaki massacres Onirf with his slash.
   Onirf massacres YOU with her bludgeon.
   You massacre Onirf with your slash.
   You miss Onirf with your pierce.
   473H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Awful]
   Exits:(N)E> 'die moth fuck ass
   You say 'die moth
   fuck ass'
   473H 178V 3404674X 8.90% 4384C [Bitkioladaieo:Good] [Onirf:Awful]
   Exits:(N)E> drain
   You draw a bit of
   mojo from Onirf and add it to yourself.
   Onirf spasms as you place your hand on her chest and drain her
   life-force.
   573H 178V 3404674X 8.90% 4384C [Bitkioladaieo:V.Good] [Onirf:Awful]
   Exits:(N)E>
   Marusaki gives Onirf a solid punch in the face.
   Onirf's head cracks open and she drops to the ground.
   You receive 0 experience.
   Onirf is dead! R.I.P.
   573H 178V 3404674X 8.90% 4384C [Onirf:Dying] Exits:(N)E>
   The death cry of Onirf echoes from somewhere nearby...
   Reynan stops following Onirf.
   Jabes stops following Onirf.
   573H 178V 3404674X 8.90% 4384C Exits:(N)E>
   Marusaki gets a small pile of coins from the corpse of Onirf.
   573H 178V 3404674X 8.90% 4384C Exits:(N)E>
   Marusaki divides 3 coins equally among the group members present.
   573H 178V 3404674X 8.90% 4385C Exits:(N)E>
   Marusaki gets a crude bone staff from the corpse of Onirf.
   Marusaki gets a grey leather bracer from the corpse of Onirf.
   Marusaki gets a glowing bracer from the corpse of Onirf.
   Marusaki gets a leather traveling pack from the corpse of Onirf.
   Marusaki gets a blood stained robe from the corpse of Onirf.
   Marusaki gets spun silver sleeves from the corpse of Onirf.
   Marusaki gets a pair of spiked gloves from the corpse of Onirf.
   Marusaki gets spun silver leggings from the corpse of Onirf.
   Marusaki gets a suit of gold runed armor from the corpse of Onirf.
   Marusaki gets a necklace of draconian teeth from the corpse of Onirf.
   Marusaki gets a necklace of draconian teeth from the corpse of Onirf.
   Marusaki gets a spun silver ring from the corpse of Onirf.
   Marusaki gets a ring of enlightenment from the corpse of Onirf.
   Marusaki gets a sapphire crystal from the corpse of Onirf.
   Marusaki gets a glowing scroll of recall from the corpse of Onirf.
   Marusaki gets a scroll of identify from the corpse of Onirf.
   Marusaki gets a bone flute from the corpse of Onirf.
   Marusaki gets a platinum etched lance from the corpse of Onirf.
   573H 178V 3404674X 8.90% 4385C Exits:(N)E> gt good deal
   You tell your group 'good deal'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2992.html?option=forums&action=displaythread&threadid=2992
