   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   The worst zone of Arctic

   (*) Castle Uth Wistan
   ( ) Caverns of Thorbardin
   ( ) High Clerist Tower
   ( ) Icewall Castle
   ( ) Citadel of Dracos
   ( ) Land of the Umber Hulks
   ( ) Theiwar
   ( ) Celestial Temple
   ( ) Dun Mir
   ( ) Sanction
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   When did myth start getting shinies ?
   [26]View Comments (9)

   POV: AM

   Log Rating: 0.1111

   Some fun.

   333H 164V 8601789X 109C Mem:1 Exits:NESW>
   Winnemucca flies west.
   The demon Marilith leaves west.
   The corpse of a patrolling knight of the Rose flies west.
   You follow Winnemucca west.
   A tiny faerie flies in from the east.
   The Halls of Myth
   Hanging from the center of a gold crown molded ceiling is a large
   chandelier burning a beautiful red flame. The flame is the result of
   the
   burning of sodium and some other select chemical compounds, secret to
   the
   pyromancers of Deep Mine. A servant seems to be dusting the ceiling and
   walls on a small step stool. This job must need to be done with some
   regularity, as the adventurers who frequent this stronghold track in
   copious amounts of debris.
   You notice some bloody footprints on the ground.
   A tiny, shimmering faerie hovers near you.
   The corpse of a patrolling knight of the Rose is here, slowly
   animating. (flying)
   The Demon Marilith is here, writhing its snake-like tail.
   <AM> Winnemucca the Male Kagonesti is standing here. (flying)
   <AM> Arconna the Male Minotaur is standing here, fighting Kurosaki.
   (flying)
   <Myth> Kurosaki Ichigo, Death God Substitute is sitting here, fighting
   Arconna. (flying)
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Good**]
   Mem:1 Exits:E>
   Kurosaki stands up.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Good**]
   Mem:1 Exits:E> c 'para'
   Winnemucca focuses harshly on Kurosaki and utters some strange words.
   Kurosaki freezes in place.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Good**]
   Mem:1 Exits:E>
   Arconna cleaves Kurosaki hard.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Good**]
   Mem:1 Exits:E>
   Who should the spell be cast upon?
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Good**]
   Mem:1 Exits:E> c 'fire' k
   Winnemucca gives the corpse of a patrolling knight of the Rose an
   order.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Good**] Mem:1
   Exits:E> u
   Winnemucca gives the demon Marilith an order.
   The demon Marilith hits Kurosaki hard.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Good**] Mem:1
   Exits:E> r
   Winnemucca focuses harshly on Kurosaki and utters some strange words.
   Kurosaki cries out in pain as Winnemucca grabs him.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Good**] Mem:1
   Exits:E> osaki
   Arconna yells a battle cry and fights like a madman!
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Good**] Mem:1
   Exits:E> You utter the words, 'fire storm'
   Kurosaki is crushed by a wall of fire.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Fair**] Mem:2
   Exits:E>
   The demon Marilith barely hits Kurosaki.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   Arconna cleaves Kurosaki extremely hard.
   Arconna cleaves Kurosaki extremely hard.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Fair**] Mem:2
   Exits:E> !
   The demon Marilith gives Kurosaki a solid punch in the face.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Fair**] Mem:2
   Exits:E>
   Winnemucca focuses harshly on Kurosaki and utters some strange words.
   Kurosaki cries out in pain as Winnemucca grabs him.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Bad**] Mem:2
   Exits:E> The demon Marilith hits Kurosaki.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   Arconna cleaves Kurosaki hard.
   Arconna cleaves Kurosaki very hard.
   With a crazed scream, Arconna jumps into the fray and attacks like a
   wild person.
   Arconna's blow glances off Kurosaki's skull.
   You utter the words, 'fire storm'
   Kurosaki is crushed by a wall of fire.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:V.Bad**] Mem:3
   Exits:E> !
   Winnemucca focuses harshly on Kurosaki and utters some strange words.
   Kurosaki cries out in pain as Winnemucca grabs him.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Awful**] Mem:3
   Exits:E>
   The demon Marilith hits Kurosaki hard.
   The corpse of a patrolling knight of the Rose massacres Kurosaki with
   his hit.
   The corpse of a patrolling knight of the Rose hits Kurosaki extremely
   hard.
   Arconna cleaves Kurosaki extremely hard.
   Arconna cleaves Kurosaki extremely hard.
   Kurosaki is mortally wounded, and will die soon, if not aided.
   333H 163V 8601789X 109C [**Arconna:V.Good**] [**Kurosaki:Awful**] Mem:3
   Exits:E> You utter the words, 'fire storm'
   Your wall of flames crushes Kurosaki, who barely utters a death cry.
   You receive 0 experience.
   Kurosaki is dead! R.I.P.
   333H 163V 8601789X 109C [Kurosaki:Dying] Mem:3 Exits:E>
   You stop watching Arconna.
   333H 163V 8601789X 109C [Kurosaki:Dying] Mem:3 Exits:E>
   The death cry of Kurosaki echoes from somewhere nearby...
   Arconna gets a very large pile of coins from the corpse of Kurosaki.
   333H 163V 8601789X 109C Mem:3 Exits:E>
   Arconna is zapped by a queen's rapier and instantly drops it.
   Arconna gets a heavy steel battle axe from the corpse of Kurosaki.
   Arconna gets a granite bracer from the corpse of Kurosaki.
   Arconna gets a mithril bracelet from the corpse of Kurosaki.
   Arconna gets a long golden cloak from the corpse of Kurosaki.
   Arconna gets a pair of ebony engraved bracers from the corpse of
   Kurosaki.
   Arconna gets a pair of spiked sterling gauntlets from the corpse of
   Kurosaki.
   Arconna gets a skirt of tasses from the corpse of Kurosaki.
   Arconna gets a spired silver helm from the corpse of Kurosaki.
   Arconna gets a suit of charred black battle armor from the corpse of
   Kurosaki.
   Arconna gets a diamond inlaid choker from the corpse of Kurosaki.
   Arconna gets an amulet of darkness from the corpse of Kurosaki.
   Arconna gets a gargoyle ring from the corpse of Kurosaki.
   Arconna gets a gargoyle ring from the corpse of Kurosaki.
   Arconna gets a brewed potion from the corpse of Kurosaki.
   Arconna gets an entire loaf of bread from the corpse of Kurosaki.
   Arconna gets an entire loaf of bread from the corpse of Kurosaki.
   Arconna gets a large waterskin from the corpse of Kurosaki.
   Arconna gets a large waterskin from the corpse of Kurosaki.
   Arconna gets a large waterskin from the corpse of Kurosaki.
   333H 163V 8601789X 109C Mem:3 Exits:E> get all corpse
   get all
   Winnemucca gets a large waterskin from the corpse of Kurosaki.
   Winnemucca gets a large waterskin from the corpse of Kurosaki.
   Winnemucca gets a thin gold necklace from the corpse of Kurosaki.
   Winnemucca gets a mug of firebreather from the corpse of Kurosaki.
   Winnemucca gets a hooded lantern from the corpse of Kurosaki.
   Winnemucca gets a milky potion of see invisible from the corpse of
   Kurosaki.
   Winnemucca gets a milky potion of see invisible from the corpse of
   Kurosaki.
   Winnemucca gets a glowing scroll of recall from the corpse of Kurosaki.
   Winnemucca gets a glowing scroll of recall from the corpse of Kurosaki.
   Winnemucca gets a small wooden chest from the corpse of Kurosaki.
   Winnemucca gets a small wooden chest from the corpse of Kurosaki.
   Winnemucca gets a small wooden chest from the corpse of Kurosaki.
   333H 170V 8601789X 109C Mem:2 Exits:E>
   Winnemucca is zapped by a queen's rapier and instantly drops it.
   333H 170V 8601789X 109C Mem:2 Exits:E> The corpse doesn't seem to have
   what you are looking for.
   333H 170V 8601789X 109C Mem:2 Exits:E> You get a queen's rapier.
   You get the corpse of Kurosaki.
   333H 170V 8601789X 109C Mem:2 Exits:E>
   Winnemucca gives the corpse of a patrolling knight of the Rose an
   order.
   333H 170V 8601789X 109C Mem:2 Exits:E>
   Winnemucca tells your clan 'owow'
   333H 170V 8601789X 109C Mem:2 Exits:E> rofl
   You roll on the floor in a fit of laughter.
   333H 170V 8601789X 109C Mem:2 Exits:E> who
   Winnemucca tells your clan 'uber'
   333H 170V 8601789X 109C Mem:2 Exits:E> kur
   Winnemucca flies east.
   The demon Marilith leaves east.
   Arconna flies east.
   The corpse of a patrolling knight of the Rose flies east.
   You follow Winnemucca east.
   A tiny faerie flies in from the west.
   The Halls of Myth
   You have entered a small room, containing only a desk, a registration
   book, and a small wooden chest with a slot carved in the top. There is
   a
   sign above the desk requesting all Clan members to please sign the
   registration book before heading to the bar and rooms, and to leave the
   correct amount of steel in the wooden box. You can hear laughter and
   bragging
   from your Clanmates in the bar to the left. Clearly there has been some
   great victory requiring celebration. To the right you hear snores, most
   likely from the Clanmates who can't hold their liquor.
   You notice some bloody footprints on the ground.
   A tiny, shimmering faerie hovers near you.
   The corpse of a patrolling knight of the Rose is here, slowly
   animating. (flying)
   <AM> Arconna the Male Minotaur is standing here. (flying)
   The Demon Marilith is here, writhing its snake-like tail.
   <AM> Winnemucca the Male Kagonesti is standing here. (flying)
   <Myth> Kurosaki Ichigo, Death God Substitute is standing here.
   The stronghold's innkeeper is standing here, giving you a suspicious
   look.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2856.html?option=forums&action=displaythread&threadid=2856
