<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   How many times have you been spooned by another Arctic player?

   (*) 0
   ( ) 1
   ( ) 2-5
   ( ) 5-10
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   The aftermath

   POV: Torqe

   Log Rating: -0.4285

   They got a decent set from julius. But i think we did good in
   regrouping before they could leave town. Sucks shlomo's bitch ass got
   away!

   412H 78V 1X 0.79% 680C Mem:6 Exits:NES> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   <Apoc> Shlomo, the Hammer is standing here. (flying) (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   <Apoc> Kylar the Male Human is standing here. (flying)
   . . . has a tough exterior.
   Borz the Male Kagonesti is standing here. (flying)
   The master healer stands here, radiating goodness and power.
   Looking south:
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   412H 78V 1X 0.79% 680C Mem:6 Exits:NES> s
   Below you a floorboard creaks loudly, warped with age.
   The Guild Hall
   A singing, happy dwarf stumbles along drunkenly.
   412H 77V 1X 0.79% 680C Mem:6 Exits:NSW> s
   The Solace Adventurer's Guild
   The mutilated corpse of Julius is lying here.
   A long leather cape colored dark and gold lies here.
   The corpse of Oshkosh the fearsome blue dragon is lying here.
   The corpse of Trent the fearsome blue dragon is lying here.
   The corpse of Truar is lying here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   The guild guard stands here guarding the adventurer's guild.
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> grou
   Your group of 7 members consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 6
   Tyler perfect rested standing Y Y N Y 1 4
   Fifty v.good fatigued standing Y Y Y Y 0 2
   Rebif perfect rested standing Y N N Y 0 0
   Baelron v.good fatigued standing Y N N Y 0 0
   Skipper perfect exhausted standing Y Y N Y 1 0
   Slam perfect fatigued standing Y N N Y 0 0
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> say bash shlomo
   You say 'bash shlomo'
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> !
   You say 'bash shlomo'
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> say and atari
   Tyler gets a black and gold cape.
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> say and atari
   You say 'and atari'
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> !
   You say 'and atari'
   412H 76V 1X 0.79% 680C Mem:6 Exits:NSD> n
   Below you a floorboard creaks loudly, warped with age.
   Tyler flies in from the south.
   Fifty flies in from the south.
   Oshkosh the fearsome blue dragon arrives from the south.
   Rebif flies in from the south.
   Baelron flies in from the south.
   Skipper flies in from the south.
   Slam flies in from the south.
   The Guild Hall
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   A singing, happy dwarf stumbles along drunkenly.
   412H 75V 1X 0.79% 680C Mem:6 Exits:NSW> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   The guild guard stands here guarding the adventurer's guild.
   Looking west:
   You see nothing special.
   The master warrior turns towards you, expectantly.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   412H 75V 1X 0.79% 680C Mem:6 Exits:NSW> n
   Tyler flies in from the south.
   Fifty flies in from the south.
   Oshkosh the fearsome blue dragon arrives from the south.
   Rebif flies in from the south.
   Baelron flies in from the south.
   Skipper flies in from the south.
   Slam flies in from the south.
   The Guild Hall
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   412H 74V 1X 0.79% 680C Mem:6 Exits:NES> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   <Apoc> Shlomo, the Hammer is standing here. (flying) (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   <Apoc> Kylar the Male Human is standing here. (flying)
   . . . has a tough exterior.
   Borz the Male Kagonesti is standing here. (flying)
   The master healer stands here, radiating goodness and power.
   Looking south:
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   412H 74V 1X 0.79% 680C Mem:6 Exits:NES> e
   Tyler flies in from the west.
   Fifty flies in from the west.
   Oshkosh the fearsome blue dragon arrives from the west.
   Rebif flies in from the west.
   Baelron flies in from the west.
   Skipper flies in from the west.
   Slam flies in from the west.
   The Temple of Healing Arts
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is standing here. (flying) (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   <Apoc> Kylar the Male Human is standing here. (flying)
   . . . is followed by a hovering ball of light.
   Borz the Male Kagonesti is standing here. (flying)
   The master healer stands here, radiating goodness and power.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> say bash it
   Atari begins resting but stays aloft.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> You say 'bash it'
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Baelron tells your group 'i have atari'
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Fifty gives Oshkosh the fearsome blue dragon an order.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Holdemup arrives from the west.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Baelron crashes into Kylar in a thundering collision, knocking him to
   the ground!
   412H 73V 1X 0.79% 680C Mem:4 Exits:W>
   Baelron massacres Kylar with his cleave.
   Kylar bludgeons Baelron extremely hard.
   Rebif misses Shlomo with his cleave.
   Rebif misses Shlomo with his cleave.
   Shlomo slowly fades into existence.
   Shlomo crushes Rebif very hard.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> watch
   Slam slashes Kylar extremely hard.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> watch
   Borz misses Baelron with his slash.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> watch shl
   Skipper takes aim at Shlomo.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> watch shlom
   Fifty slowly fades into existence.
   Fifty stabs Kylar extremely hard.
   412H 73V 1X 0.79% 680C Mem:4 Exits:W> watch shlomo
   You now watch Shlomo.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Slam crashes into Kylar in a thundering collision, knocking him to the
   ground!
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Fifty stabs Kylar extremely hard.
   Fifty slashes Kylar hard.
   Fifty stabs Kylar hard.
   Borz misses Baelron with his slash.
   Slam slashes Kylar extremely hard.
   Slam slashes Kylar very hard.
   Baelron massacres Kylar with his cleave.
   Kylar bludgeons Baelron very hard.
   Rebif massacres Shlomo with his cleave.
   Rebif misses Shlomo with his cleave.
   Shlomo misses Rebif with his crush.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Atari stands up.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Skipper takes aim at Kylar.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Skipper massacres Kylar with a plunk.
   Skipper slowly fades into existence.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Borz swings madly at Baelron with a massive black rune-covered sword,
   knocking him to the ground.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Atari focuses on Kylar and utters the words, 'heal'.
   Atari heals Kylar.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Fifty gives Oshkosh the fearsome blue dragon an order.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Tyler focuses on Baelron and utters the words, 'regenerate'.
   Baelron's wounds begin to heal.
   412H 73V 1X 0.79% 680C [**Shlomo:V.Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> sa
   Fifty stabs Kylar very hard.
   Fifty slashes Kylar hard.
   Borz slashes Baelron extremely hard.
   Slam slashes Kylar very hard.
   Baelron cleaves Kylar extremely hard.
   Kylar misses Baelron with his bludgeon.
   Rebif massacres Shlomo with his cleave.
   Shlomo crushes Rebif very hard.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> say b
   Shlomo stands up.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> say bash ata
   Kylar steps aside as Slam attempts a bash, stumbles, and falls flat on
   his face.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> say bash atari
   You say 'bash atari'
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Skipper massacres Kylar with a plunk.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W>
   Fifty attacks Kylar with lightning fast series of attacks that leaves
   him defenseless.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> grou
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 4
   Tyler perfect rested standing Y Y N Y 1 3
   Fifty v.good fatigued fighting Y N Y Y 0 1
   Rebif v.good rested fighting Y N N Y 0 0
   Baelron v.good fatigued fighting Y N N Y 0 0
   Skipper perfect exhausted standing Y Y N Y 1 0
   Slam perfect fatigued fighting Y N N Y 0 0
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> w
   Atari focuses on Kylar and utters the words, 'word of recall'.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> wat
   Skipper misses Kylar with his shot.
   Skipper slowly fades into existence.
   Fifty stabs Kylar extremely hard.
   Fifty slashes Kylar hard.
   Borz massacres Baelron with his slash.
   Slam slashes Kylar extremely hard.
   Baelron massacres Kylar with his cleave.
   Kylar bludgeons Baelron extremely hard.
   Rebif's mightly cleave almost cuts Shlomo in two.
   Rebif massacres Shlomo with his cleave.
   Shlomo misses Rebif with his crush.
   412H 73V 1X 0.79% 680C [**Shlomo:Good**] [**Rebif:V.Good**] Mem:4
   Exits:W> watch rebif
   You now watch Rebif.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W> #TICK-10
   Baelron stands up.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W> l
   The Temple of Healing
   Arts
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is sitting here, fighting Kylar.
   (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Kylar. (flying)
   <FURY> Rebif, Interferon Beta is standing here, fighting Shlomo.
   (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here, fighting Kylar. (flying)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is sitting here, fighting Rebif. (flying)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   <Apoc> Kylar the Male Human is sitting here, fighting Baelron. (flying)
   . . . is followed by a hovering ball of light.
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Fifty gazes at Kylar with a look of evilness.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Skipper massacres Kylar with a plunk.
   Skipper slowly fades into existence.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Baelron crashes into Kylar in a thundering collision, knocking him to
   the ground!
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Borz yells a battle cry and fights like a madman!
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Fifty stabs Kylar extremely hard.
   Fifty slashes Kylar very hard.
   Borz slashes Baelron extremely hard.
   Borz misses Baelron with his slash.
   Slam massacres Kylar with his slash.
   Baelron massacres Kylar with his cleave.
   Kylar bludgeons Baelron very hard.
   Rebif massacres Shlomo with his cleave.
   Rebif gracefully steps aside as Shlomo attacks!
   Atari focuses on Kylar and utters the words, 'heal'.
   Atari heals Kylar.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Shlomo stands up.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Good**] Mem:4
   Exits:W>
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W>
   Skipper massacres Kylar with a plunk.
   Skipper slowly fades into existence.
   Slam stands up.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W>
   Kylar steps aside as Slam attempts a bash, stumbles, and falls flat on
   his face.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W> grou
   Skipper massacres Kylar with a plunk.
   Skipper slowly fades into existence.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W> Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 4
   Tyler perfect rested standing Y Y N Y 1 3
   Fifty v.good fatigued fighting Y N Y Y 0 1
   Rebif v.good rested fighting Y N N Y 0 0
   Baelron v.good fatigued fighting Y N N Y 0 0
   Skipper perfect exhausted standing Y Y N Y 1 0
   Slam perfect fatigued fighting Y N N Y 0 0
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W>
   Borz rushes forward and lets fly a barbaric YAWP.
   Kylar screams and enters a frenzy, lusting for blood.
   412H 73V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:4
   Exits:W>
   Fifty stabs Kylar hard.
   Fifty slashes Kylar hard.
   Borz misses Baelron with his slash.
   Slam slashes Kylar extremely hard.
   Baelron cleaves Kylar very hard.
   Kylar bludgeons Baelron extremely hard.
   Rebif massacres Shlomo with his cleave.
   Shlomo massacres Rebif with his crush.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Borz charges at Baelron, but he managed to move away.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Fifty panics, and attempts to flee.
   Fifty flies west.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Skipper magically creates some arrows.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Fifty flies in from the west.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say
   Skipper massacres Kylar with a plunk.
   Skipper slowly fades into existence.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say we can out #TICK!!!
   say we can out he
   Kylar steps aside as Baelron attempts a bash, stumbles, and falls flat
   on his face.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say we can out heal them
   You say 'we can out heal
   them'
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say
   Borz massacres Baelron with his slash.
   Slam slashes Kylar very hard.
   Baelron cleaves Kylar extremely hard.
   Kylar massacres Baelron with his bludgeon.
   Rebif cleaves Shlomo extremely hard.
   Rebif gracefully steps aside as Shlomo attacks!
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say kee
   Fifty slowly fades into existence.
   Fifty stabs Kylar very hard.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say keep ba
   Skipper plunks Kylar extremely hard.
   Skipper slowly fades into existence.
   Kylar stands up.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say keep bashi
   Kylar panics, and attempts to flee.
   Kylar flies west.
   Shlomo stands up.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say keep bashing
   You say 'keep bashing'
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Slam stands up.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l w
   You see nothing special.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l
   The Temple of Healing
   Arts
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Fifty Percent Pain is standing here. (flying)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is sitting here. (flying)
   <FURY> Rebif, Interferon Beta is standing here, fighting Shlomo.
   (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is sitting here, fighting Rebif. (flying)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Borz massacres Baelron with his slash.
   Rebif massacres Shlomo with his cleave.
   Shlomo crushes Rebif extremely hard.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> grou
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 2
   Fifty perfect rested standing Y Y Y Y 0 1
   Rebif v.good rested fighting Y N N Y 0 0
   Baelron good rested fighting Y N N Y 0 0
   Skipper perfect fatigued standing Y Y N Y 1 0
   Slam perfect rested standing Y N N Y 0 0
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> kil shlomo
   But it's so peaceful
   here!
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Skipper takes aim at Atari.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Sunn has lost his link.
   Sunn has reconnected.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Baelron stands up.
   412H 112V 1X 0.79% 680C [**Rebif:V.Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Baelron massacres Borz with his cleave.
   Borz misses Baelron with his slash.
   Borz misses Baelron with his slash.
   Rebif misses Shlomo with his cleave.
   Shlomo crushes Rebif very hard.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Tyler focuses on Baelron and utters the words, 'regenerate'.
   Baelron's wounds begin to heal.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> #TICK+10
   Shlomo stands up.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Sunn steps aside as Slam attempts a bash, stumbles, and falls flat on
   his face.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Atari focuses on Sunn and utters the words, 'heal'.
   Atari heals Sunn.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Slam slashes Sunn extremely hard.
   Sunn slowly fades into existence.
   Slam is chilled, as he swings at Sunn.
   Sunn massacres Slam with his slash.
   Baelron cleaves Borz extremely hard.
   Borz slashes Baelron extremely hard.
   Borz slashes Baelron extremely hard.
   Rebif misses Shlomo with his cleave.
   Shlomo crushes Rebif extremely hard.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Crash drops a green leather plate.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Skipper takes aim at Borz.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> g
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> grou
   Fifty slowly fades into existence.
   Fifty stabs Sunn extremely hard.
   Fifty is chilled, as she swings at Sunn.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> grou
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 3
   Fifty v.good rested fighting Y N Y Y 0 1
   Rebif good rested fighting Y N N Y 0 0
   Baelron v.good rested fighting Y N N Y 0 0
   Skipper perfect fatigued standing Y N N Y 1 0
   Slam v.good rested fighting Y N N Y 0 0
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> huf
   Fifty stabs Sunn extremely hard.
   Fifty is chilled, as she swings at Sunn.
   Fifty slashes Sunn hard.
   Fifty is chilled, as she swings at Sunn.
   Slam slashes Sunn extremely hard.
   Slam is chilled, as he swings at Sunn.
   Sunn slashes Slam extremely hard.
   Baelron cleaves Borz extremely hard.
   Borz misses Baelron with his slash.
   Borz misses Baelron with his slash.
   Rebif cleaves Shlomo extremely hard.
   Shlomo misses Rebif with his crush.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> You huff.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say ba
   Skipper massacres Borz with a plunk.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say bash s
   Sunn panics, and attempts to flee.
   Sunn flies west.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say bash su
   Shlomo stands up.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say bash sunn
   Rebif crashes into Shlomo in a thundering collision, knocking him to
   the ground!
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> say bash sunn too
   You say 'bash sunn too'
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   Slam stands up.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l w
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Borz gracefully steps aside as Baelron attacks!
   Borz massacres Baelron with his slash.
   Borz misses Baelron with his slash.
   Rebif massacres Shlomo with his cleave.
   Shlomo massacres Rebif with his crush.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l
   The Temple of Healing Arts
   A plate bearing the insignia of the Green Dragonarmy is here.
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here, fighting Shlomo.
   (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is sitting here, fighting Rebif. (flying)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l w
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> l w
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> w a
   Borz charges at Baelron, but he managed to move away.
   412H 112V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Fair**] Mem:3
   Exits:W> sThe Guild Hall
   A singing, happy dwarf stumbles along drunkenly.
   412H 111V 1X 0.79% 680C Mem:4 Exits:NES> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here, fighting Shlomo.
   (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is sitting here, fighting Rebif. (flying)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   412H 111V 1X 0.79% 680C Mem:4 Exits:NES> e
   The Temple of Healing Arts
   A plate bearing the insignia of the Green Dragonarmy is here.
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here, fighting Shlomo.
   (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <Apoc> Shlomo, the Hammer is sitting here, fighting Rebif. (flying)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Bad**] Mem:3
   Exits:W> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   A singing, happy dwarf stumbles along drunkenly.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Bad**] Mem:3
   Exits:W> grou
   Your group of 7 members
   consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 3
   Fifty v.good rested standing Y Y Y Y 0 1
   Rebif good rested fighting Y N N Y 0 0
   Baelron v.good rested fighting Y N N Y 0 0
   Skipper perfect fatigued standing Y Y N Y 1 0
   Slam good rested standing Y N N Y 0 0
   412H 110V 1X 0.79% 680C [**Rebif:Good**] [**Shlomo:Bad**] Mem:3
   Exits:W>
   Shlomo sinks gently to the ground.
   Shlomo stops using a papal cross.
   Shlomo grabs a glowing scroll of recall.
   Shlomo recites a glowing scroll of recall.
   Shlomo disappears.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> l
   The Temple of Healing Arts
   A plate bearing the insignia of the Green Dragonarmy is here.
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> say bas
   Baelron massacres Borz with his cleave.
   Borz misses Baelron with his slash.
   Borz misses Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> say bash borz
   You say 'bash borz'
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> l bo
   Atari focuses on Borz and utters the words, 'regenerate'.
   Borz's wounds begin to heal.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> l borz
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W> You see nothing
   special about him.
   Borz the young adult male kagonesti looks pretty hurt.
   Borz is using:
   <worn on finger> a copper dwarven ring
   <worn on finger> a carved ivory ring
   <worn around neck> a sapphire inlaid choker
   <worn around neck> a leather collar with small iron spikes
   <worn on hands> a pair of draconian gauntlets
   <worn about waist> a blood red captain's sash
   <worn around right wrist> a silver kingfisher band
   <worn around left wrist> a gold bracelet
   <used in both hands> a massive black rune-covered sword..it glows dimly
   412H 110V 1X 0.79% 680C [**Rebif:Good**] Mem:3 Exits:W>
   Tyler focuses on Rebif and utters the words, 'heal'.
   Tyler heals Rebif.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   Baelron massacres Borz with his cleave.
   Borz slashes Baelron very hard.
   Borz massacres Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> l
   The Temple of Healing Arts
   A plate bearing the insignia of the Green Dragonarmy is here.
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   A drunken dwarf arrives from the west.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Tyler looks at Borz.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper takes aim at Atari.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Baelron massacres Borz with his cleave.
   Borz misses Baelron with his slash.
   Borz misses Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper massacres Atari with a plunk.
   Skipper slowly fades into existence.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper takes aim at Borz.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Holdemup stops using a leather training cap.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> say well that
   was fun
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> say well that
   was fun
   You say 'well that was fun'
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> g
   Crash begins sleeping remaining aloft.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou
   Atari bludgeons Skipper hard.
   Baelron massacres Borz with his cleave.
   Borz misses Baelron with his slash.
   Borz misses Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou
   Your group of 7 members consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 4
   Fifty v.good rested standing Y Y Y Y 0 1
   Rebif v.good rested standing Y N N Y 0 0
   Baelron v.good rested fighting Y N N Y 0 0
   Skipper v.good fatigued fighting Y Y N Y 1 0
   Slam good rested standing Y N N Y 0 0
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Tyler focuses on Slam and utters the words, 'regenerate'.
   Slam's wounds begin to heal.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Crash awakens.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Holdemup now follows Borz.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper panics, and attempts to flee.
   Skipper flies west.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Crash stands up.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper flies in from the west.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Baelron cleaves Borz extremely hard.
   Borz massacres Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou
   Atari focuses on Borz and utters the words, 'regenerate'.
   Borz's wounds begin to heal.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou
   Your group of 7 members consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 4
   Fifty v.good rested standing Y Y Y Y 0 1
   Rebif v.good rested standing Y N N Y 0 0
   Baelron good rested fighting Y N N Y 0 0
   Skipper v.good fatigued standing Y N N Y 1 0
   Slam perfect rested standing Y N N Y 0 0
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Skipper takes aim at Atari.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Baelron misses Borz with his cleave.
   Borz misses Baelron with his slash.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> l
   Tyler looks at Borz.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> l
   The Temple of Healing Arts
   A plate bearing the insignia of the Green Dragonarmy is here.
   Something resembling a pearl has been left here.
   A pinch of powdered azurite is lying on the ground.
   A pinch of powdered graphite is lying on the ground.
   <FURY> Skipper Reppiks is standing here. (flying)
   A singing, happy dwarf stumbles along drunkenly.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   Holdemup the Male Kagonesti is standing here.
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here, fighting
   Borz. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <CAS> Crash, Ready for Anybody Who Wants Some is standing here.
   (flying)
   Atari, the Apex of the Vortex of the Future is standing here. (flying)
   Borz the Male Kagonesti is standing here, fighting Baelron. (flying)
   The master healer stands here, radiating goodness and power.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> l w
   You see nothing special.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> g
   Skipper takes aim at Borz.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou#TICK-10
   grou
   Skipper massacres Borz with a plunk.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> grou
   Your group of 7 members consists of:
   Member Hits Move Position Fly Inv Water Here Light Mem
   -----------------------------------------------------------------------
   ------
   Torqe perfect rested standing Y N Y Y 1 3
   Tyler perfect rested standing Y Y N Y 1 4
   Fifty v.good rested standing Y Y Y Y 0 1
   Rebif v.good rested standing Y N N Y 0 0
   Baelron good rested fighting Y N N Y 0 0
   Skipper v.good fatigued standing Y N N Y 1 0
   Slam perfect rested standing Y N N Y 0 0
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Atari begins resting but stays aloft.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> a
   Crash disappears suddenly.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W>
   Borz gives a scroll of recall to Holdemup.
   412H 110V 1X 0.79% 680C [**Rebif:V.Good**] Mem:3 Exits:W> ass
   You attempt to assist Baelron.
   You bludgeon Borz extremely hard.
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Bad] Mem:3
   Exits:W>
   You stop watching Rebif.
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Bad] Mem:3
   Exits:W>
   You miss Borz with your bludgeon.
   Baelron massacres Borz with his cleave.
   Borz slashes Baelron hard.
   Borz misses Baelron with his slash.
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Bad] Mem:3
   Exits:W> c
   Skipper annihilates Borz with a plunk.
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Bad] Mem:3
   Exits:W> ch borz
   Fifty tells your group 'i have flags on sunn'
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Bad] Mem:3
   Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres a drunken dwarf with a plunk.
   A drunken dwarf is stunned, but will likely regain consciousness again.
   Skipper massacres Holdemup with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres Atari with a plunk.
   Skipper massacres Borz with a plunk.
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> You utter the words,
   'hold person'
   412H 110V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> #OK NEW TICKSIZE SET
   Atari bludgeons Skipper hard.
   Holdemup misses Skipper with his cleave.
   Holdemup misses Skipper with his cleave.
   Baelron massacres Borz with his cleave.
   Borz massacres Baelron with his slash.
   Borz slashes Baelron extremely hard.
   Fifty closes her prayerbook with a content look on her face.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W>
   Atari stands up.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W>
   A drunken dwarf sits down and rests.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> !
   Skipper panics, and attempts to flee.
   Skipper flies west.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W>
   Skipper flies in from the west.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> You bludgeon Borz
   extremely hard.
   Baelron massacres Borz with his cleave.
   Borz misses Baelron with his slash.
   You utter the words, 'hold person'
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W>
   Skipper takes aim at Borz.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W>
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres a drunken dwarf with a plunk.
   You receive 0 experience.
   A drunken dwarf is dead! R.I.P.
   Skipper massacres Holdemup with a plunk.
   Skipper massacres Atari with a plunk.
   Skipper massacres Borz with a plunk.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> c
   The death cry of a drunken dwarf echoes from somewhere nearby...
   Atari gets a small pile of coins from the corpse of a drunken dwarf.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> c 'harm
   Borz appears to get angry for a second.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> c 'harm'
   Fifty gets a large stone axe from the corpse of a drunken dwarf.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:V.Bad] Mem:3
   Exits:W> c 'harm'borz
   Skipper massacres Borz with a plunk.
   Skipper massacres Holdemup with a plunk.
   You receive 0 experience.
   Holdemup is dead! R.I.P.
   Skipper massacres Atari with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres Borz with a plunk.
   The death cry of Holdemup echoes from somewhere nearby...
   Holdemup stops following Borz.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:3
   Exits:W>
   Rebif gets a training axe from the corpse of Holdemup.
   Rebif gets a training axe from the corpse of Holdemup.
   Rebif gets a pair of leather training boots from the corpse of
   Holdemup.
   Rebif gets some leather training armor from the corpse of Holdemup.
   Rebif gets a scroll of recall from the corpse of Holdemup.
   Rebif gets a leather training cap from the corpse of Holdemup.
   Rebif gets a dragonshelm from the corpse of Holdemup.
   Rebif gets a map of Solace from the corpse of Holdemup.
   Rebif gets a training two-handed sword from the corpse of Holdemup.
   Rebif gets a small leather bag from the corpse of Holdemup.
   Rebif gets a hooded lantern from the corpse of Holdemup.
   Rebif gets a complimentary stable note from the corpse of Holdemup.
   Rebif gets a loaf of bread from the corpse of Holdemup.
   Rebif gets a loaf of bread from the corpse of Holdemup.
   Rebif gets a waterskin from the corpse of Holdemup.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:3
   Exits:W>
   Baelron misses Borz with his cleave.
   Borz misses Baelron with his slash.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:3
   Exits:W> The corpse doesn't
   seem to have what you are looking for.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:3
   Exits:W> It's a pretty
   ghastly sight! Searching through the remains, you find:
   corpse (here) :
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:3
   Exits:W> You utter the words,
   'harm'
   You grab Borz, who screams in pain.
   412H 149V 1X 0.79% 680C [Me:Perfect] [Baelron:Good] [Borz:Awful] Mem:4
   Exits:W> #TICK+10
   Skipper massacres Borz with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres Atari with a plunk.
   Skipper massacres Borz with a plunk.
   You receive 0 experience.
   Borz is dead! R.I.P.
   The death cry of Borz echoes from somewhere nearby...
   Kylar stops following Borz.
   Sunn stops following Borz.
   412H 149V 1X 0.79% 680C Mem:4 Exits:W>
   Rebif gets a massive black rune-covered sword from the corpse of Borz.
   Rebif gets a gold bracelet from the corpse of Borz.
   Rebif gets a silver kingfisher band from the corpse of Borz.
   Rebif gets a blood red captain's sash from the corpse of Borz.
   Rebif gets a pair of draconian gauntlets from the corpse of Borz.
   Rebif gets a leather collar with small iron spikes from the corpse of
   Borz.
   Rebif gets a sapphire inlaid choker from the corpse of Borz.
   Rebif gets a carved ivory ring from the corpse of Borz.
   Rebif gets a copper dwarven ring from the corpse of Borz.
   Rebif gets a very large pile of coins from the corpse of Borz.
   Rebif gets the meat of Julius from the corpse of Borz.
   Rebif gets the meat of the demon Marilith from the corpse of Borz.
   Rebif gets a goblet from the corpse of Borz.
   _________________________________________
   Got sunn hiding in solamnic ship for some reason!
   412H 137V 1X 0.79% 680C Exits:ES> gt kill atari
   You tell your group 'kill atari'
   412H 137V 1X 0.79% 680C Exits:ES> s
   Fifty flies in from the north.
   Oshkosh the fearsome blue dragon arrives from the north.
   Xsesive flies in from the north.
   Tyler flies in from the north.
   Rebif flies in from the north.
   Baelron flies in from the north.
   Skipper flies in from the north.
   Slam flies in from the north.
   On the Deck
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   . . . has a tough exterior.
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <FURY> Xsesive Force is standing here. (flying) (invisible)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   A Solamnic Knight is here, looking at you warily.
   412H 136V 1X 0.79% 680C Exits:NESW> s
   Fifty flies in from the north.
   Oshkosh the fearsome blue dragon arrives from the north.
   Xsesive flies in from the north.
   Tyler flies in from the north.
   Rebif flies in from the north.
   Baelron flies in from the north.
   Skipper flies in from the north.
   Slam flies in from the north.
   The Deck
   <FURY> Slam Ming, Samurai Warrior is standing here. (flying)
   . . . has a tough exterior.
   <FURY> Skipper Reppiks is standing here. (flying) (invisible)
   <FURY> Baelron Shortlegs, Kender Tripod is standing here. (flying)
   <FURY> Rebif, Interferon Beta is standing here. (flying)
   <FURY> Tyler, Last Shining Force Standing is standing here. (flying)
   (invisible)
   <FURY> Xsesive Force is standing here. (flying) (invisible)
   A fearsome blue dragon, Oshkosh, is standing here, ignoring you.
   <FURY> Fifty Percent Pain is standing here. (flying) (invisible)
   The dog-headed, four armed Demon Glabrezu is here, glaring around.
   <Apoc> Sunn the Male Human is standing here. (flying) (invisible)
   . . . is surrounded by a white mist.
   412H 135V 1X 0.79% 680C Exits:NESWD> ch sunn
   You utter the words, 'hold person'
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD> !
   Rebif crashes into Sunn in a thundering collision, knocking him to the
   ground!
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD>
   Xsesive slowly fades into existence.
   Sunn steps aside as Xsesive attempts a bash, stumbles, and falls flat
   on his face.
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD>
   Fifty gives Oshkosh the fearsome blue dragon an order.
   Oshkosh the fearsome blue dragon claws Sunn extremely hard.
   Sunn slowly fades into existence.
   Oshkosh the fearsome blue dragon is chilled, as he swings at Sunn.
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD>
   Sunn steps aside as Slam attempts a bash, stumbles, and falls flat on
   his face.
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD>
   Skipper takes aim at Sunn.
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD>
   Skipper annihilates Sunn with a plunk.
   Skipper slowly fades into existence.
   412H 135V 1X 0.79% 680C Mem:2 Exits:NESWD> You utter the words, 'hold
   person'
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> #TICK-10
   c '
   Skipper massacres Sunn with a plunk.
   Slam massacres Sunn with his slash.
   Slam is chilled, as he swings at Sunn.
   Oshkosh the fearsome blue dragon claws Sunn very hard.
   Oshkosh the fearsome blue dragon is chilled, as he swings at Sunn.
   Xsesive massacres Sunn with his slash.
   Xsesive is chilled, as he swings at Sunn.
   Rebif massacres Sunn with his cleave.
   Rebif is chilled, as he swings at Sunn.
   Sunn slashes Rebif very hard.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> c 'harm'sun
   Sunn steps aside as Baelron attempts a bash, stumbles, and falls flat
   on his face.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> c 'harm'sunn
   Fifty focuses harshly on Sunn and utters some strange words.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> c 'harm'sunn
   Skipper massacres Sunn with a plunk.
   Skipper slowly fades into existence.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD>
   Tyler focuses harshly on Sunn and utters the words, 'harm'.
   Tyler slowly fades into existence.
   Sunn cries out in pain as Tyler grabs him.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD>
   Skipper massacres Sunn with a plunk.
   Skipper slowly fades into existence.
   Skipper massacres the demon Glabrezu with a plunk.
   Skipper slowly fades into existence.
   The demon Glabrezu panics, and attempts to flee.
   The demon Glabrezu leaves west.
   Skipper annihilates Sunn with a plunk.
   You receive 0 experience.
   Sunn is dead! R.I.P.
   The death cry of Sunn echoes from somewhere nearby...
   Atari stops following Sunn.
   Crash stops following Sunn.
   Shlomo stops following Sunn.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> Who should the spell be cast
   upon?
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> Skipper gets a very large
   pile of coins from the corpse
   of Sunn.
   The corpse doesn't seem to have what you are looking for.
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> get It's a pretty ghastly
   sight! Searching through the
   remains, you find:
   corpse (here) :
   a glowing silver longsword..it glows dimly
   a purple silk robe..it glows dimly
   a mystic gold medallion..it glows dimly
   a miner's badge
   a glowing scroll of recall..it glows dimly [3]
   a miner's badge
   a sinew-wrapped bear claw fetish
   a glowing scroll of recall..it glows dimly
   an ancient sword of carved ivory..it glows dimly
   a small wooden chest
   412H 135V 1X 0.79% 680C Mem:3 Exits:NESWD> get all sun
   Rebif gets a glowing silver longsword from the corpse of Sunn.
   Rebif gets a purple silk robe from the corpse of Sunn.
   Rebif gets a mystic gold medallion from the corpse of Sunn.
   Rebif gets a miner's badge from the corpse of Sunn.
   Rebif gets a glowing scroll of recall from the corpse of Sunn.
   Rebif gets a glowing scroll of recall from the corpse of Sunn.
   Rebif gets a glowing scroll of recall from the corpse of Sunn.
   Rebif gets a miner's badge from the corpse of Sunn.
   Rebif gets a sinew-wrapped bear claw fetish from the corpse of Sunn.
   Rebif gets a glowing scroll of recall from the corpse of Sunn.
   Rebif gets an ancient sword of carved ivory from the corpse of Sunn.
   Rebif gets a small wooden chest from the corpse of Sunn.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
