<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Lucia dies

   POV: Sky scout

   Log Rating: 3.0371

   Can too pk!

   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> ct waiting
   game sux
   You tell your clan 'waiting
   game sux'
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> l s
   You see nothing special.
   A Knight of Solamnia walks about the inn, keeping it safe.
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> s a;sca;n
   Traveler's Lodge
   A Knight of Solamnia walks about the inn, keeping it safe.
   510H 114V 16353001X 53C Exits:NESW> Looking north:
   You see nothing special.
   A dark shadow stretches across the floor.
   A dark shadow stretches across the floor.
   The waitress sits behind the counter waiting to serve you a drink.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   <CORE> Helena, Hermit of the East is standing here.
   <MAEL> Lucia the Martyr, Recaller of Doomed Tanks is standing here.
   (flying)
   The manager of Traveler's Lodge stands here ready to sign you in.
   A tall and strong bouncer, hired to protect the lodge's customers,
   stands here.
   Looking west:
   You see nothing special.
   <CORE> Kilthar Val, Regeneral of the Netherworld is standing here.
   (flying)
   (invisible)
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   510H 114V 16353001X 53C Exits:NESW> The Lodge's Cafe
   A dark shadow stretches across the floor.
   A dark shadow stretches across the floor.
   The waitress sits behind the counter waiting to serve you a drink.
   510H 113V 16353001X 53C [**a dark shadow:Perfect**] Exits:S>
   Arianne tells your clan 'yep'
   510H 113V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> own
   lucia;o all.shadow st;o all.shadow bash lucia
   You are hungry.
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S>
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> i
   You are carrying:
   a bundle of arrows fletched with phoenix feathers (27)
   a bundle of arrows fletched with eagle feathers (27)
   a bundle of arrows fletched with a raven feather (27)
   a hooded lantern
   a scroll of recall
   a Gryphon longbow
   a jug of oil
   a small wooden chest
   a metal canteen
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> list
   Items for sale:
   1. Bottle 1 A bottle
   2. Cup 1 A small cup of tea
   3. Cup 1 A cup of water
   4. Cup 1 A cup of coffee
   5. Bottle 1 A small brown bottle
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> bu leg
   The waitress tells you 'Sorry,
   but that is not for sale.'
   510H 115V 16353001X 53C [**a dark shadow:Perfect**] Exits:S> s a
   Traveler's Lodge
   A Knight of Solamnia walks about the inn, keeping it safe.
   510H 114V 16353001X 53C Exits:NESW> e
   Vingaard Avenue South
   510H 113V 16353001X 53C Exits:NESW> e
   Imperial Diner
   A solamnic knight is patrolling this area.
   A cityguard stands here, keeping a wary eye out for troublemakers.
   A waitress is here ready to take your order.
   510H 112V 16353001X 53C Exits:W> list
   Items for sale:
   1. Pork 1 A large piece of pork chop
   2. Leg 1 A leg of lamb
   3. Sandwich 1 A club sandwich
   510H 112V 16353001X 53C Exits:W> bu leg
   A waitress tells you 'That will be 1 steel coins.'
   You now have a leg of lamb.
   510H 112V 16353001X 52C Exits:W> !
   A waitress tells you 'That will be 1 steel coins.'
   You now have a leg of lamb.
   510H 112V 16353001X 51C Exits:W> !
   A waitress tells you 'That will be 1 steel coins.'
   You now have a leg of lamb.
   510H 112V 16353001X 50C Exits:W> eat all.leg
   You eat a leg of lamb.
   You are full.
   There is nothing left now.
   You are too full to eat more!
   510H 112V 16353001X 50C Exits:W> w
   Vingaard Avenue South
   510H 111V 16353001X 50C Exits:NESW> w
   nTraveler's Lodge
   A Knight of Solamnia walks about the inn, keeping it safe.
   510H 110V 16353001X 50C Exits:NESW> n
   The Lodge's Cafe
   A dark shadow stretches across the floor.
   A dark shadow stretches across the floor.
   The waitress sits behind the counter waiting to serve you a drink.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] Exits:S>
   Lucia flies in from the south.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] Exits:S> nA dark
   shadow crashes into
   Lucia in a thundering collision, knocking her to the ground!
   A dark shadow crashes into Lucia in a thundering collision, knocking
   her to the
   ground!
   You issue the order 'bash lucia'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:V.Good**]
   Exits:S> list
   A dark shadow drains Lucia extremely hard.
   A dark shadow massacres Lucia with its drain.
   Lucia misses a dark shadow with her hit.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Good**]
   Exits:S> own lucia;o all.shadow st;o all.shadow bash lucia
   You aim at
   Lucia.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Good**]
   Exits:S> You start
   shooting like mad.
   You massacre Lucia with a plunk.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> You issue the
   order 'st'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> You miss Lucia
   with your shot.
   You issue the order 'bash lucia'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S>
   A dark shadow drains Lucia extremely hard.
   A dark shadow massacres Lucia with its drain.
   Lucia misses a dark shadow with her hit.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> n
   Alas, you cannot
   go that way...
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S>
   You massacre Lucia with a plunk.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> own lucia;o all.shadow st;o all.shadow bash lucia
   You are already
   aiming at them.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> You start
   shooting like mad.
   Not yet.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> You issue the
   order 'st'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> A dark shadow
   crashes into Lucia in a thundering collision, knocking her to the
   ground!
   Lucia steps aside as a dark shadow attempts a bash, stumbles, and falls
   flat on
   its face.
   You issue the order 'bash lucia'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> !
   You are already
   aiming at them.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Fair**]
   Exits:S> You plunk Lucia
   extremely hard.
   You start shooting like mad.
   Not yet.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Bad**]
   Exits:S> You issue the
   order 'st'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Bad**]
   Exits:S> You issue the
   order 'bash lucia'.
   510H 109V 16353001X 50C [**a dark shadow:Perfect**] [**Lucia:Bad**]
   Exits:S>
   You massacre Lucia with a plunk.
   A dark shadow massacres Lucia with its drain.
   A dark shadow massacres Lucia with its drain.
   Lucia barely hits a dark shadow.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:V.Bad**]
   Exits:S> gt win
   You miss Lucia with your shot.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:V.Bad**]
   Exits:S>
   You are not a
   member of a group.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:V.Bad**]
   Exits:S>
   You massacre Lucia with a plunk.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Awful**]
   Exits:S>
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Awful**]
   Exits:S>
   A dark shadow massacres Lucia with its drain.
   A dark shadow drains Lucia very hard.
   Lucia misses a dark shadow with her hit.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Awful**]
   Exits:S>
   You plunk Lucia extremely hard.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Awful**]
   Exits:S> own lucia;o all.shadow st;o all.shadow bash lucia
   You are already
   aiming at them.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Awful**]
   Exits:S> You start
   shooting like mad.
   You massacre Lucia with a plunk.
   Lucia is dead! R.I.P.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] [**Lucia:Dying**]
   Exits:S>
   The death cry of Lucia echoes from somewhere nearby...
   Lucia's golden aura fades away.
   Lucia sinks gently to the ground.
   You stop aiming at Lucia.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] Exits:S> g all corpA
   dark shadow stands up.
   You issue the order 'st'.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] Exits:S> g all
   corpse
   You issue the order 'bash
   lucia'.
   510H 109V 16353001X 50C [**a dark shadow:V.Good**] Exits:S> cYou get a
   thin bronze bracelet
   from the corpse of Lucia.
   You get a transparent fishscale bracelet from the corpse of Lucia.
   You get a furry white cloak from the corpse of Lucia.
   You get a blood red adamantite shield from the corpse of Lucia.
   You get a pair of black silk sleeves from the corpse of Lucia.
   You get a pair of soldier's boots from the corpse of Lucia.
   You get a spired silver helm from the corpse of Lucia.
   You get a furry white cloak from the corpse of Lucia.
   You get a necklace made of finger bones from the corpse of Lucia.
   You get a black onyx ring from the corpse of Lucia.
   You get a clear crystal sceptre from the corpse of Lucia.
   You get a very large pile of coins from the corpse of Lucia.
   There were 22013 coins.
   You get a brewed potion from the corpse of Lucia.
   You get a brewed potion from the corpse of Lucia.
   You get a brewed potion from the corpse of Lucia.
   You get a brewed potion from the corpse of Lucia.
   You get a brewed potion from the corpse of Lucia.
   You get a brewed potion from the corpse of Lucia.
   You get a bright ball of light from the corpse of Lucia.
   You get a crystal shard necklace from the corpse of Lucia.
   You get a crystal shard necklace from the corpse of Lucia.
   You get a crystal shard necklace from the corpse of Lucia.
   You get a glowing scroll of recall from the corpse of Lucia.
   You get a milky potion of see invisible from the corpse of Lucia.
   You get a piece of sweet bread from the corpse of Lucia.
   cYou get a piece of sweet bread from the corpse of Lucia.
   You get a piece of sweet bread from the corpse of Lucia.
   You get an enchanted chest from the corpse of Lucia.
   510H 109V 16353001X 22063C [**a dark shadow:V.Good**] Exits:S> ct win
   You tell your clan 'win'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
