<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   How many times have you been spooned by another Arctic player?

   (*) 0
   ( ) 1
   ( ) 2-5
   ( ) 5-10
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   ...it happened so fast

   POV: Chiggles

   Log Rating: 4.3332

   we didn't even see brandon there he rip'd so fastlike

   [9:57:47 PM] Darick Drake says: 521H 89V 1X 26.98% 5666C
   [**Riv:V.Good**] Exits:NS> l
   On a Path Through the Woods
   A small campfire fills the area with a warm, comfortable glow.
   A wild berry is lying on the ground. [3]
   A fearsome blue dragon, Dikc, is standing here, ignoring you.
   <FURY> Nolan the Male Kagonesti is resting here.
   . . . is surrounded by a shimmering light.
   <ttoc> Kayna, Beautiful Princess of Darkness is standing here.
   Cabre's apprentice is here, laden with many bags.
   <FURY> Vikha ahkiV, Releasing Your Inner Fury is resting here.
   <FURY> Riv Uhr, Wide, Wet and Wonderful is standing here. (flying)
   <FURY> Kamaswami the Merchant, Furious Spirit Guide is standing here.
   (flying)
   <FURY> Lucia Lucianna, The Instiller of Heliophobia is standing here.
   (flying)
   Cabre Tohz is standing here.
   . . . is surrounded by 3 duplicate images.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Vikha turns Dikc the fearsome blue dragon's head to the side and sink
   his fangs
   into his neck.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Kamaswami utters some strange words.
   Kamaswami's features are hideously distorted as his true form is
   revealed!
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Apostle flies in from the south.
   Borz flies in from the south.
   Snakstinator flies in from the south.
   Snakstinator kneels down and studies the ground.
   Clarence flies in from the south.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Clarence focuses harshly on Lucia and utters some strange words.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Apostle utters some strange words.
   A huge swarm of biting, stinging insects fills the air.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS>
   Dikc the fearsome blue dragon screams as a swarm of insects engulfs
   him.
   Nolan seems unaffected by Apostle's swarm of insects.
   Kayna seems unaffected by Apostle's swarm of insects.
   Cabre's apprentice screams as a swarm of insects engulfs him.
   With a quick weave, you slip out of the way of the attack.
   Vikha deftly ducks out of the way of the attack.
   Riv screams as a swarm of insects engulfs him.
   Kamaswami seems unaffected by Apostle's swarm of insects.
   Lucia screams as a swarm of insects engulfs her.
   Cabre Tohz seems unaffected by Apostle's swarm of insects.
   Cabre Tohz obliterates Apostle with his pierce.
   Cabre Tohz obliterates Apostle with his pierce.
   Lucia misses Apostle with her crush.
   Kamaswami massacres Apostle with his cleave.
   Riv massacres Apostle with his slash.
   Cabre's apprentice hits Apostle extremely hard.
   Kayna slashes Apostle hard.
   Nolan bludgeons Apostle extremely hard.
   Nolan bludgeons Apostle extremely hard.
   Apostle misses Dikc the fearsome blue dragon with his hit.
   Dikc the fearsome blue dragon claws Apostle very hard.
   Snakstinator crashes into Lucia in a thundering collision, knocking her
   to the
   ground!
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] [**Apostle:V.Bad**] Exits:NS>
   Nolan stands up.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] [**Apostle:V.Bad**] Exits:NS>
   Cabre Tohz raises his hands and black bolt of force hits Apostle!
   You receive 0 experience.
   Apostle is dead! R.I.P.
   The death cry of Apostle echoes from somewhere nearby...
   Borz stops following Apostle.
   Apostle now follows Borz.
   Borz is the new leader of Apostle's group.
   Apostle stops following Borz.
   Snakstinator stops following Apostle.
   Snakstinator now follows Borz.
   Clarence stops following Apostle.
   Clarence now follows Borz.
   521H 89V 1X 26.98% 5666C [**Riv:V.Good**] Exits:NS> You get a very
   large pile of
   coins from the corpse of Apostle.
   There were 1482 coins.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> corpse (here) :
   some sickly yellow robes
   an embroidered purple scarf..it glows dimly
   a glowing scroll of recall..it glows dimly [2]
   a roasted turkey leg [3]
   a crimson steel lance
   a slender long sword
   a black sword of the Grimguard..it glows dimly
   a black morion helm
   a milky potion of see invisible
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> The corpse doesn't
   seem to
   have what you are looking for.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> j
   Insects fill the room. Dikc the fearsome blue dragon screams as he is
   bitten
   repeatedly.
   Nolan fends off a swarm of insects by flapping his arms wildly.
   Insects fill the room. Kayna screams as she is bitten repeatedly.
   Insects fill the room. Cabre's apprentice screams as he is bitten
   repeatedly.
   With a quick weave, you slip out of the way of the attack.
   Vikha deftly ducks out of the way of the attack.
   Insects fill the room. Riv screams as he is bitten repeatedly.
   Kamaswami fends off a swarm of insects by flapping his arms wildly.
   Lucia fends off a swarm of insects by flapping her arms wildly.
   Insects fill the room. Cabre Tohz screams as he is bitten repeatedly.
   Lucia crushes Snakstinator extremely hard.
   Snakstinator slashes Lucia extremely hard.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> j b
   Borz gets some sickly yellow robes from the corpse of Apostle.
   Borz gets an embroidered purple scarf from the corpse of Apostle.
   Borz gets a glowing scroll of recall from the corpse of Apostle.
   Borz gets a glowing scroll of recall from the corpse of Apostle.
   Borz gets a roasted turkey leg from the corpse of Apostle.
   Borz gets a roasted turkey leg from the corpse of Apostle.
   Borz gets a roasted turkey leg from the corpse of Apostle.
   Borz gets a crimson steel lance from the corpse of Apostle.
   Borz gets a slender long sword from the corpse of Apostle.
   Borz gets a black sword of the Grimguard from the corpse of Apostle.
   Borz gets a black morion helm from the corpse of Apostle.
   Borz gets a milky potion of see invisible from the corpse of Apostle.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> j bor
   Kamaswami focuses harshly on Snakstinator and utters some strange
   words.
   Kamaswami throws a handful of sticks at Snakstinator, but they turn
   into snakes
   in midflight!
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> j borz
   You aim at Borz.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS> You start shooting
   like mad.
   You massacre Borz with a plunk.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS>
   Borz heroically rescues Snakstinator.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS>
   Nolan tells your group 'tic in 10'
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS>
   You massacre Borz with a plunk.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS>
   Kayna leaves south.
   Dikc the fearsome blue dragon flies south.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] Exits:NS>
   Riv slashes Borz extremely hard.
   521H 89V 1X 26.98% 7148C [**Riv:V.Good**] [**Borz:Good**] Exits:NS>
   Nolan fends off a swarm of insects by flapping his arms wildly.
   Insects fill the room. Cabre's apprentice screams as he is bitten
   repeatedly.
   With a quick weave, you slip out of the way of the attack.
   Insects fill the room. Vikha screams as he is bitten repeatedly.
   Insects fill the room. Riv screams as he is bitten repeatedly.
   Kamaswami fends off a swarm of insects by flapping his arms wildly.
   Lucia fends off a swarm of insects by flapping her arms wildly.
   Cabre Tohz fends off a swarm of insects by flapping his arms wildly.
   Riv massacres Borz with his slash.
   Lucia crushes Borz very hard.
   Borz misses Lucia with his slash.
   Clarence focuses harshly on you and utters some strange words.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Borz:Good**] Exits:NS>
   You massacre Borz with a plunk.
   Snakstinator crashes into Lucia in a thundering collision, knocking her
   to the
   ground!
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Borz:Good**] Exits:NS>
   Kamaswami focuses harshly on Snakstinator and utters some strange
   words.
   Kamaswami throws a handful of sticks at Snakstinator, but they turn
   into snakes
   in midflight!
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Borz:Good**] Exits:NS>
   You massacre Borz with a plunk.
   Borz panics, and attempts to flee.
   Borz flies south.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] Exits:NS>
   You stop aiming at Borz.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] Exits:NS>
   Nolan fends off a swarm of insects by flapping his arms wildly.
   Insects fill the room. Cabre's apprentice screams as he is bitten
   repeatedly.
   With a quick weave, you slip out of the way of the attack.
   Vikha deftly ducks out of the way of the attack.
   Riv fends off a swarm of insects by flapping his arms wildly.
   Kamaswami fends off a swarm of insects by flapping his arms wildly.
   Insects fill the room. Lucia screams as she is bitten repeatedly.
   Cabre Tohz fends off a swarm of insects by flapping his arms wildly.
   Lucia crushes Snakstinator extremely hard.
   Snakstinator slashes Lucia extremely hard.
   Riv heroically rescues Lucia.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:Fair**]
   Exits:NS>
   Clarence flies south.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:Fair**]
   Exits:NS> hj
   Kamaswami focuses on Lucia and utters some strange words.
   Lucia's wounds begin to heal.
   521H 89V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:Fair**]
   Exits:NS> j snaksti
   The swarm of insects dissipates.
   Snakstinator slashes Riv very hard.
   Riv massacres Snakstinator with his slash.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> j snakstin
   Riv swings madly at Snakstinator with a broad bladed two-handed sword,
   cutting
   him a deep wound.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> j snakstinat
   Lucia stands up.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> j snakstinator
   Lucia utters some strange words.
   Lucia's hands send forth blinding rays of sunlight!
   Snakstinator withers as a ray of sunlight sent by Lucia engulfs him!
   Cabre's apprentice withers as a ray of sunlight sent by Lucia engulfs
   him!
   Cabre's apprentice panics, and attempts to flee.
   Cabre's apprentice leaves north.
   Lucia destroys Cabre Tohz's mirror images.
   Cabre Tohz withers as a ray of sunlight sent by Lucia engulfs him!
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> j snakstinator
   Snakstinator crashes into Lucia in a thundering collision, knocking her
   to the
   ground!
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> You
   aim at Snakstinator.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> You
   start shooting like mad.
   You massacre Snakstinator with a plunk.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS>
   Nolan bludgeons Snakstinator extremely hard.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS>
   Cabre Tohz raises his hands and black bolt of force hits Lucia!
   You massacre Snakstinator with a plunk.
   521H 113V 1X 26.98% 7148C [**Riv:V.Good**] [**Snakstinator:Fair**]
   Exits:NS> j snakstinator
   You massacre Snakstinator with a plunk.
   Nolan massacres Snakstinator with his bludgeon.
   Cabre Tohz obliterates Lucia with his pierce.
   Cabre Tohz obliterates Lucia with his pierce.
   Lucia crushes Snakstinator extremely hard.
   Snakstinator slashes Riv very hard.
   Riv slashes Snakstinator extremely hard.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:V.Bad**]
   Exits:NS> j snakstinator
   Kamaswami focuses harshly on Snakstinator and utters some strange
   words.
   Kamaswami throws a handful of sticks at Snakstinator, but they turn
   into snakes
   in midflight!
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:V.Bad**]
   Exits:NS> j snakstinator
   You massacre Snakstinator with a plunk.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:V.Bad**]
   Exits:NS> j snakstinator
   Nolan wiggles his fingers as he outlines Snakstinator's head in the
   air.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:V.Bad**]
   Exits:NS> j snakstinator
   Your clanmate Anita has entered the game.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:V.Bad**]
   Exits:NS> j snakstinato
   You massacre Snakstinator with a plunk.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:Awful**]
   Exits:NS>
   Nolan bludgeons Snakstinator extremely hard.
   Nolan bludgeons Snakstinator extremely hard.
   Cabre Tohz obliterates Lucia with his pierce.
   Lucia is dead! R.I.P.
   Snakstinator slashes Riv extremely hard.
   Riv misses Snakstinator with his slash.
   The death cry of Lucia echoes from somewhere nearby...
   Lucia sinks gently to the ground.
   Kamaswami stops following Lucia.
   Kamaswami now follows Cabre Tohz.
   Lucia stops following Cabre Tohz.
   Lucia now follows Kamaswami.
   Kamaswami is the new leader of Lucia's group.
   Lucia stops following Kamaswami.
   Riv stops following Lucia.
   Riv now follows Kamaswami.
   Vikha stops following Lucia.
   Vikha now follows Kamaswami.
   You stop following Lucia.
   You now follow Kamaswami.
   Kayna stops following Lucia.
   Your clanmate Lucia has left the game.
   521H 113V 1X 26.98% 7148C [**Riv:Good**] [**Snakstinator:Awful**]
   Exits:NS> You
   get a pile of coins from the corpse of Lucia.
   There were 99 coins.
   521H 113V 1X 26.98% 7247C [**Riv:Good**] [**Snakstinator:Awful**]
   Exits:NS> getcorps
   e (here) :
   a black mace of the Skull
   a rhodochrosite bracelet..it glows dimly
   a set of light blue prayer beads
   a vine belt
   a black priest's gown
   a carved marble shield
   a pair of black silk sleeves
   a pair of clear crystal gauntlets
   a pair of ivory legplates
   a runed brown hood
   a flowing white chasuble
   a long black stole, lined with red
   a gleaming mithril necklace inlaid with diamonds
   a ring of the Skull
   a ring of twisted ice..it glows dimly..it hums softly
   a clear crystal sceptre
   an alchemist's cloak
   a milky potion of see invisible [4]
   Kamaswami focuses harshly on Snakstinator and utters some strange
   words.
   Kamaswami throws a handful of sticks at Snakstinator, but they turn
   into snakes
   in midflight!
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   Snakstinator screams in pain as a snake tears into his flesh.
   521H 113V 1X 26.98% 7247C [**Riv:Good**] [**Snakstinator:Awful**]
   Exits:NS> get aYou
   massacre Snakstinator with a plunk.
   Snakstinator is dead! R.I.P.
   The death cry of Snakstinator echoes from somewhere nearby...
   You stop aiming at Snakstinator.
   The corpse doesn't seem to have what you are looking for.
   521H 113V 1X 26.98% 7247C [**Riv:Good**] Exits:NS> get alYou get a
   large pile of coins
   from the corpse of Snakstinator.
   There were 989 coins.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> get all cocorpse
   (here) :
   a swordfish's sword
   a kender hide shield..it glows dimly
   a pair of silver dragon scale boots
   a pair of platinum gilt leg plates
   a glass eye
   a milky potion of see invisible [2]
   a gleaming bronze sword
   a bronze shield
   a piece of sweet bread
   a steel falchion
   a black crystal pendant (invisible)
   a milky potion of see invisible
   a glowing scroll of recall..it glows dimly [3]
   a piece of sweet bread
   a longsword
   a steel falchion
   a jug of oil [3]
   a scroll of recall
   a milky potion of see invisible [2]
   a glowing scroll of recall..it glows dimly
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> get all corpThe
   corpse doesn't seem to
   have what you are looking for.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> get all corpse
   You get a swordfish's sword
   from the corpse of Snakstinator.
   You get a kender hide shield from the corpse of Snakstinator.
   You get a pair of silver dragon scale boots from the corpse of
   Snakstinator.
   You get a pair of platinum gilt leg plates from the corpse of
   Snakstinator.
   You get a glass eye from the corpse of Snakstinator.
   You get a milky potion of see invisible from the corpse of
   Snakstinator.
   You get a milky potion of see invisible from the corpse of
   Snakstinator.
   You get a gleaming bronze sword from the corpse of Snakstinator.
   You get a bronze shield from the corpse of Snakstinator.
   You get a piece of sweet bread from the corpse of Snakstinator.
   You get a steel falchion from the corpse of Snakstinator.
   You get a black crystal pendant from the corpse of Snakstinator.
   You get a milky potion of see invisible from the corpse of
   Snakstinator.
   Scroll : You can't carry that much weight.
   Scroll : You can't carry that much weight.
   Scroll : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Sword : You can't carry that much weight.
   Falchion : You can't carry that much weight.
   Jug : You can't carry that much weight.
   Jug : You can't carry that much weight.
   Jug : You can't carry that much weight.
   Scroll : You can't carry that much weight.
   Potion : You can't carry that much weight.
   Potion : You can't carry that much weight.
   Scroll : You can't carry that much weight.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> j
   Nolan gets a glowing scroll of recall from the corpse of Snakstinator.
   Nolan gets a glowing scroll of recall from the corpse of Snakstinator.
   Nolan gets a glowing scroll of recall from the corpse of Snakstinator.
   Nolan gets a piece of sweet bread from the corpse of Snakstinator.
   Nolan gets a longsword from the corpse of Snakstinator.
   Nolan gets a steel falchion from the corpse of Snakstinator.
   Nolan gets a jug of oil from the corpse of Snakstinator.
   Nolan gets a jug of oil from the corpse of Snakstinator.
   Nolan gets a jug of oil from the corpse of Snakstinator.
   Nolan gets a scroll of recall from the corpse of Snakstinator.
   Nolan gets a milky potion of see invisible from the corpse of
   Snakstinator.
   Nolan gets a milky potion of see invisible from the corpse of
   Snakstinator.
   Nolan gets a glowing scroll of recall from the corpse of Snakstinator.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> j
   Kamaswami gets a black mace of the Skull from the corpse of Lucia.
   Kamaswami gets a rhodochrosite bracelet from the corpse of Lucia.
   Kamaswami gets a set of light blue prayer beads from the corpse of
   Lucia.
   Kamaswami gets a vine belt from the corpse of Lucia.
   Kamaswami gets a black priest's gown from the corpse of Lucia.
   Kamaswami gets a carved marble shield from the corpse of Lucia.
   Kamaswami gets a pair of black silk sleeves from the corpse of Lucia.
   Kamaswami gets a pair of clear crystal gauntlets from the corpse of
   Lucia.
   Kamaswami gets a pair of ivory legplates from the corpse of Lucia.
   Kamaswami gets a runed brown hood from the corpse of Lucia.
   Kamaswami gets a flowing white chasuble from the corpse of Lucia.
   Kamaswami gets a long black stole, lined with red from the corpse of
   Lucia.
   Kamaswami gets a gleaming mithril necklace inlaid with diamonds from
   the corpse
   of Lucia.
   Kamaswami gets a ring of the Skull from the corpse of Lucia.
   Kamaswami gets a ring of twisted ice from the corpse of Lucia.
   Kamaswami gets a clear crystal sceptre from the corpse of Lucia.
   Kamaswami gets an alchemist's cloak from the corpse of Lucia.
   Kamaswami gets a milky potion of see invisible from the corpse of
   Lucia.
   Kamaswami gets a milky potion of see invisible from the corpse of
   Lucia.
   Kamaswami gets a milky potion of see invisible from the corpse of
   Lucia.
   Kamaswami gets a milky potion of see invisible from the corpse of
   Lucia.
   j521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS>rof
   You roll on the floor in a
   fit of laughter.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> say id
   Anita tells your clan 'swaaaaaaami'
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> say idiot
   Your clanmate Lucia has entered the game.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> say idiots
   You say 'idiots'
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> l
   On a Path Through the Woods
   The corpse of Snakstinator is lying here.
   The corpse of Lucia is lying here.
   The corpse of Apostle is lying here.
   A quartz crystal sphere has been dropped here.
   A small campfire fills the area with a warm, comfortable glow.
   A wild berry is lying on the ground. [3]
   <FURY> Nolan the Male Kagonesti is standing here.
   . . . is surrounded by a shimmering light.
   <FURY> Vikha ahkiV, Releasing Your Inner Fury is resting here.
   <FURY> Riv Uhr, Wide, Wet and Wonderful is standing here. (flying)
   <FURY> Kamaswami the Merchant, Furious Spirit Guide is standing here.
   (flying)
   Cabre Tohz is standing here.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> yell
   Anita tells your clan 'you guys doing anything?'
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> yell t
   Vikha shouts 'thanks'
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> shout thanks guys
   been great
   Kayna arrives from the south.
   Dikc the fearsome blue dragon flies in from the south.
   521H 113V 1X 26.98% 8236C [**Riv:Good**] Exits:NS> shout thanks guys
   been great day
   You shout 'thanks guys been
   great day'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
