<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Bali fight --- Gonja rip

POV: Aier

Log Rating: -0.9999

A few people were pestering me earlier, so I grabbed a few people and
got ready to rumble.

518H 195V 23588607X 977C Exits:S>
Niupta flies in from the south.
Gonja flies in from the south.
A fire salamander flies in from the south.
518H 195V 23588607X 977C Exits:S>
Niupta focuses harshly on you and utters some strange words.
You feel a slight chill.
518H 195V 23588607X 977C Exits:S> gt comegt comeYou tell your group
'come'
518H 195V 23588607X 977C Exits:S> gt comeYou tell your group 'come'
518H 195V 23588607X 977C Exits:S> ki niupta
Gonja gives a fire salamander an order.
A fire salamander bludgeons YOU very hard.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Perfect]
Exits:S> You tell your group 'come'
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Perfect]
Exits:S>
Gonja focuses harshly on you and utters some strange words.
You feel a slight chill.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Perfect]
Exits:S> You do the best you can!
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Perfect]
Exits:S>
A fire salamander misses you with its bludgeon.
You pierce a fire salamander extremely hard.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Ogly flies in from the south.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Ogly focuses harshly on Niupta and utters some strange words.
Flesh burns as Ogly enshrouds Niupta in a cloak of flames.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Niupta focuses harshly on you and utters some strange words.
You feel a slight chill.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S> av legsYou focus your purity on a fire salamander's leg!
You force a fire salamander to the ground.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Kraz arrives from the south.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Gonja focuses harshly on you and utters some strange words.
You feel a slight chill.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S> fleefleen
Ogly misses Niupta with his smite.
A fire salamander misses you with its bludgeon.
You pierce a fire salamander extremely hard.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S> ki niupta
Ogly focuses harshly on Niupta and utters some strange words.
Ogly misses Niupta and destroys an image instead.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S>
Niupta focuses harshly on you and utters some strange words.
Luckily for you Niupta slept during draining-lessons.
506H 195V 23588607X 977C [Aier:V.Good] [a fire salamander:Good]
Exits:S> You flee head over heels.
High Street
You are on the main shopping street of Port Balifor. To the west you
hear shouts as the shopkeepers make their living. Traders square lies
to
the east. From the north comes the heat of a furnace and the sound of
clanging metal. Heavy steel shutters to the south are the main defense
of
the bank of Balifor.
A Balifor watchman watches for trouble in the city.
506H 194V 23589234X 977C Exits:NESW> lYou're not fighting, why bother
fleeing?
506H 194V 23589234X 977C Exits:NESW> The Blacksmithy
The trading section of the blacksmithy is a little cleaner than the
rest of the building, but not much. The heat from the furnace sweeps
over
you and warms your chilled body. On the walls are multitudes of iron
racks,
encompassing all the armor and weapons you are ever likely to need.
Unfortunately, some of the better ones are in cabinets with 'Not for
sale'
signs on them. Still, there are some very good offers around.
Kraz E. Man is standing here.
Ogly the Male Hill Dwarf is standing here, fighting Niupta. (flying)
A fire salamander is sitting here. (flying)
Gonja the Male Half Elf is standing here. (flying)
. . . has a tough exterior.
Niupta the Warlock of Darkness is standing here, fighting Ogly.
(flying) (invisible)
. . . is surrounded by 3 duplicate images.
A robust griffon paces gently while waiting for a rider.
Ithrall the master blacksmith stands here, ready to serve your needs.
506H 193V 23589234X 977C Exits:S> You miss Niupta and destroy an image
instead.
506H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S>
Gonja focuses harshly on you and utters some strange words.
Your flesh burns as Gonja enshrouds you in a cloak of flames.
466H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S>
Kraz crashes into Gonja in a thundering collision, knocking him to the
ground!
466H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S>
Kraz crushes Gonja very hard.
Gonja misses Kraz with his bludgeon.
You miss Niupta with your pierce.
466H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S> av legs
Ogly focuses harshly on Niupta and utters some strange words.
Ogly misses Niupta and destroys an image instead.
466H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S>
Elyana tells you 'they clan'
466H 193V 23589234X 977C [Ogly:Perfect] [Niupta:Good] Exits:S>
Niupta panics, and attempts to flee.
Niupta flies south.
466H 193V 23589234X 977C Exits:S> The Blacksmithy
The trading section of the blacksmithy is a little cleaner than the
rest of the building, but not much. The heat from the furnace sweeps
over
you and warms your chilled body. On the walls are multitudes of iron
racks,
encompassing all the armor and weapons you are ever likely to need.
Unfortunately, some of the better ones are in cabinets with 'Not for
sale'
signs on them. Still, there are some very good offers around.
Kraz E. Man is standing here, fighting Gonja.
Ogly the Male Hill Dwarf is standing here. (flying)
A fire salamander is sitting here. (flying)
Gonja the Male Half Elf is sitting here, fighting Kraz. (flying)
. . . has a tough exterior.
A robust griffon paces gently while waiting for a rider.
Ithrall the master blacksmith stands here, ready to serve your needs.
466H 193V 23589234X 977C Exits:S> You must focus on the battle close at
hand.
466H 193V 23589234X 977C Exits:S> ki gonja
Kraz massacres Gonja with his crush.
Gonja misses Kraz with his bludgeon.
466H 193V 23589234X 977C Exits:S> You pierce Gonja hard.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Good] Exits:S>
Ogly focuses harshly on Gonja and utters some strange words.
Flesh burns as Ogly enshrouds Gonja in a cloak of flames.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Fair] Exits:S> str
Elyana tells you 'i think it'
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Fair] Exits:S>
You massacre Gonja with your pierce.
Kraz crushes Gonja extremely hard.
Gonja misses Kraz with his bludgeon.
Gonja steps aside as Kraz attempts a bash, stumbles, and falls flat on
his face.
Niupta flies in from the south.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Fair] Exits:S>
Niupta focuses harshly on Kraz and utters some strange words.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Fair] Exits:S> You attempt
to strike at Gonja with your javelin.
You pierce Gonja extremely hard.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Bad] Exits:S>
Ogly focuses harshly on Gonja and utters some strange words.
Flesh burns as Ogly enshrouds Gonja in a cloak of flames.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S>
Chon flies in from the south.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S> str
Elyana tells you 'gw or something'
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S>
You pierce Gonja extremely hard.
Kraz crushes Gonja very hard.
Gonja bludgeons Kraz extremely hard.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S> You attempt
to strike at Gonja with your javelin.
You pierce Gonja very hard.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S>
Gonja stands up.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:V.Bad] Exits:S>
Ogly focuses harshly on Gonja and utters some strange words.
Flesh burns as Ogly enshrouds Gonja in a cloak of flames.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> tell elyana
nope
Niupta focuses harshly on Ogly and utters some strange words.
The sound of bones cracking echoes as Niupta's force bolt slams into
Ogly.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S>
Niupta drains Ogly hard.
Ogly misses Niupta with his smite.
You pierce Gonja very hard.
Kraz crushes Gonja very hard.
Gonja misses Kraz with his bludgeon.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S>
Kraz stands up.
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpse
Kraz crashes into Gonja in a thundering collision, knocking him to the
ground!
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpsetake all corpseYou tell Elyana 'nope'
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpsetake all corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Good] [Gonja:Awful] Exits:S> take all
corpse
Chon focuses harshly on Kraz and utters some strange words.
The sound of bones cracking echoes as Chon's force bolt slams into
Kraz.
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpseOgly panics, and attempts to flee.
Ogly flies south.
What are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpsetake all corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpsetake all corpseWhat are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpseNiupta flies south.
What are you trying to get from?
466H 193V 23589234X 977C [Kraz:Fair] [Gonja:Awful] Exits:S> take all
corpsetake all corpseYou massacre Gonja with your pierce.
You receive 0 experience.
Gonja is dead! R.I.P.
The death cry of Gonja echoes from somewhere nearby...
A fire salamander stops following Gonja.
A fire salamander transcends this world and enters another plane.
A gnarled, mossy staff of wood and stone crumbles and returns to the
elements from which it was crafted.
You get a gnarled, mossy staff of wood and stone from the corpse of
Gonja.
You get a pile of coins from the corpse of Gonja.
There were 57 coins.
You get some cracked amber ftake all corpserom the corpse of Gonja.
You get a milky potion of see invisible from the corpse of Gonja.
You get a small wooden chest from the corpse of Gonja.
466H 193V 23589234X 1034C Exits:S> The corpse doesn't seem to have what
you are looking for.
466H 193V 23589234X 1034C Exits:S> take all corpseThe corpse doesn't
seem to have what you are looking for.
466H 193V 23589234X 1034C Exits:S> The corpse doesn't seem to have what
you are looking for.
466H 193V 23589234X 1034C Exits:S> The corpse doesn't seem to have what
you are looking for.
466H 193V 23589234X 1034C Exits:S> ki niuptaThe corpse doesn't seem to
have what you are looking for.
466H 193V 23589234X 1034C Exits:S> The corpse doesn't seem to have what
you are looking for.
466H 193V 23589234X 1034C Exits:S> Niupta flies in from the south.
The corpse doesn't seem to have what you are looking for.
466H 193V 23589234X 1034C Exits:S> The corpse doesn't seem to have what
you are looking for.
466H 193V 23589234X 1034C Exits:S> ki niuptaThe corpse doesn't seem to
have what you are looking for.
466H 193V 23589234X 1034C Exits:S> Chon focuses harshly on Kraz and
utters some strange words.
The sound of bones cracking echoes as Chon's force bolt slams into
Kraz.
The corpse doesn't seem to have what you are looking for.
466H 193V 23589234X 1034C Exits:S> You miss Niupta and destroy an image
instead.
466H 193V 23589234X 1034C [Aier:Good] [Niupta:Good] Exits:S>
Niupta focuses harshly on Kraz and utters some strange words.
The sound of bones cracking echoes as Niupta's force bolt slams into
Kraz.
466H 193V 23589234X 1034C [Aier:Good] [Niupta:Good] Exits:S>
Fyre tells you 'hrmm friend just asked em..they sais GW....Greedy Whiny
is their clan'
466H 193V 23589234X 1034C [Aier:Good] [Niupta:Good] Exits:S>
You miss Niupta with your pierce.
Chon misses Kraz with his smite.
Kraz misses Chon and destroys an image instead.
You feel less righteous.
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S>
A Balifor watchman arrives from the south.
Kraz tries to bash Chon, but he passes right through his image and
falls.
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S>
groufleeflee
Chon focuses harshly on Kraz and utters some strange words.
The sound of bones cracking echoes as Chon's force bolt slams into
Kraz.
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S> n
Elyana tells you 'shrug, they not with us anyway'
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S> Niupta
focuses harshly on Kraz and utters some strange words.
The sound of bones cracking echoes as Niupta's force bolt slams into
Kraz.
You do the best you can!
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S> lay
krazYour group of 3 members consists of:
Member Hits Move Position Fly Inv Water Light Mem
-----------------------------------------------------------------------
-
Aier v.good rested fighting Y N Y 1 0
Ogly bad rested standing Y N N 0 5
Kraz v.bad rested fighting N N N 1 0
485H 195V 23589234X 1034C [Aier:V.Good] [Niupta:V.Good] Exits:S> You
pierce Niupta very hard.
Kraz crushes Chon hard.
You flee head over heels.
High Street
You are on the main shopping street of Port Balifor. To the west you
hear shouts as the shopkeepers make their living. Traders square lies
to
the east. From the north comes the heat of a furnace and the sound of
clanging metal. Heavy steel shutters to the south are the main defense
of
the bank of Balifor.
A drunken sailor steadies himself as he tries to stagger back to his
boat.
485H 194V 23589234X 1034C Exits:NESW> You're not fighting, why bother
fleeing?
485H 194V 23589234X 1034C Exits:NESW> The Blacksmithy
The trading section of the blacksmithy is a little cleaner than the
rest of the building, but not much. The heat from the furnace sweeps
over
you and warms your chilled body. On the walls are multitudes of iron
racks,
encompassing all the armor and weapons you are ever likely to need.
Unfortunately, some of the better ones are in cabinets with 'Not for
sale'
signs on them. Still, there are some very good offers around.
The corpse of Gonja is lying here.
A Balifor watchman watches for trouble in the city.
Niupta the Warlock of Darkness is standing here. (flying)
. . . is followed by a hovering ball of light.
Chon the Male Theiwar Dwarf is standing here, fighting Kraz. (flying)
(red aura)
. . . appears duplicated.
Kraz E. Man is sitting here, fighting Chon.
A robust griffon paces gently while waiting for a rider.
Ithrall the master blacksmith stands here, ready to serve your needs.
A Balifor watchman looks at Kraz and yells 'There's the scoundrel!'
485H 7m193V 23589234X 1034C Exits:S> You lay your hands on him and feel
your hands tingle with energy.
485H 193V 23589234X 1034C Exits:S>
A Balifor watchman looks at Kraz and yells 'There's the scoundrel!'
485H 193V 23589234X 1034C Exits:S> ki niupta
Chon focuses harshly on Kraz and utters some strange words.
The sound of bones cracking echoes as Chon's force bolt slams into
Kraz.
485H 193V 23589234X 1034C Exits:S> You pierce Niupta.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Niupta focuses harshly on Kraz and utters some strange words.
Niupta fails to drain Kraz - what a waste of energy.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
You pierce Niupta hard.
A Balifor watchman massacres Kraz with his smite.
A Balifor watchman misses Kraz with his smite.
Kraz crushes Chon very hard.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Ogly flies in from the south.
A Balifor watchman looks at Niupta and yells 'There's the scoundrel!'
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Kraz stands up.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Ogly flies south.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Kraz panics, and attempts to flee.
Kraz leaves south.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Ogly flies in from the south.
A Balifor watchman looks at Niupta and yells 'There's the scoundrel!'
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Chon utters some strange words.
Chon is surrounded by 3 duplicate images.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S> av
legsYou try to focus on Niupta, but miss and destroy his image.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
A Balifor watchman misses Niupta with his smite.
A Balifor watchman misses Niupta and destroys an image instead.
You miss Niupta and destroy an image instead.
Niupta misses you with his drain.
485H 193V 23589234X 1034C [Aier:V.Good] [Niupta:Good] Exits:S>
Niupta panics, and attempts to flee.
Niupta flies south.
485H 193V 23589234X 1034C Exits:S>
Ogly flies south.
485H 193V 23589234X 1034C Exits:S> ki niuptaki niuptaki niuptaki
niuptaki chonThey aren't here.
485H 193V 23589234X 1034C Exits:S> They aren't here.
485H 193V 23589234X 1034C Exits:S> They aren't here.
485H 193V 23589234X 1034C Exits:S> scaThey aren't here.
485H 193V 23589234X 1034C Exits:S> sKraz arrives from the south.
You miss Chon and destroy an image instead.
485H 193V 23589234X 1034C [Aier:V.Good] [Chon:V.Good] Exits:S>
Niupta flies in from the south.
A Balifor watchman looks at you and yells 'There's the scoundrel!'
485H 193V 23589234X 1034C [Aier:V.Good] [Chon:V.Good] Exits:S>
Chon panics, and attempts to flee.
You direct your attention to a Balifor watchman.
Chon flies south.
485H 193V 23589234X 1034C [Aier:V.Good] [a Balifor watchman:Perfect]
Exits:S>
Kraz leaves south.
485H 193V 23589234X 1034C [Aier:V.Good] [a Balifor watchman:Perfect]
Exits:S>
You are sent sprawling as a Balifor watchman crashes into you.
476H 193V 23589234X 1034C [Aier:V.Good] [a Balifor watchman:Perfect]
Exits:S> flee
Kraz arrives from the south.
476H 193V 23589234X 1034C [Aier:V.Good] [a Balifor watchman:Perfect]
Exits:S> flee
You pierce a Balifor watchman hard.
A Balifor watchman massacres YOU with his smite.
You raise your shield and block a Balifor watchman's blow.
453H 193V 23589055X 1034C [Aier:Good] [a Balifor watchman:V.Good]
Exits:S> st
Niupta steps aside as Kraz attempts a bash, stumbles, and falls flat on
his face.
453H 193V 23589055X 1034C [Aier:Good] [a Balifor watchman:V.Good]
Exits:S>
Niupta focuses harshly on you and utters some strange words.
YOU'RE HIT. A lightning bolt from Niupta has reached its goal.
416H 193V 23589055X 1034C [Aier:Good] [a Balifor watchman:V.Good]
Exits:S> fleeflee
Kraz misses Niupta with his crush.
You pierce a Balifor watchman extremely hard.
A Balifor watchman massacres YOU with his smite.
You deflect part of a Balifor watchman's blow with your shield.
A Balifor watchman smites YOU extremely hard.
376H 193V 23588738X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S>
Niupta panics, and attempts to flee.
Niupta flies south.
376H 193V 23588738X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S>
Niupta flies in from the south.
376H 193V 23588738X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S>
Niupta focuses harshly on you and utters some strange words.
YOU'RE HIT. A lightning bolt from Niupta has reached its goal.
333H 193V 23588738X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S>
You pierce a Balifor watchman very hard.
A Balifor watchman massacres YOU with his smite.
You deflect part of a Balifor watchman's blow with your shield.
A Balifor watchman smites YOU extremely hard.
297H 193V 23588500X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S> quaff mishakal's
Kraz stands up.
297H 193V 23588500X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S> Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
297H 193V 23588500X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S> You can't do that while sitting.
297H 193V 23588500X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S>
Avaia tells you 'tim?'
297H 193V 23588500X 1034C [Aier:Fair] [a Balifor watchman:V.Good]
Exits:S> Niupta focuses harshly on you and utters some strange words.
YOU'RE HIT. A lightning bolt from Niupta has reached its goal.
You can't do that while sitting.
256H 193V 23588500X 1034C [Aier:Bad] [a Balifor watchman:V.Good]
Exits:S>
Niupta steps aside as Kraz attempts a bash, stumbles, and falls flat on
his face.
256H 193V 23588500X 1034C [Aier:Bad] [a Balifor watchman:V.Good]
Exits:S> You can't do that while sitting.
256H 193V 23588500X 1034C [Aier:Bad] [a Balifor watchman:V.Good]
Exits:S> A Balifor watchman looks at Kraz and yells 'There's the
scoundrel!'
You stand up.
256H 193V 23588500X 1034C [Aier:Bad] [a Balifor watchman:V.Good]
Exits:S> nPANIC! You couldn't escape!
256H 193V 23588500X 1034C [Aier:Bad] [a Balifor watchman:V.Good]
Exits:S> You flee head over heels.
High Street
You are on the main shopping street of Port Balifor. To the west you
hear shouts as the shopkeepers make their living. Traders square lies
to
the east. From the north comes the heat of a furnace and the sound of
clanging metal. Heavy steel shutters to the south are the main defense
of
the bank of Balifor.
256H 192V 23588759X 1034C Exits:NESW> You quaff Mishakal's White
potion.
You feel the healing hand of Mishakal upon your body.
You heal yourself.
Your entire body tingles for a few seconds.
513H 192V 23588759X 1034C Exits:NESW> The Blacksmithy
The trading section of the blacksmithy is a little cleaner than the
rest of the building, but not much. The heat from the furnace sweeps
over
you and warms your chilled body. On the walls are multitudes of iron
racks,
encompassing all the armor and weapons you are ever likely to need.
Unfortunately, some of the better ones are in cabinets with 'Not for
sale'
signs on them. Still, there are some very good offers around.
The corpse of Gonja is lying here.
Niupta the Warlock of Darkness is standing here, fighting Kraz.
(flying)
. . . is surrounded by 4 duplicate images.
Kraz E. Man is sitting here, fighting Niupta.
A Balifor watchman watches for trouble in the city.
A robust griffon paces gently while waiting for a rider.
Ithrall the master blacksmith stands here, ready to serve your needs.
A Balifor watchman looks at Kraz and yells 'There's the scoundrel!'
513H 191V 23588759X 1034C Exits:S>
A Balifor watchman massacres Kraz with his smite.
A Balifor watchman smites Kraz very hard.
Kraz misses Niupta with his crush.
Niupta misses Kraz with his drain.
Konee arrives from the south.
A Balifor watchman looks at Kraz and yells 'There's the scoundrel!'
513H 191V 23588759X 1034C Exits:S> ki niuptaYou miss Niupta with your
pierce.
513H 191V 23588759X 1034C [Kraz:Good] [Niupta:Good] Exits:S>
Avaia tells you 'why do you want tim'
513H 191V 23588759X 1034C [Kraz:Good] [Niupta:Good] Exits:S>
Ogly tells your group 'you guys ok?'
513H 191V 23588759X 1034C [Kraz:Good] [Niupta:Good] Exits:S>
Konee leaves south.
513H 191V 23588759X 1034C [Kraz:Good] [Niupta:Good] Exits:S>
Niupta utters some strange words.
Niupta disappears in a puff of smoke.
513H 191V 23588759X 1034C Exits:S>
Kraz crushes a Balifor watchman very hard.
A Balifor watchman smites Kraz extremely hard.
A Balifor watchman smites Kraz extremely hard.
513H 191V 23588759X 1034C Exits:S> gt i dunno
A Balifor watchman tries to sweep Kraz's legs, but misses badly.
513H 191V 23588759X 1034C Exits:S> ki chonYou tell your group 'i dunno'
513H 191V 23588759X 1034C Exits:S> They aren't here.
513H 191V 23588759X 1034C Exits:S>
Kraz stands up.
513H 191V 23588759X 1034C Exits:S> gt
Kraz panics, and attempts to flee.
Kraz leaves south.
513H 191V 23588759X 1034C Exits:S> lWhat do you wish to tell your
group?
513H 191V 23588759X 1034C Exits:S> The Blacksmithy
The trading section of the blacksmithy is a little cleaner than the
rest of the building, but not much. The heat from the furnace sweeps
over
you and warms your chilled body. On the walls are multitudes of iron
racks,
encompassing all the armor and weapons you are ever likely to need.
Unfortunately, some of the better ones are in cabinets with 'Not for
sale'
signs on them. Still, there are some very good offers around.
The corpse of Gonja is lying here.
A Balifor watchman watches for trouble in the city.
A robust griffon paces gently while waiting for a rider.
Ithrall the master blacksmith stands here, ready to serve your needs.
513H 191V 23588759X 1034C Exits:S> gt ownedYou tell your group 'owned'
513H 191V 23588759X 1034C Exits:S> exa corpseIt's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
