<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Siliage R.I.P. Goddamit Silage.

POV: Oplek

Log Rating: 2.3938

Silage wanted attempt number two, and with a handy-dandy trigger, and
praying that the cityguards like me, I kinda hunted him down, sorta.

523H 119V 11993763X 354C Exits:NESW> <dHP:0 dX:0> s
Traders Square
This is the centre and heart of Port Balifor. All around you tradesmen
banter for your custom. Their many bright and varied goods hang from
wooden
stalls and mobile barrows. The smell of fresh produce fills the air,
sea-salt sweet. The hustle and bustle of people coming and going
distort
your view of the many fine houses that occupy the streets that lead
away
from the centre in all directions. A sign stands in the centre of the
cobbled square.
A fine young silver dragon stands quietly here.
bash silage
Silage the Male Half Elf is standing here. (flying)
. . . has a tough exterior.
523H 118V 11993763X 354C Exits:NESW> <dHP:0 dX:0> YOU BASHED ------->
Silage <--------
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:V.Good] Exits:NESW>
<dHP:0 dX:0> kick
You -----> MASSACRE <----- Silage
Silage MISSED YOU
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Good] Exits:NESW>
<dHP:0 dX:0>
<<< A Balifor watchman >>>> ENTERS FROM ----> the north.
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Good] Exits:NESW>
<dHP:0 dX:0>
You -----> MASSACRE <----- Silage
Silage MISSED YOU
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Fair] Exits:NESW>
<dHP:0 dX:0> YOU KICK --------> Silage <--------
--
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Fair] Exits:NESW>
<dHP:0 dX:0>
Silage says 'YAY'
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Fair] Exits:NESW>
<dHP:0 dX:0>
^^^ Silage ^^^
523H 118V 11993763X 354C [Oplek:Perfect] [Silage:Fair] Exits:NESW>
<dHP:0 dX:0>
Silage panics, and attempts to flee.
Silage flies west.
523H 118V 11993763X 354C Exits:NESW> <dHP:0 dX:0> bash
<<< Silage >>>> ENTERS FROM ----> the west.
523H 118V 11993763X 354C Exits:NESW> <dHP:0 dX:0> w
Silage gives an antisocial person an order.
An invisible stalker slowly fades into existence.
An invisible stalker MISSED YOU
523H 118V 11993763X 354C [Oplek:Perfect] [an invisible stalker:Perfect]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
a fine silver dragon KICKS YOU
514H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Perfect]
Exits:NESW> <dHP:-9 dX:0>
=== Silage CAST-ATTACKED you ===
514H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Perfect]
Exits:NESW> <dHP:0 dX:0> stand
YOU MISSED BASH
514H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Perfect]
Exits:NESW> <dHP:0 dX:0>
A fine silver dragon claws YOU extremely hard.
A fine silver dragon MISSED YOU
An invisible stalker MISSED YOU
You stab an invisible stalker extremely hard.
497H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Good]
Exits:NESW> <dHP:-17 dX:0>
Silage gives an invisible stalker an order.
497H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
A fine silver dragon NINJA KICKS YOU
484H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Good]
Exits:NESW> <dHP:-13 dX:0>
=== Silage CAST-ATTACKED you ===
484H 118V 11993763X 354C [Oplek:V.Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0> bash silage
A fine silver dragon claws YOU extremely hard.
A fine silver dragon MISSED YOU
An invisible stalker hits YOU extremely hard.
You stab an invisible stalker extremely hard.
449H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0> stand
You can't do that while sitting.
449H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0> ^^^ You ^^^
Silage gives an invisible stalker an order.
449H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0> YOU BASHED -------> Sila
ge <--------
449H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Good]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
A fine silver dragon claws YOU very hard.
A fine silver dragon MISSED YOU
An invisible stalker hits YOU very hard.
You stab an invisible stalker very hard.
424H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Fair]
Exits:NESW> <dHP:-25 dX:0> targ silage
Silage MISSED YOU
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker hits YOU very hard.
You stab an invisible stalker extremely hard.
410H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Fair]
Exits:NESW> <dHP:-14 dX:0>
A Balifor watchman leaves north.
410H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Fair]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
A fine silver dragon NINJA KICKS YOU
405H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Fair]
Exits:NESW> <dHP:-5 dX:0> You are already standin
g.
405H 118V 11993763X 354C [Oplek:Good] [an invisible stalker:Fair]
Exits:NESW> <dHP:0 dX:0> You focus your attacks u
pon a fine silver dragon.
^^^ Silage ^^^
405H 118V 11993763X 354C [Oplek:Good] [a fine silver dragon:Perfect]
Exits:NESW> <dHP:0 dX:0>
Silage panics, and attempts to flee.
Silage flies south.
405H 118V 11993763X 354C [Oplek:Good] [a fine silver dragon:Perfect]
Exits:NESW> <dHP:0 dX:0> bash
You stab a fine silver dragon extremely hard.
A fine silver dragon claws YOU hard.
A fine silver dragon slashes YOU hard.
An invisible stalker hits YOU hard.
376H 118V 11993533X 354C [Oplek:Fair] [a fine silver dragon:V.Good]
Exits:NESW> <dHP:-29 dX:230>
<<< Silage >>>> ENTERS FROM ----> the south.
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
376H 118V 11993533X 354C [Oplek:Fair] [a fine silver dragon:V.Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives an invisible stalker an order.
376H 118V 11993533X 354C [Oplek:Fair] [a fine silver dragon:V.Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
376H 118V 11993533X 354C [Oplek:Fair] [a fine silver dragon:V.Good]
Exits:NESW> <dHP:0 dX:0>
=== Silage CAST-ATTACKED you ===
376H 118V 11993533X 354C [Oplek:Fair] [a fine silver dragon:V.Good]
Exits:NESW> <dHP:0 dX:0> bash silage
YOU BASHED -------> a fine silver dragon <--------
376H 118V 11993330X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:203>
You stab a fine silver dragon extremely hard.
A fine silver dragon MISSED YOU
A fine silver dragon slashes YOU very hard.
An invisible stalker MISSED YOU
The cloud-veiled sky becomes even darker as the sun sets.
381H 133V 11993087X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:5 dX:243>
An antisocial person attempts to unbalance you, but you quickly avoid
him.
381H 133V 11993087X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
381H 133V 11993087X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
=== Silage CAST-ATTACKED you ===
Silage shoots webs at you but narrowly misses!
381H 133V 11993087X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
You -----> MASSACRE <----- a fine silver dragon
A fine silver dragon MISSED YOU
A fine silver dragon slashes YOU very hard.
An invisible stalker slowly fades into existence.
An invisible stalker hits YOU very hard.
357H 133V 11992803X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:-24 dX:284> bash silage
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
357H 133V 11992803X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives an invisible stalker an order.
357H 133V 11992803X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
357H 133V 11992803X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0> YOU BASHED -------> Sila
ge <--------
357H 133V 11992803X 354C [Oplek:Fair] [a fine silver dragon:Good]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
You -----> MASSACRE <----- a fine silver dragon
A fine silver dragon claws YOU hard.
A fine silver dragon MISSED YOU
An invisible stalker hits YOU hard.
338H 133V 11992465X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
You -----> MASSACRE <----- a fine silver dragon
A fine silver dragon claws YOU very hard.
A fine silver dragon MISSED YOU
An invisible stalker MISSED YOU
325H 133V 11992181X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:-13 dX:284>
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
325H 133V 11992181X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:0 dX:0> targ silage
You stab a fine silver dragon very hard.
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker MISSED YOU
stand
YOU MISSED BASH
Silage gives a fine silver dragon an order.
^^^ A fine silver dragon ^^^
325H 133V 11991992X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:0 dX:189> bash silage
^^^ Silage ^^^
325H 133V 11991992X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:0 dX:0>
<<< A Balifor watchman >>>> ENTERS FROM ----> the south.
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
325H 133V 11991992X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:0 dX:0>
=== Silage CAST-ATTACKED you ===
You feel ribs shatter as Silage's force bolt slams into you.
277H 133V 11991992X 354C [Oplek:Fair] [a fine silver dragon:Fair]
Exits:NESW> <dHP:-48 dX:0>
You stab a fine silver dragon very hard.
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker hits YOU very hard.
263H 133V 11991830X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:-14 dX:162>
=== Silage CAST-ATTACKED you ===
263H 133V 11991830X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
You stab a fine silver dragon extremely hard.
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker MISSED YOU
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:230> stand
You can't do that while sitting.
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0> ^^^ You ^^^
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0> An invisible stalker atte
mpts to unbalance you, but you quickly avoid him.
YOU BASHED -------> Silage <--------
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
<<< Drita >>>> ENTERS FROM ----> the east.
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
Drita leaves west.
263H 133V 11991600X 354C [Oplek:Fair] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
Silage's blow is absorbed by your armor.
YOU MISSED
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker hits YOU hard.
255H 133V 11991600X 354C [Oplek:Bad] [a fine silver dragon:Bad]
Exits:NESW> <dHP:-8 dX:0> kick silage
A Balifor watchman leaves north.
255H 133V 11991600X 354C [Oplek:Bad] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
255H 133V 11991600X 354C [Oplek:Bad] [a fine silver dragon:Bad]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
You stab a fine silver dragon very hard.
A fine silver dragon MISSED YOU
A fine silver dragon MISSED YOU
An invisible stalker barely hits YOU.
251H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-4 dX:176> You are already stand
ing.
251H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0> YOU KICK --------> Silag
e <----------
251H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
a fine silver dragon KICKS YOU
242H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-9 dX:0>
^^^ Silage ^^^
242H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
Silage gives a fine silver dragon an order.
242H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0> bash silage
Silage gives a fine silver dragon an order.
242H 133V 11991424X 354C [Oplek:Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
=== Silage CAST-ATTACKED you ===
You feel ribs shatter as Silage's force bolt slams into you.
203H 133V 11991424X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-39 dX:0>
You stab a fine silver dragon very hard.
A fine silver dragon MISSED YOU
A fine silver dragon slashes YOU very hard.
An invisible stalker MISSED YOU
189H 133V 11991248X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-14 dX:176>
<<< Drita >>>> ENTERS FROM ----> the west.
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
189H 133V 11991248X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
Drita leaves east.
189H 133V 11991248X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0> YOU BASHED -------> Si
lage <--------
189H 133V 11991248X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
You stab a fine silver dragon extremely hard.
A fine silver dragon claws YOU extremely hard.
A fine silver dragon slashes YOU very hard.
An invisible stalker MISSED YOU
162H 133V 11991032X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-27 dX:216> kick silage
An invisible stalker attempts to unbalance you, but you quickly avoid
him.
162H 133V 11991032X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
Silage MISSED YOU
You stab a fine silver dragon very hard.
A fine silver dragon MISSED YOU
A fine silver dragon slashes YOU very hard.
An invisible stalker hits YOU hard.
143H 133V 11990856X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:-19 dX:176> YOU NINJA KICK
stand
The momentum of your kick brings you crashing to the ground.
143H 133V 11990856X 354C [Oplek:V.Bad] [a fine silver dragon:V.Bad]
Exits:NESW> <dHP:0 dX:0>
You stab a fine silver dragon extremely hard.
A fine silver dragon claws YOU extremely hard.
A fine silver dragon MISSED YOU
An invisible stalker hits YOU extremely hard.
^^^ Silage ^^^
105H 133V 11990599X 354C [Oplek:V.Bad] [a fine silver dragon:Awful]
Exits:NESW> <dHP:-38 dX:257>
Silage gives a fine silver dragon an order.
A fine silver dragon MISS KICKED YOU
A fine silver dragon loses his balance and tumbles to the ground.
105H 133V 11990599X 354C [Oplek:V.Bad] [a fine silver dragon:Awful]
Exits:NESW> <dHP:0 dX:0>
=== Silage CAST-ATTACKED you ===
You feel ribs shatter as Silage's force bolt slams into you.
You wish your wounds would stop BLEEDING so much!
62H 133V 11990599X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:-43 dX:0>
An invisible stalker grabs you around the throat and begins to strangle
you.
You wish your wounds would stop BLEEDING so much!
53H 133V 11990599X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:-9 dX:0> ^^^ You ^^^
53H 133V 11990599X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:0 dX:0> rec recall
You do not have that item.
53H 133V 11990599X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:0 dX:0> sta
You are already standing.
53H 133V 11990599X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:0 dX:0>
You -----> MASSACRE <----- a fine silver dragon
A fine silver dragon claws YOU very hard.
You wish your wounds would stop BLEEDING so much!
A fine silver dragon MISSED YOU
An invisible stalker hits YOU very hard.
You wish your wounds would stop BLEEDING so much!
28H 133V 11990302X 354C [Oplek:Awful] [a fine silver dragon:Awful]
Exits:NESW> <dHP:-25 dX:297> flee
You flee head over heels.
Traders Street
This narrow road runs north-south through the port. Cobbles have been
hastily laid in the dirt as befits a prosperous town. Narrow but tall
houses and buildings loom above you, cutting out some of the daylight
that
shows the street traders in their full colours. Small children play in
the
dirt and down small alleys that lead to places of ill-repute. To the
north
lies the main trading square, much banter and joyous laughter are
carried
on the fresh sea breeze.
A feral cat parades her territory and sniffs your leg.
[Got a bit lost, and a moment later, thanks to Mr. Trigger... ]
47H 102V 11992942X 354C Exits:NESW> <dHP:0 dX:0> e
High Street
The street continues in an east-west direction. There is much more
space here. There is no need to dive into the gutter when one of the
many
wooden barrows tries to push through the ever-increasing crowd. You
keep a
watchful eye on the kender nearby.
A fine young silver dragon stands quietly here.
bash silage
Silage the Male Half Elf is standing here. (flying)
. . . has a tough exterior.
47H 101V 11992942X 354C Exits:NESW> <dHP:0 dX:0> YOU BASHED ------->
Silage <--------
47H 101V 11992942X 354C [Oplek:Awful] [Silage:Bad] Exits:NESW> <dHP:0
dX:0> e
47H 101V 11992942X 354C [Oplek:Awful] [Silage:Bad] Exits:NESW> <dHP:0
dX:0> flee
You stab Silage extremely hard.
Silage bruises YOU with his hit.
You wish your wounds would stop BLEEDING so much!
46H 101V 11992942X 354C [Oplek:Awful] [Silage:V.Bad] Exits:NESW>
<dHP:-1 dX:0>
You stab Silage very hard.
Silage MISSED YOU
46H 101V 11992942X 354C [Oplek:Awful] [Silage:V.Bad] Exits:NESW> <dHP:0
dX:0>
Silage gives a fine silver dragon an order.
A fine silver dragon NINJA KICKS YOU
You wish your wounds would stop BLEEDING so much!
40H 101V 11992942X 354C [Oplek:Awful] [Silage:V.Bad] Exits:NESW>
<dHP:-6 dX:0> You can't do that while fighting.
^^^ Silage ^^^
40H 101V 11992942X 354C [Oplek:Awful] [Silage:V.Bad] Exits:NESW> <dHP:0
dX:0> You flee head over heels.
High Street
The street continues in an east-west direction. There is much more
space here. There is no need to dive into the gutter when one of the
many
wooden barrows tries to push through the ever-increasing crowd. You
keep a
watchful eye on the kenders nearby.
40H 100V 11992942X 354C Exits:ESW> <dHP:0 dX:0>
<<< Silage >>>> ENTERS FROM ----> the west.
<<< A fine silver dragon >>>> ENTERS FROM ----> the west.
40H 100V 11992942X 354C Exits:ESW> <dHP:0 dX:0> s
The Jewelers
Many glass cases adorn the room, filled with fine gems and stones that
make the shop seem to be at the centre of a rainbow. They are all
heavily
barred. Stone and crystal cutting tools hang from a small rack above
the
store counter.
A mouse scampers about, scavenging for food and carefully avoiding the
feral cats.
A small and weak looking horse is here awaiting its master.
A small and weak looking horse is here awaiting its master.
An old dwarven jeweller bids you good day and offers his services.
40H 99V 11992942X 354C Exits:N> <dHP:0 dX:0> e
Alas, you cannot go that way...
40H 99V 11992942X 354C Exits:N> <dHP:0 dX:0> n
High Street
The street continues in an east-west direction. There is much more
space here. There is no need to dive into the gutter when one of the
many
wooden barrows tries to push through the ever-increasing crowd. You
keep a
watchful eye on the kenders nearby.
A young kender stands here, looking about curiously.
A fine young silver dragon stands quietly here.
bash silage
Silage the Male Half Elf is standing here. (flying)te
. . . is followed by a hovering ball of light.
40H 98V 11992942X 354C Exits:ESW> <dHP:0 dX:0> YOU BASHED ------->
Silage <--------
40H 98V 11992942X 354C [Oplek:Awful] [Silage:Awful] Exits:ESW> <dHP:0
dX:0> e
e
You -----> MASSACRE <----- Silage
Silage MISSED YOU
40H 98V 11992942X 354C [Oplek:Awful] [Silage:Awful] Exits:ESW> <dHP:0
dX:0> kick
You -----> MASSACRE <----- Silage
========== 0 ===========
ass
== Silage is dead is DEAD ==
A fine silver dragon stops following Silage.
Having no master, a fine silver dragon wanders home.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
