   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   What I really want for 2012 is...

   (*) More classes/Races to play
   ( ) More high level zones
   ( ) Did voting help?
   ( ) Ppl upload Logs
   ( ) Mavlad to play again
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   Retaliate
   [26]View Comments (0)

   POV: Khelend

   Log Rating: 3.0833

   VM agro'd us in CT, This is what happens after

   Hyler flies west.
   Stanley leaves west.
   Hiq flies west.
   Flik flies west.
   Marath flies west.
   You follow Hyler west.
   Guard Post
   A helmet and visor, decorated with the Aurinite crest, lies here.
   A long spear, topped with a red crystal tip, has been left here.
   <Apoc> Marath On, Endurance Incarnate is standing here. (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (flying)
   You see the outline of a life form here, carrying: a crystal shard
   necklace.
   <LOW> Stanley, the First Unknown is standing here.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (flying)
   Teve the Male Kagonesti is standing here, fighting a Gargoyle warrior.
   (flying)
   <VM> Ushi Oni is standing here, fighting a Gargoyle warrior. (flying)
   <VM> Tuuri Muuri is standing here, fighting a Gargoyle warrior.
   (flying)
   <VM> Isiilopatos the Male Hill Dwarf is standing here. (flying)
   (invisible)
   <VM> Mangalore the Marietta Mangler is standing here, fighting a
   Gargoyle
   warrior. (flying)
   A putrid wight is standing here, fighting a Gargoyle warrior.
   <VM> Notol the Male Minotaur is standing here. (flying) (invisible)
   . . . is followed by a hovering ball of light.
   Llab the fearsome blue dragon is standing here, fighting a Gargoyle
   warrior.
   Dynatho the Male Kagonesti is standing here, fighting a Gargoyle
   warrior.
   . . . has a tough exterior.
   Tawon the Male Half Elf is standing here, fighting a Gargoyle warrior.
   <VM> Namas Kaar, Indian Hot andgt laugh we gotta get out man Spicy is
   standing here. (flying) (invisible)
   <VM> Flog the Female Kagonesti is standing here, fighting a Gargoyle
   warrior.
   (flying)
   A Gargoyle warrior is standing here, fighting Dynatho.
   A putrid wight focuses harshly on a Gargoyle warrior and utters some
   strange
   words.
   A Gargoyle warrior seems weaker.
   A Gargoyle warrior stops fighting his opponent and turns to Tuuri
   instead.
   466H 91V 7703068X 9.01% 8535C +60+ Mem:1 Exits:NESW>
   Hyler gives Flog a solid punch in the face.
   466H 91V 7703068X 9.01% 8535C +61+ Mem:1 Exits:NESW>
   466H 91V 7703068X 9.01% 8535C +61+ Mem:1 Exits:NESW>
   Marath annihilates Flog with his stab.
   Flesh burns as Marath's fiery weapon contacts Flog.
   Marath thrashes Flog good, forcing them to the ground.
   466H 91V 7703068X 9.01% 8535C +61+ Mem:1 Exits:NESW>
   Hyler crashes into Flog in a thundering collision, knocking her to the
   ground!
   466H 91V 7703068X 9.01% 8535C +61+ Mem:1 Exits:NESW>
   Notol focuses harshly on a Gargoyle warrior and utters some strange
   words.
   Notol slowly fades into existence.
   A Gargoyle warrior looks shocked as Notol grasps at him.
   A Gargoyle warrior is mortally wounded, and will die soon, if not
   aided.
   466H 91V 7703068X 9.01% 8535C +61+ Mem:1 Exits:NESW>
   Hiq comes out of hiding.
   Hiq massacres Flog with his cleave.
   466H 91V 7703068X 9.01% 8535C +1+ Mem:1 Exits:NESW>ki flog
   You miss Flog with your smite.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [a Gargoyle warrior:Awful]
   [Flog:Fair] Mem:1 Exits:NESW>
   Stanley massacres Flog with his cleave.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [a Gargoyle warrior:Awful]
   [Flog:Fair] Mem:1 Exits:NESW>
   A Gargoyle warrior bleeds profusely from his wounds.
   A Gargoyle warrior is mortally wounded, and will die soon, if not
   aided.
   Stanley massacres Flog with his cleave.
   You smite Flog extremely hard.
   Hiq annihilates Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath annihilates Flog with his stab.
   Flesh burns as Marath's fiery weapon contacts Flog.
   Marath annihilates Flog with his slash.
   Flesh burns as Marath's fiery weapon contacts Flog.
   Marath thrashes Flog good, forcing them to the ground.
   Hyler massacres Flog with his cleave.
   Ushi obliterates a Gargoyle warrior with his slash.
   A Gargoyle warrior is dead! R.I.P.
   The death cry of a Gargoyle warrior echoes from somewhere nearby...
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:Perfect]
   [Flog:V.Bad] Mem:1
   Exits:NESW>
   Teve gets a large pile of coins from the corpse of a Gargoyle warrior.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:Perfect]
   [Flog:V.Bad] Mem:1
   Exits:NESW>
   Isiilopatos focuses on Flog and utters the words, 'heal'.
   Isiilopatos heals Flog.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:Perfect]
   [Flog:V.Good] Mem:1
   Exits:NESW>
   Flik massacres Flog with his whip.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:Perfect]
   [Flog:V.Good] Mem:1
   Exits:NESW>
   Dynatho misses Stanley with his stab.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:Perfect]
   [Flog:V.Good] Mem:1
   Exits:NESW> c 'si
   Mangalore cleaves Stanley extremely hard.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:V.Good] Mem:1
   Exits:NESW> c 'sil'
   Marath roars.
   Teve shrieks in terror!
   Teve panics, and attempts to flee.
   Teve flies east.
   Ushi shrieks in terror!
   Ushi panics, and attempts to flee.
   Ushi flies west.
   Tuuri shrieks in terror!
   Tuuri panics, and attempts to flee.
   Tuuri flies west.
   Isiilopatos shrieks in terror!
   Isiilopatos panics, and attempts to flee.
   Isiilopatos flies south.
   Mangalore shrieks in terror!
   Mangalore panics, and attempts to flee.
   Mangalore flies east.
   Notol shrieks in terror!
   Notol panics, and attempts to flee.
   Notol flies south.
   Dynatho shrieks in terror!
   Dynatho panics, and attempts to flee.
   Dynatho leaves north.
   Namas shrieks in terror!
   Namas panics, and attempts to flee.
   Namas flies east.
   Flog shrieks in terror!
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:V.Good] Mem:1
   Exits:NESW> c 'sil'is
   Flog quickly steps aside, avoiding Hiq's headbutt.
   466H 91V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:V.Good] Mem:1
   Exits:NESW> c 'sil'isi
   Flik massacres Flog with his whip.
   Flog misses Stanley with her slash.
   Flog crushes Stanley very hard.
   Stanley massacres Flog with his cleave.
   You smite Flog extremely hard.
   Hiq misses Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath obliterates Flog with his stab.
   Flesh burns as Marath's fiery weapon contacts Flog.
   Marath massacres Flog with his slash.
   Flesh burns as Marath's fiery weapon contacts Flog.
   Hyler annihilates Flog with his cleave.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c 'si
   Stanley barrels into Flog, knocking her to the ground.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> ch
   You utter the words, 'hold person'
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW>
   Namas flies in from the east.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW>
   Teve flies in from the east.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW>
   Flik leaps past Flog, unbalancing them.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW>
   Flik sends a swarm of flying piranha at Flog.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:1
   Exits:NESW>
   Namas slowly fades into existence.
   Namas misses Stanley with his bludgeon.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:1
   Exits:NESW>
   Hiq growls.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:1
   Exits:NESW>
   Isiilopatos flies in from the south.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:1
   Exits:NESW>
   Hyler stumbles and falls while trying to bash Isiilopatos.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:1
   Exits:NESW> ge
   Isiilopatos focuses on Flog and utters the words, 'heal'.
   Isiilopatos heals Flog.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:V.Good] Mem:1
   Exits:NESW>
   Namas bludgeons Stanley very hard.
   Flik massacres Flog with his whip.
   Flog slashes Stanley very hard.
   Flog misses Stanley with her crush.
   Stanley massacres Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath drives his sword to an opening in Flog's armor.
   Marath obliterates Flog with his stab.
   Marath annihilates Flog with his slash.
   Marath thrashes Flog good, forcing them to the ground.
   Hyler annihilates Flog with his cleave.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c
   Dynatho arrives from the north.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c '
   Tuuri flies in from the west.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c '
   Dynatho misses Hyler with his stab.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c 'harm'
   Mangalore flies in from the east.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> c 'harm'
   Tawon massacres Hyler with his claw.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good]
   [Flog:Fair] Mem:1
   Exits:NESW> You utter the words, 'harm'
   You grab Flog, who screams in pain.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW>
   Marath gives a glowing scroll of recall to Stanley.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW>
   Mangalore massacres Hyler with his cleave.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW>
   Tuuri massacres Hyler with his bludgeon.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW>
   Teve gives Stanley a solid punch in the face.
   Flik dives into Flog and savagely bites her, tearing a huge chunk from
   her
   flesh.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW>
   Teve stumbles and falls while trying to bash Stanley.
   466H 136V 7703068X 9.01% 8535C [Me:Perfect] [Stanley:V.Good] [Flog:Bad]
   Mem:2
   Exits:NESW> !
   Flog bleeds profusely from her wounds.
   Teve slashes Stanley very hard.
   Tuuri massacres Hyler with his bludgeon.
   Mangalore massacres Hyler with his cleave.
   Mangalore misses Hyler with his claw.
   Tawon misses Hyler with his claw.
   Tawon massacres Hyler with his whip.
   Dynatho misses Hyler with his stab.
   Isiilopatos bludgeons Hyler very hard.
   Namas bludgeons Stanley very hard.
   Flik massacres Flog with his whip.
   Flog slashes Stanley very hard.
   Flog crushes Stanley hard.
   Stanley massacres Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath obliterates Flog with his stab.
   Marath thrashes Flog good, forcing them to the ground.
   Marath massacres Flog with his slash.
   Hyler massacres Flog with his cleave.
   Flog is mortally wounded, and will die soon, if not aided.
   466H 136V 7703068X 9.01% 8535C +15+ [Me:Perfect] [Flog:Awful] Mem:2
   Exits:NESW>
   Isiilopatos focuses on Flog and utters the words, 'heal'.
   Isiilopatos heals Flog.
   466H 136V 7703068X 9.01% 8535C +16+ [Me:Perfect] [Flog:V.Good] Mem:2
   Exits:NESW>
   With a crazed scream, Stanley jumps into the fray and attacks like a
   wild
   person.
   Stanley runs circles around Teve, hitting him from all sides.
   Stanley flails wildly at Namas with his axe, but hits only air.
   Stanley flails wildly at Tawon with his axe, but hits only air.
   Stanley pulls Tawon's arm up and punches him in the side.
   466H 136V 7703068X 9.01% 8535C +16+ [Me:Perfect] [Flog:V.Good] Mem:2
   Exits:NESW>You
   utter the words, 'harm'
   You grab Flog, who screams in pain.
   Dynatho strikes at Hyler, but misses completely.
   466H 136V 7703068X 9.01% 8535C +17+ [Me:Perfect] [Flog:Good] Mem:2
   Exits:NESW>
   Flog attacks with lightning fast series of attacks that leaves you
   defenseless.
   Mangalore sends a swarm of flying piranha at Hyler.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   466H 136V 7703068X 9.01% 8535C +18+ [Me:Perfect] [Flog:Good] Mem:2
   Exits:NESW>
   Tawon suddenly lunges forward, slamming his skull into Hyler's face
   with a
   sickening crunch.
   466H 136V 7703068X 9.01% 8535C +19+ [Me:Perfect] [Flog:Good] Mem:2
   Exits:NESW>
   Tuuri focuses on Flog and utters some strange words.
   Flog's wounds begin to heal.
   466H 136V 7703068X 9.01% 8535C +19+ [Me:Perfect] [Flog:Good] Mem:2
   Exits:NESW>
   Flog bleeds profusely from her wounds.
   Flog misses you with her slash.
   Flog barely crushes YOU.
   Teve misses Stanley with his slash.
   Mangalore massacres Hyler with his cleave.
   Mangalore claws Hyler very hard.
   Tawon claws Hyler extremely hard.
   Tawon misses Hyler with his whip.
   Dynatho misses Hyler with his stab.
   Namas misses Stanley with his bludgeon.
   Flik whips Flog extremely hard.
   Stanley misses Flog with his cleave.
   Hiq misses Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath annihilates Flog with his stab.
   Marath annihilates Flog with his slash.
   Hyler massacres Flog with his cleave.
   Hyler stands up.
   463H 136V 7703068X 9.01% 8535C +19+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c
   Hiq suddenly lunges forward, slamming his skull into Flog's face with a
   sickening crunch.
   463H 136V 7703068X 9.01% 8535C +20+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>
   Namas focuses harshly on Stanley and utters some strange words.
   Flesh burns as Namas enshrouds Stanley in a cloak of flames.
   463H 136V 7703068X 9.01% 8535C +20+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'si
   Hyler crashes into Isiilopatos in a thundering collision, knocking him
   to the
   ground!
   463H 136V 7703068X 9.01% 8535C +20+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'sil'
   Stanley barrels into Flog, knocking her to the ground.
   463H 136V 7703068X 9.01% 8535C +20+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'sil'
   Flik sends a swarm of flying piranha at Flog.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   A piranha tears into Flog's flesh.
   463H 136V 7703068X 9.01% 8535C +21+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'sil'isii
   Dynatho strikes at Hyler, but misses completely.
   463H 136V 7703068X 9.01% 8535C +22+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'sil'isiilosp
   Teve stands up.
   463H 136V 7703068X 9.01% 8535C +23+ [Me:V.Good] [Flog:Fair] Mem:2
   Exits:NESW>c 'sil'isiilopa
   Flog bleeds profusely from her wounds.
   Flog slashes YOU hard.
   Flog crushes YOU hard.
   Teve slashes Stanley extremely hard.
   Tuuri bludgeons Hyler extremely hard.
   Hyler stumbles back as Tuuri slams his staff on his face.
   Tuuri bludgeons Hyler extremely hard.
   Mangalore cleaves Hyler extremely hard.
   Mangalore claws Hyler very hard.
   Tawon misses Hyler with his claw.
   Tawon whips Hyler very hard.
   Dynatho misses Hyler with his stab.
   Isiilopatos misses Hyler with his bludgeon.
   Flik massacres Flog with his whip.
   Stanley annihilates Flog with his cleave.
   You smite Flog extremely hard.
   Hiq misses Flog with his cleave.
   Hiq massacres Flog with his cleave.
   Marath annihilates Flog with his stab.
   Marath annihilates Flog with his slash.
   Hyler cleaves Flog extremely hard.
   Tuuri wiggles his fingers as he outlines Hyler's head in the air.
   448H 136V 7703068X 9.01% 8535C +23+ [Me:V.Good] [Flog:V.Bad] Mem:2
   Exits:NESW>c 'sil'isiilopatos
   Namas focuses harshly on Stanley and utters some strange words.
   Flesh burns as Namas enshrouds Stanley in a cloak of flames.
   448H 136V 7703068X 9.01% 8535C +24+ [Me:V.Good] [Flog:V.Bad] Mem:2
   Exits:NESW>You
   utter the words, 'silence'
   Isiilopatos suddenly becomes very quiet.
   448H 136V 7703068X 9.01% 8535C +24+ [Me:V.Good] [Flog:V.Bad] Mem:3
   Exits:NESW>
   Flik dives into Flog and savagely bites her, tearing a huge chunk from
   her
   flesh.
   448H 136V 7703068X 9.01% 8535C +25+ [Me:V.Good] [Flog:V.Bad] Mem:3
   Exits:NESW>c
   Teve crashes into Hyler in a thundering collision, knocking him to the
   ground!
   448H 136V 7703068X 9.01% 8535C +26+ [Me:V.Good] [Flog:V.Bad] Mem:3
   Exits:NESW>c
   Marath gets a granite spear from the corpse of a Gargoyle warrior.
   Marath gets a Gargoyle helmet and visor from the corpse of a Gargoyle
   warrior.
   Marath gets a medallion of the moon from the corpse of a Gargoyle
   warrior.
   448H 136V 7703068X 9.01% 8535C +26+ [Me:V.Good] [Flog:V.Bad] Mem:3
   Exits:NESW>g
   Dynatho attempts to focus on Hyler and fails horribly.
   448H 136V 7703068X 9.01% 8535C +27+ [Me:V.Good] [Flog:V.Bad] Mem:3
   Exits:NESW>get all flog
   Flog bleeds profusely from her wounds.
   You return to your normal fighting style.
   Hyler staggers about confused!
   Flog misses you with her slash.
   Flog misses you with her crush.
   Teve misses Stanley with his slash.
   Tuuri massacres Hyler with his bludgeon.
   Mangalore cleaves Hyler extremely hard.
   Mangalore misses Hyler with his claw.
   Tawon misses Hyler with his claw.
   Tawon whips Hyler extremely hard.
   Dynatho misses Hyler with his stab.
   Isiilopatos bludgeons Hyler very hard.
   Flik massacres Flog with his whip.
   Stanley annihilates Flog with his cleave.
   Hiq cleaves Flog extremely hard.
   Hiq massacres Flog with his cleave.
   Marath annihilates Flog with his stab.
   Marath massacres Flog with his slash.
   You receive 825000 experience.
   Flog is dead! R.I.P.
   Marath thrashes Flog good, forcing them to the ground.
   The death cry of Flog echoes from somewhere nearby...
   Flog sinks gently to the ground.
   Namas stops following Flog.
   Flog now follows Namas.
   Namas is the new leader of Flog's group.
   Flog stops following Namas.
   Dynatho stops following Flog.
   Dynatho now follows Namas.
   Notol stops following Flog.
   Notol now follows Namas.
   Mangalore stops following Flog.
   Mangalore now follows Namas.
   Isiilopatos stops following Flog.
   Isiilopatos now follows Namas.
   Tuuri stops following Flog.
   Tuuri now follows Namas.
   Ushi stops following Flog.
   Ushi now follows Namas.
   Teve stops following Flog.
   Teve now follows Namas.
   Llab the fearsome blue dragon stops following Flog.
   Llab the fearsome blue dragon transcends this world and enters another
   plane.
   Marath gets a glistening steel rod from the corpse of Flog.
   Marath gets a granite sword from the corpse of Flog.
   Marath gets a charred metal wrist guard from the corpse of Flog.
   Marath gets a charred metal wrist guard from the corpse of Flog.
   Marath gets a navel ring from the corpse of Flog.
   Marath gets a pair of ergothian battle armor vambraces from the corpse
   of Flog.
   Marath gets a pair of elfin gauntlets from the corpse of Flog.
   Marath gets a pair of dwarven boots from the corpse of Flog.
   Marath gets a black veil from the corpse of Flog.
   Marath gets a suit of ergothian battle armor from the corpse of Flog.
   Marath gets a warlock's cloak from the corpse of Flog.
   Marath gets a burned black cloak from the corpse of Flog.
   Marath gets a green metal ring from the corpse of Flog.
   Marath gets a green jade ring from the corpse of Flog.
   Marath gets a very large pile of coins from the corpse of Flog.
   Marath gets the celestial key from the corpse of Flog.
   Marath gets a pair of dark glasses from the corpse of Flog.
   Marath gets a gleaming silver die from the corpse of Flog.
   Marath gets a dried piece of octopus tentacle from the corpse of Flog.
   Marath gets a deep violet dragon tear from the corpse of Flog.
   Marath gets a pair of albino bat wings from the corpse of Flog.
   448H 136V 6878068X 9.01% 8535C +28+ Mem:3 Exits:NESW>ge
   Tawon suddenly lunges forward, slamming his skull into Hyler's face
   with a
   sickening crunch.
   448H 136V 6878068X 9.01% 8535C +28+ Mem:3 Exits:NESW>get al
   Tuuri focuses harshly on Hyler and utters the words, 'soul leech'.
   Hyler shudders with agony as pain lashes and clamps down on his soul.
   448H 136V 6878068X 9.01% 8535C +28+ Mem:3 Exits:NESW>get all fl
   Marath divides 7860 coins equally among the group members present.
   Isiilopatos stands up.
   448H 136V 6878068X 9.01% 9845C +29+ Mem:3 Exits:NESW>get all flog
   You get a sharp dagger from the
   corpse of Flog.
   You get an absolutely perfect diamond from the corpse of Flog.
   You get a hand-held sundial from the corpse of Flog.
   You get the grey robes of the Thorn from the corpse of Flog.
   You get a small purse from the corpse of Flog.
   You get a shining silver plate from the corpse of Flog.
   You get some alfalfa sprouts from the corpse of Flog.
   You get a small wooden chest from the corpse of Flog.
   You get a glowing scroll of recall from the corpse of Flog.
   You get a scroll of recall from the corpse of Flog.
   You get a scroll of recall from the corpse of Flog.
   You get a scroll of recall from the corpse of Flog.
   You get some bristles from a displacer beast from the corpse of Flog.
   You get a glowing scroll of recall from the corpse of Flog.
   You get a pair of black ice arm guards from the corpse of Flog.
   You get a weaponsmith's hammer from the corpse of Flog.
   You get an obsidian hammer from the corpse of Flog.
   You get a bright ball of light from the corpse of Flog.
   You get a waterskin from the corpse of Flog.
   You get a waterskin from the corpse of Flog.
   You get a waterskin from the corpse of Flog.
   You get a waterskin from the corpse of Flog.
   448H 136V 6878068X 9.01% 9845C +29+ Mem:3 Exits:NESW>!
   The corpse doesn't seem to have
   what you are looking for.
   With a crazed scream, Stanley jumps into the fray and attacks like a
   wild
   person.
   Stanley clonks Teve over the head, nearly splitting open his skull.
   Stanley tucks away his axe, quickly spins, and hits Teve in the chest.
   Stanley boxes Namas's ears with two of his frantic swings.
   Stanley swings mightily at Isiilopatos's head, nearly sending him to
   Lunitari.
   448H 136V 6878068X 9.01% 9845C +29+ Mem:3 Exits:NESW>Searching through
   the remains, you find:
   corpse (here) :
   448H 136V 6878068X 9.01% 9845C +29+ Mem:3 Exits:NESW>The corpse doesn't
   seem to have
   what you are looking for.
   448H 136V 6878068X 9.01% 9845C +29+ Mem:3 Exits:NESW>c
   Marath massacres Teve with his stab.
   448H 136V 6878068X 9.01% 9845C +30+ Mem:3 Exits:NESW>what you are
   looking for.
   Flik misses Mangalore with his whip.
   448H 136V 6878068X 9.01% 9845C +30+ Mem:3 Exits:NESW>c
   Hiq comes out of hiding.
   Hiq massacres Mangalore with his cleave.
   448H 136V 6878068X 9.01% 9845C +30+ Mem:3 Exits:NESW>ass hyler
   You smite Mangalore extremely
   hard.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:V.Bad]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Dynatho attempts to focus on Hyler and fails horribly.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:V.Bad]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Namas focuses harshly on Stanley and utters some strange words.
   Flesh burns as Namas enshrouds Stanley in a cloak of flames.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:V.Bad]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Hyler staggers about confused!
   Hyler cleaves Tawon extremely hard.
   You smite Mangalore extremely hard.
   Hiq misses Mangalore with his cleave.
   Hiq cleaves Mangalore extremely hard.
   Flik whips Mangalore extremely hard.
   Marath annihilates Teve with his stab.
   Marath thrashes Teve good, forcing them to the ground.
   Marath annihilates Teve with his slash.
   Teve deflects part of Stanley's blow with his shield.
   Stanley massacres Teve with his cleave.
   Teve misses Stanley with his slash.
   Mangalore massacres Hyler with his cleave.
   Mangalore claws Hyler extremely hard.
   Tawon massacres Hyler with his claw.
   Tawon whips Hyler extremely hard.
   Dynatho misses Hyler with his stab.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Bad] Mem:3
   Exits:NESW>
   Mangalore sends a swarm of flying piranha at Hyler.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   A piranha tears into Hyler's flesh.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Bad] Mem:3
   Exits:NESW> heal hyler
   Tuuri focuses on Mangalore and utters the words, 'cure critical'.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW> heal hyler
   Stanley charges at Teve, but he managed to move away.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Teve stands up.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Hiq unsuccessfully tries to save Hyler.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Flik heroically rescues Hyler.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Marath unsuccessfully tries to save Hyler.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Awful]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Hyler staggers about confused!
   Dynatho misses Flik with his stab.
   Flik massacres Dynatho with his whip.
   Hyler massacres Tawon with his cleave.
   You smite Mangalore extremely hard.
   Hiq massacres Mangalore with his cleave.
   Hiq massacres Mangalore with his cleave.
   Marath massacres Teve with his stab.
   Marath thrashes Teve good, forcing them to the ground.
   Marath annihilates Teve with his slash.
   Stanley annihilates Teve with his cleave.
   Teve slashes Stanley extremely hard.
   Mangalore massacres Hyler with his cleave.
   Mangalore misses Hyler with his claw.
   Tawon claws Hyler extremely hard.
   Tawon whips Hyler hard.
   Hyler is mortally wounded, and will die soon, if not aided.
   Namas bludgeons Stanley hard.
   448H 136V 6878068X 9.01% 9845C [Me:V.Good] [Hyler:Dying]
   [Mangalore:Fair] Mem:3
   Exits:NESW> You utter the words, 'heal'
   You heal Hyler.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:V.Good]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Hyler tells your group 'heal me'
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:V.Good]
   [Mangalore:Fair] Mem:3
   Exits:NESW>
   Isiilopatos panics, and attempts to flee.
   Isiilopatos flies north.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:V.Good]
   [Mangalore:Fair] Mem:3
   Exits:NESW> gr
   Hiq tells your group 'HEAL HYLER'
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:V.Good]
   [Mangalore:Fair] Mem:3
   Exits:NESW> group
   Flik heroically rescues Hyler.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:Perfect]
   [Mangalore:Fair] Mem:3
   Exits:NESW> group
   Mangalore cleaves Flik extremely hard.
   Mangalore misses Flik with his claw.
   Flik whips Mangalore very hard.
   Dynatho misses Flik with his stab.
   Hiq massacres Mangalore with his cleave.
   Hiq cleaves Mangalore extremely hard.
   Marath drives his sword to an opening in Teve's armor.
   Marath annihilates Teve with his stab.
   Marath thrashes Teve good, forcing them to the ground.
   Marath misses Teve with his slash.
   Stanley annihilates Teve with his cleave.
   Teve slashes Stanley extremely hard.
   Tuuri bludgeons Hyler extremely hard.
   Tawon misses Hyler with his claw.
   Tawon misses Hyler with his whip.
   Namas misses Stanley with his bludgeon.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW>
   Tawon suddenly lunges forward, slamming his skull into Hyler's face
   with a
   sickening crunch.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW> Your group of 6 members consists of:
   Member Hits Move Position Fly Inv Water iMT Here Light
   Mem
   -----------------------------------------------------------------------
   ----------
   Hyler v.good rested fighting N N Y Y Y 0 0
   Stanley fair rested fighting N N N Y Y 1 0
   Hiq perfect rested fighting Y N N Y Y 1 0
   Flik v.good rested fighting Y N Y Y Y 0 0
   Marath perfect rested fighting Y N N Y Y 0 0
   Khelend v.good rested fighting Y N N Y Y 1 3
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW>
   Teve stands up.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW>
   Teve panics, and attempts to flee.
   Teve flies north.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW> heal sta
   Isiilopatos flies in from the north.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW> heal stanley
   Stanley unsuccessfully tries to save Hyler.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW> heal stanley
   Dynatho focuses harshly on Isiilopatos and utters the words, 'dispel
   magic'.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:3
   Exits:NESW> You utter the words, 'heal'
   You heal Stanley.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:4
   Exits:NESW>
   Flik leaps past Mangalore, unbalancing them.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Bad] Mem:4
   Exits:NESW>
   Stanley massacres Namas with his cleave.
   Hyler's mightly cleave almost cuts Tuuri in two.
   Hyler massacres Tuuri with his cleave.
   Mangalore cleaves Flik extremely hard.
   Mangalore misses Flik with his claw.
   Flik massacres Mangalore with his whip.
   Dynatho stabs Flik hard.
   Hiq massacres Mangalore with his cleave.
   Hiq massacres Mangalore with his cleave.
   Tuuri bludgeons Hyler extremely hard.
   Tawon misses Hyler with his claw.
   Tawon whips Hyler very hard.
   Namas misses Stanley with his bludgeon.
   Flik sends a swarm of flying piranha at Mangalore.
   A piranha tears into Mangalore's flesh.
   A piranha tears into Mangalore's flesh.
   A piranha tears into Mangalore's flesh.
   A piranha tears into Mangalore's flesh.
   A piranha tears into Mangalore's flesh.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:V.Bad] Mem:4
   Exits:NESW>
   Marath massacres Mangalore with his stab.
   Marath thrashes Mangalore good, forcing them to the ground.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW>
   Namas focuses harshly on Stanley and utters some strange words.
   Flesh burns as Namas enshrouds Stanley in a cloak of flames.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW> c 'harm'
   Hyler crashes into Tuuri in a thundering collision, knocking him to the
   ground!
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW> You utter the words, 'harm'
   You grab Mangalore, who screams in pain.
   Stanley heroically rescues Hyler.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW>
   Mangalore quickly steps aside, avoiding Hiq's headbutt.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW>
   Mangalore stands up.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Flik:V.Good]
   [Mangalore:Awful] Mem:4
   Exits:NESW>
   Mangalore panics, and attempts to flee.
   Mangalore flies south.
   448H 136V 6868168X 9.01% 9845C +48+ Mem:4 Exits:NESW>
   Dynatho gracefully steps aside as Flik attacks!
   Tawon claws Stanley.
   Tawon misses Stanley with his whip.
   Stanley massacres Tawon with his cleave.
   Hyler annihilates Tuuri with his cleave.
   Dynatho misses Flik with his stab.
   Tuuri bludgeons Hyler hard.
   448H 136V 6868168X 9.01% 9845C +48+ Mem:4 Exits:NESW>
   Flik dives into Dynatho and savagely bites him, tearing a huge chunk
   from his
   flesh.
   448H 136V 6868168X 9.01% 9845C +49+ Mem:4 Exits:NESW>s a
   Marath obliterates Tuuri with his stab.
   448H 136V 6868168X 9.01% 9845C +49+ Mem:4 Exits:NESW>s a
   Dynatho focuses on Isiilopatos and utters some strange words.
   448H 136V 6868168X 9.01% 9845C +50+ Mem:4 Exits:NESW>
   Hiq flies south.
   Stanley charges at Tawon, but he managed to move away.
   448H 136V 6868168X 9.01% 9845C +51+ Mem:4 Exits:NESW>ass
   You attempt to assist Hyler.
   You _MASSACRE_ Tuuri with your smite.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:Fair]
   Mem:4
   Exits:NESW>
   Mangalore flies in from the south.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:Fair]
   Mem:4
   Exits:NESW>
   Dynatho bleeds profusely from his wounds.
   You smite Tuuri extremely hard.
   Marath annihilates Tuuri with his stab.
   Marath annihilates Tuuri with his slash.
   Flik whips Dynatho hard.
   Tawon misses Stanley with his claw.
   Tawon misses Stanley with his whip.
   Stanley cleaves Tawon extremely hard.
   Hyler massacres Tuuri with his cleave.
   Dynatho misses Flik with his stab.
   Tuuri bludgeons Hyler very hard.
   Hyler deflects part of Tuuri's blow with his shield.
   Hyler swings his shield in an arc and smacks Tuuri in the head.
   Tuuri bludgeons Hyler extremely hard.
   Namas misses Stanley with his bludgeon.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW>
   Mangalore cleaves Stanley extremely hard.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW>
   Tawon suddenly lunges forward, slamming his skull into Stanley's face
   with a
   sickening crunch.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW>
   Flik yawns.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW>
   Flik says 'noobs'
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW> c '
   Hiq flies in from the south.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW> c 'har
   Isiilopatos slowly fades into existence.
   Isiilopatos bludgeons Hyler hard.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW>
   Dynatho strikes at Flik, but misses completely.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW> c 'harm'
   Teve flies in from the north.
   448H 136V 6868168X 9.01% 9845C [Me:V.Good] [Hyler:Good] [Tuuri:V.Bad]
   Mem:4
   Exits:NESW> c 'harm'
   Tuuri stops using a dolphin bone staff.
   Tuuri grabs a glowing scroll of recall.
   Tuuri recites a glowing scroll of recall.
   Tuuri disappears.
   448H 136V 6868168X 9.01% 9845C +55+ Mem:4 Exits:NESW>c 'harm'
   Marath drives his sword to an opening in Tawon's armor.
   Marath massacres Tawon with his stab.
   448H 136V 6868168X 9.01% 9845C +57+ Mem:4 Exits:NESW>cDynatho bleeds
   profusely from
   his wounds.
   Marath massacres Tawon with his stab.
   Marath massacres Tawon with his slash.
   Hyler massacres Isiilopatos with his cleave.
   Isiilopatos misses Hyler with his bludgeon.
   Mangalore cleaves Stanley very hard.
   Mangalore misses Stanley with his claw.
   Dynatho deflects part of Flik's blow with his shield.
   Flik whips Dynatho hard.
   Tawon misses Stanley with his claw.
   Tawon misses Stanley with his whip.
   Stanley massacres Tawon with his cleave.
   Dynatho misses Flik with his stab.
   Namas misses Stanley with his bludgeon.
   Who should the spell be cast upon?
   448H 136V 6868168X 9.01% 9845C +57+ Mem:4 Exits:NESW>ch te
   Flik sends a swarm of flying piranha at Dynatho.
   A piranha tears into Dynatho's flesh.
   A piranha tears into Dynatho's flesh.
   A piranha tears into Dynatho's flesh.
   A piranha tears into Dynatho's flesh.
   A piranha tears into Dynatho's flesh.
   448H 136V 6868168X 9.01% 9845C +57+ Mem:4 Exits:NESW>ch teve
   Hiq comes out of hiding.
   Hiq massacres Mangalore with his cleave.
   Mangalore is dead! R.I.P.
   448H 136V 6868168X 9.01% 9845C +58+ Mem:4 Exits:NESW>
   The death cry of Mangalore echoes from somewhere nearby...
   Mangalore stops following Namas.
   448H 136V 6868168X 9.01% 9845C +58+ Mem:4 Exits:NESW>ch teve
   Hyler gets a very large pile of coins from the corpse of Mangalore.
   448H 136V 6868168X 9.01% 9845C +58+ Mem:4 Exits:NESW>You utter the
   words, 'hold
   person'
   448H 136V 6868168X 9.01% 9845C +58+ Mem:5 Exits:NESW>
   Hyler panics, and attempts to flee.
   Hyler leaves east.
   448H 136V 6868168X 9.01% 9845C +59+ Mem:5 Exits:NESW>
   Teve is zapped by a demonic claw and instantly drops it.
   Teve gets a woodsman's axe from the corpse of Mangalore.
   Teve gets a black wrist band from the corpse of Mangalore.
   Teve gets a runed brass wristguard from the corpse of Mangalore.
   Teve is zapped by sash of the red thorn and instantly drops it.
   Teve gets an elongated squid head quiver from the corpse of Mangalore.
   Teve gets a set of face rippers from the corpse of Mangalore.
   Teve gets a pair of dwarven boots from the corpse of Mangalore.
   Teve gets a pair of dwarven greaves from the corpse of Mangalore.
   Teve gets the chieftain's headdress from the corpse of Mangalore.
   Teve gets a moss pelt from the corpse of Mangalore.
   448H 136V 6868168X 9.01% 9845C +59+ Mem:5 Exits:NESW>get
   Stanley cheers loudly.
   448H 136V 6868168X 9.01% 9845C +60+ Mem:5 Exits:NESW>ge
   With a crazed scream, Stanley jumps into the fray and attacks like a
   wild
   person.
   You stand in amazement as Stanley takes furious swings at Dynatho,
   striking him
   all over.
   Stanley's blow glances off Dynatho's skull.
   Stanley flails wildly at Namas with his axe, but hits only air.
   448H 136V 6868168X 9.01% 9845C +61+ Mem:5 Exits:NESW>
   Dynatho bleeds profusely from his wounds.
   Marath massacres Tawon with his stab.
   Marath thrashes Tawon good, forcing them to the ground.
   Marath massacres Tawon with his slash.
   Flik whips Dynatho very hard.
   Tawon misses Stanley with his claw.
   Tawon misses Stanley with his whip.
   Stanley massacres Tawon with his cleave.
   Dynatho misses Flik with his stab.
   Namas misses Stanley with his bludgeon.
   448H 136V 6868168X 9.01% 9845C +61+ Mem:5 Exits:NESW>!
   Isiilopatos gets a thin gold necklace from the corpse of Mangalore.
   Isiilopatos gets a bullywug medallion from the corpse of Mangalore.
   Isiilopatos gets a silver and gold banded ring from the corpse of
   Mangalore.
   Isiilopatos gets a golden dwarven ring from the corpse of Mangalore.
   Isiilopatos gets a crytic stone hand axe from the corpse of Mangalore.
   Isiilopatos gets a bright ball of light from the corpse of Mangalore.
   Isiilopatos gets a small wooden chest from the corpse of Mangalore.
   Isiilopatos gets a cloth belt pack from the corpse of Mangalore.
   Isiilopatos gets a glowing scroll of recall from the corpse of
   Mangalore.
   Isiilopatos gets a milky potion of see invisible from the corpse of
   Mangalore.
   448H 136V 6868168X 9.01% 9845C +61+ Mem:5 Exits:NESW>
   Namas stops using a mithril cube.
   Namas grabs a glowing scroll of recall.
   Namas recites a glowing scroll of recall.
   Namas disappears.
   448H 136V 6868168X 9.01% 9845C +1+ Mem:5 Exits:NESW>
   Marath gets a creamy potion of flight from the corpse of Mangalore.
   448H 136V 6868168X 9.01% 9845C +1+ Mem:5 Exits:NESW>Hiq tells your
   group 'HAHA'
   You utter the words, 'hold person'
   448H 136V 6868168X 9.01% 9845C +1+ Mem:5 Exits:NESW>
   Hiq comes out of hiding.
   Hiq massacres Tawon with his cleave.
   448H 136V 6868168X 9.01% 9845C +2+ Mem:5 Exits:NESW>
   Flik dives into Dynatho and savagely bites him, tearing a huge chunk
   from his
   flesh.
   448H 136V 6868168X 9.01% 9845C +2+ Mem:5 Exits:NESW>
   Hyler arrives from the south.
   448H 136V 6868168X 9.01% 9845C +3+ Mem:5 Exits:NESW>
   Isiilopatos flies north.
   448H 136V 6868168X 9.01% 9845C +3+ Mem:5 Exits:NESW>cb
   Teve flies west.
   448H 136V 6868168X 9.01% 9845C +4+ Mem:5 Exits:NESW>cb t
   Dynatho bleeds profusely from his wounds.
   Hiq massacres Tawon with his cleave.
   Hiq cleaves Tawon hard.
   Marath drives his sword to an opening in Tawon's armor.
   Marath massacres Tawon with his stab.
   Marath massacres Tawon with his slash.
   Dynatho deflects part of Flik's blow with his shield.
   Dynatho gracefully steps aside as Flik attacks!
   Tawon claws Stanley very hard.
   Tawon whips Stanley very hard.
   Stanley massacres Tawon with his cleave.
   Tawon is stunned, but will likely regain consciousness again.
   Dynatho misses Flik with his stab.
   448H 136V 6868168X 9.01% 9845C +4+ Mem:5 Exits:NESW>cb te
   Hyler leaves north.
   You follow Hyler north.
   The Celestial Temple
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   448H 135V 6868168X 9.01% 9845C +4+ Mem:5 Exits:NESW>cb teve
   Your blood freezes as you hear someone's death cry.
   448H 135V 6868168X 9.01% 9845C +5+ Mem:5 Exits:NESW>
   Hyler leaves south.
   You follow Hyler south.
   Guard Post
   The corpse of Tawon is lying here.
   A vibrantly colored red sash sits here.
   The claw of a demon has been severed at the wrist and left here for
   worse.
   The corpse of Mangalore is lying here.
   Chiseled from a light grey stone, you see a granite dagger.
   Before you rest a long spear cut from a dark grey stone.
   A dark pair of knee-high boots has been left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here. [2]
   A pair of granite-like gloves have been left here to collect dust.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here.
   Some patches of golden brown hair are scattered on the ground.
   A flower whose blossom looks reminiscent of a fine lace has been
   plucked and
   left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A pair of granite-like gloves have been left here to collect dust.
   The corpse of Flog is lying here.
   The corpse of a Gargoyle warrior is lying here.
   A helmet and visor, decorated with the Aurinite crest, lies here.
   A long spear, topped with a red crystal tip, has been left here.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <Apoc> Hiq the Stick is standing here. (aggressor) (flying)
   Dynatho the Male Kagonesti is standing here, fighting Flik. (aggressor)
   . . . is cowering in fear.
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here,
   fighting
   Dynatho. (aggressor) (flying)
   <LOW> Stanley, the First Unknown is standing here. (aggressor)
   A putrid wight watches maggots writhe within its abdominal cavity.
   448H 134V 6868168X 9.01% 9845C +5+ Mem:5 Exits:NESW>nWho should the
   spell be cast
   upon?
   Dynatho panics, and attempts to flee.
   Dynatho leaves east.
   448H 134V 6868168X 9.01% 9845C +6+ Mem:5 Exits:NESW>n a
   The Celestial Temple
   448H 133V 6868168X 9.01% 9845C +6+ Mem:5 Exits:NESW>sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <Apoc> Hiq the Stick is standing here. (aggressor) (flying)
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (aggressor)
   (flying)
   <LOW> Stanley, the First Unknown is standing here. (aggressor)
   A putrid wight watches maggots writhe within its abdominal cavity.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   448H 133V 6868168X 9.01% 9845C +7+ Mem:5 Exits:NESW>s
   eGuard Post
   The corpse of Tawon is lying here.
   A vibrantly colored red sash sits here.
   The claw of a demon has been severed at the wrist and left here for
   worse.
   The corpse of Mangalore is lying here.
   Chiseled from a light grey stone, you see a granite dagger.
   Before you rest a long spear cut from a dark grey stone.
   A dark pair of knee-high boots has been left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here. [2]
   A pair of granite-like gloves have been left here to collect dust.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here.
   Some patches of golden brown hair are scattered on the ground.
   A flower whose blossom looks reminiscent of a fine lace has been
   plucked and
   left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A pair of granite-like gloves have been left here to collect dust.
   The corpse of Flog is lying here.
   The corpse of a Gargoyle warrior is lying here.
   A helmet and visor, decorated with the Aurinite crest, lies here.
   A long spear, topped with a red crystal tip, has been left here.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <Apoc> Hiq the Stick is standing here. (aggressor) (flying)
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (aggressor)
   (flying)
   e<LOW> Stanley, the First Unknown is standing here. (aggressor)
   A putrid wight watches maggots writhe within its abdominal cavity.
   448H 132V 6868168X 9.01% 9845C +8+ Mem:5 Exits:NESW>e
   ki A putrid wight closes its
   spellbook with a content look on its face.
   The white aura around your body fades.
   The Center of the Celestial Temple
   Someone has shed some sickly yellow flakes of skin here.
   A small black pile of leaves and dirt has been heaped here.
   Something sparkles on the ground here.
   A celestial gate stands here, light and dark energy swirling within.
   466H 176V 6868168X 9.01% 9845C +9+ Mem:4 Exits:NESW>ki
   sHit whom?
   466H 176V 6868168X 9.01% 9845C +10+ Mem:4 Exits:NESW>sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <Apoc> Hiq the Stick is standing here. (aggressor) (flying)
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (aggressor)
   (flying)
   <LOW> Stanley, the First Unknown is standing here. (aggressor)
   A putrid wight watches maggots writhe within its abdominal cavity.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   466H 176V 6868168X 9.01% 9845C +10+ Mem:4 Exits:NESW>w
   Guard Post
   The corpse of Tawon is lying here.
   A vibrantly colored red sash sits here.
   The claw of a demon has been severed at the wrist and left here for
   worse.
   The corpse of Mangalore is lying here.
   Chiseled from a light grey stone, you see a granite dagger.
   Before you rest a long spear cut from a dark grey stone.
   A dark pair of knee-high boots has been left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here. [2]
   A pair of granite-like gloves have been left here to collect dust.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A dark pair of knee-high boots has been left here.
   Some patches of golden brown hair are scattered on the ground.
   A flower whose blossom looks reminiscent of a fine lace has been
   plucked and
   left here.
   A horned helmet and visor of the Gargoyle Clans lies here.
   A pair of granite-like gloves have been left here to collect dust.
   The corpse of Flog is lying here.
   The corpse of a Gargoyle warrior is lying here.
   A helmet and visor, decorated with the Aurinite crest, lies here.
   A long spear, topped with a red crystal tip, has been left here.
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <Apoc> Hiq the Stick is standing here. (aggressor) (flying)
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (aggressor)
   (flying)
   <LOW> Stanley, the First Unknown is standing here. (aggressor)
   A putrid wight watches maggots writhe within its abdominal cavity.
   466H 175V 6868168X 9.01% 9845C +11+ Mem:4 Exits:NESW>get all
   Corpse : You can't carry that
   much weight.
   You get sash of the red thorn.
   Claw : You can't carry that much weight.
   Corpse : You can't carry that much weight.
   You get a granite dagger.
   Spear : You can't carry that much weight.
   Boots : You can't carry that much weight.
   Helmet : You can't carry that much weight.
   Boots : You can't carry that much weight.
   Boots : You can't carry that much weight.
   You get gloves of wretchedness.
   Helmet : You can't carry that much weight.
   Boots : You can't carry that much weight.
   You get tufts of lion mane.
   Lace : You can't carry that much weight.
   Helmet : You can't carry that much weight.
   Gloves : You can't carry that much weight.
   Corpse : You can't carry that much weight.
   Corpse : You can't carry that much weight.
   Helmet : You can't carry that much weight.
   Spear : You can't carry that much weight.
   466H 175V 6868168X 9.01% 9845C +12+ Mem:4 Exits:NESW>
   Hiq says 'hahaha'
   466H 175V 6868168X 9.01% 9845C +12+ Mem:4 Exits:NESW>gt loot
   Hyler leaves west.
   Stanley leaves west.
   Hiq flies west.
   Flik flies west.
   Marath flies west.
   You follow Hyler west.
   The Celestial Temple
   <Apoc> Marath On, Endurance Incarnate is standing here. (aggressor)
   (flying)
   <Apoc> Sir Flik Lockheart, The Blue Lightning is standing here.
   (aggressor)
   (flying)
   You see the outline of a life form here, carrying: a crystal shard
   necklace.
   <LOW> Stanley, the First Unknown is standing here. (aggressor)
   <Apoc> Hyler the Male Hylar Dwarf is standing here. (aggressor)
   <VM> Ushi Oni is standing here. (flying)
   . . . is cowering in fear.
   466H 174V 6868168X 9.01% 9845C +13+ Mem:4 Exits:EW>gt loot all
   You tell your group 'loot all'
   466H 174V 6868168X 9.01% 9845C +14+ Mem:4 Exits:EW>
   Hyler gives Ushi a solid punch in the face.
   466H 174V 6868168X 9.01% 9845C +14+ Mem:4 Exits:EW>ki
   Hyler crashes into Ushi in a thundering collision, knocking him to the
   ground!
   466H 174V 6868168X 9.01% 9845C +15+ Mem:4 Exits:EW>
   Flik says 'yawn'
   466H 174V 6868168X 9.01% 9845C +15+ Mem:4 Exits:EW>ki ushi
   You _MASSACRE_ Ushi with your
   smite.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Good]
   Mem:4
   Exits:EW>
   Marath says 'told yah'
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Good]
   Mem:4
   Exits:EW>
   Marath obliterates Ushi with his stab.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Fair]
   Mem:4
   Exits:EW>
   Flik says 'noots'
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Fair]
   Mem:4
   Exits:EW> l
   Flik massacres Ushi with his whip.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Fair]
   Mem:4
   Exits:EW> l ushi
   Hiq comes out of hiding.
   Hiq massacres Ushi with his cleave.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Fair]
   Mem:4
   Exits:EW> l ushi
   Hiq cleaves Ushi extremely hard.
   Hiq misses Ushi with his cleave.
   Flik massacres Ushi with his whip.
   Marath annihilates Ushi with his stab.
   Marath thrashes Ushi good, forcing them to the ground.
   Marath massacres Ushi with his slash.
   You smite Ushi extremely hard.
   Hyler massacres Ushi with his cleave.
   Ushi slashes Hyler extremely hard.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> put all chest
   get all ushi
   !
   Stanley massacres Ushi with his cleave.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   !
   !You see nothing special about him.
   <VM> Ushi the elder male minotaur has some big nasty wounds and
   scratches.
   Chieftain of Valar Morghulis.
   Ushi is using:
   <worn on finger> a carved stone seal..it glows dimly
   <worn on finger> a copper dwarven ring
   <worn around neck> a warlock's cloak
   <worn on body> a suit of white plate mail
   <worn on head> a leather woven headband..it glows dimly
   <worn on legs> some spiked leg plates
   <worn on feet> a pair of steel plated boots
   <worn as shield> a granite shield
   <worn about waist> a dwarven belt
   <worn around right wrist> a glowing bracer..it glows dimly
   <worn around left wrist> a grey leather bracer
   <used in primary hand> a granite sword
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   !
   You put tufts of lion mane in a small wooden chest.
   You put gloves of wretchedness in a small wooden chest.
   You put a granite dagger in a small wooden chest.
   You put sash of the red thorn in a small wooden chest.
   You put a waterskin in a small wooden chest.
   You put a waterskin in a small wooden chest.
   You put a waterskin in a small wooden chest.
   You put a waterskin in a small wooden chest.
   You put a bright ball of light in a small wooden chest.
   You put an obsidian hammer in a small wooden chest.
   You put a weaponsmith's hammer in a small wooden chest.
   You put a pair of black ice arm guards in a small wooden chest.
   You put a glowing scroll of recall in a small wooden chest.
   You put some bristles from a displacer beast in a small wooden chest.
   You put a scroll of recall in a small wooden chest.
   You put a scroll of recall in a small wooden chest.
   You put a scroll of recall in a small wooden chest.
   You put a glowing scroll of recall in a small wooden chest.
   You put some alfalfa sprouts in a small wooden chest.
   A shining silver plate won't fit.
   You put a small purse in a small wooden chest.
   You put the grey robes of the Thorn in a small wooden chest.
   A hand-held sundial won't fit.
   You put an absolutely perfect diamond in a small wooden chest.
   A sharp dagger won't fit.
   A woodsman's vest won't fit.
   A glowing scroll of recall won't fit.
   A pair of plain slippers won't fit.
   A crystal shard necklace won't fit.
   A glowing scroll of recall won't fit.
   A glowing scroll of recall won't fit.
   A magical watering can won't fit.
   A small wooden chest won't fit.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   !What are you trying to get from?
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   !
   What are you trying to get from?
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   What are you trying to get from?
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:V.Bad]
   Mem:4
   Exits:EW> !
   Stanley annihilates Ushi with his cleave.
   Hiq cleaves Ushi extremely hard.
   Hiq cleaves Ushi extremely hard.
   Flik whips Ushi extremely hard.
   Marath annihilates Ushi with his stab.
   Marath annihilates Ushi with his slash.
   You smite Ushi extremely hard.
   Hyler massacres Ushi with his cleave.
   Ushi slashes Hyler hard.
   What are you trying to get from?
   Flik leaps past Ushi, unbalancing them.
   466H 174V 6868168X 9.01% 9845C [Me:Perfect] [Hyler:Good] [Ushi:Awful]
   Mem:4
   Exits:EW> !
   What are you trying to get from?
   Flik sends a swarm of flying piranha at Ushi.
   A piranha tears into Ushi's flesh.
   A piranha tears into Ushi's flesh.
   A piranha tears into Ushi's flesh.
   Ushi is incapacitated and will slowly die, if not aided.
   A piranha tears into Ushi's flesh.
   You receive 825000 experience.
   Ushi is dead! R.I.P.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log3088.html?option=forums&action=displaythread&threadid=3088
