<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Silage R.I.P.

   POV: Elyana

   Log Rating: 0.7726

   Silage goes in ambush

   272H 135V 3450151X 1276C Mem:4 Exits:NESW> nYour ears are filled with
   the sounds of merrymaking as you enter the inn.
   A fire snake arrives from the south.
   The Crashing Boar Inn
   A bulletin board covered with notes has been mounted on the western
   wall.
   Melkor the Male Gnome is standing here. (flying) (invisible)
   . . . is enveloped in flames.
   A hill giant is roaming around looking for something to kill. (flying)
   (invisible)
   A red snake slithers around here. (flying) (invisible)
   Silage the Male Half Elf is standing here.
   . . . is followed by a hovering ball of light.
   Shanus, proprietor of the Crashing Boar, stands behind the counter.
   272H 134V 3450151X 1276C Mem:4 Exits:ESU>
   Skizzo tells you 'how come?'
   272H 134V 3450151X 1276C Mem:4 Exits:ESU> uThe stairs creak softly as
   you climb up them.
   A fire snake arrives from below.
   The Reception
   A grim, stout bouncer stands at the back of the room.
   The receptionist sits behind a mahogany desk, waiting to sign you in.
   272H 133V 3450151X 1276C Mem:4 Exits:D> dsThe noise level increases
   dramatically as you climb down to the tavern below.
   A fire snake arrives from above.
   The Crashing Boar Inn
   A bulletin board covered with notes has been mounted on the western
   wall.
   Melkor the Male Gnome is standing here. (flying) (invisible)
   . . . is followed by a hovering ball of light.
   A hill giant is roaming around looking for something to kill. (flying)
   (invisible)
   A red snake slithers around here. (flying) (invisible)
   Silage the Male Half Elf is standing here.
   . . . is followed by a hovering ball of light.
   Shanus, proprietor of the Crashing Boar, stands behind the counter.
   272H 132V 3450151X 1276C Mem:4 Exits:ESU> A fire snake arrives from the
   north.
   Hawk Street West
   With an arrogant look on his face, a Tantallonian noble walks the
   streets.
   A fine young silver dragon stands quietly here. (invisible)
   272H 131V 3450151X 1276C Mem:4 Exits:NESW> eA fire snake arrives from
   the west.
   Town Square of Tantallon
   In the center of the square is a carved marble fountain.
   A citizen of Tantallon walks about the streets on some errand.
   272H 130V 3450151X 1276C Mem:4 Exits:NESW> wA fire snake arrives from
   the east.
   Hawk Street West
   With an arrogant look on his face, a Tantallonian noble walks the
   streets.
   A fine young silver dragon stands quietly here. (invisible)
   272H 129V 3450151X 1276C Mem:4 Exits:NESW> scanLooking north:
   You can hear the sounds of laughter, talking, and clattering dishes.
   Melkor the Male Gnome is standing here. (flying) (invisible)
   . . . is followed by a hovering ball of light.
   A hill giant is roaming around looking for something to kill. (flying)
   (invisible)
   A red snake slithers around here. (flying) (invisible)
   Silage the Male Half Elf is standing here.
   . . . is followed by a hovering ball of light.
   Shanus, proprietor of the Crashing Boar, stands behind the counter.
   Looking east:
   Tantallon's Town Square lies directly to the east.
   A citizen of Tantallon walks about the streets on some errand.
   Looking south:
   You see a large building with two crossed swords above the door.
   An off-duty guard is relaxing here, waiting for his turn to go on
   patrol.
   An off-duty guard is relaxing here, waiting for his turn to go on
   patrol.
   Looking west:
   Hawk Street continues westwards through Tantallon.
   Looking up:
   You see nothing special.
   Looking down:
   The street you stand upon has been impeccably cobbled.
   272H 129V 3450151X 1276C Mem:4 Exits:NESW>
   The rising sun barely lights the dark and cloudy sky.
   The rain has stopped.
   272H 158V 3450151X 1276C Mem:3 Exits:NESW>
   Melkor flies in from the north.
   A hill giant flies in from the north.
   Silage arrives from the north.
   A fire snake flies in from the north.
   272H 158V 3450151X 1276C Mem:3 Exits:NESW>
   Melkor gives a hill giant an order.
   A hill giant tries to bash you, but it passes right through your image.
   A hill giant slowly fades into existence.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Silage gives a fine silver dragon an order.
   A fine silver dragon tries to kick you but he misses and destroys an
   image instead.
   A fine silver dragon slowly fades into existence.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Silage focuses harshly on you and utters the words, 'web'.
   Silage shoots webs at you but narrowly misses!
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW> gt goYou tell your group 'go'
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   A fine silver dragon misses you and destroys an image.
   A hill giant misses you and destroys an image.
   The images around you fade out of existance.
   A hill giant misses you with its pierce.
   You miss a hill giant with your pierce.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Ronsy flies in from the south.
   Trinitus flies in from the south.
   A hill giant arrives from the south.
   Renio arrives from the south.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Renio crashes into Silage in a thundering collision, knocking him to
   the ground!
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Trinitus says 'pls'
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW> c 'f b' Silage
   Silage steps aside as Ronsy attempts a bash, stumbles, and falls flat
   on his face.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW>
   Trinitus gives a hill giant an order.
   Silage steps aside as a hill giant attempts a bash, stumbles, and falls
   flat on its face.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:3
   Exits:NESW> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Silage.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:4
   Exits:NESW>
   Melkor utters the words, 'antimagic shell'.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:4
   Exits:NESW> c 'f b' Silage
   Trinitus gives a hill giant an order.
   272H 158V 3450151X 1276C [Elyana:Perfect] [a hill giant:Perfect] Mem:4
   Exits:NESW>
   A hill giant massacres Silage with its hit.
   A hill giant pierces Silage extremely hard.
   A hill giant massacres Silage with its hit.
   You receive 0 experience.
   Silage is dead! R.I.P.
   exa corpseA fine silver dragon misses you with his claw.
   A hill giant massacres YOU with its stab.
   A hill giant burns as it passes through your fire shield.
   A hill giant pierces YOU extremely hard.
   A hill giant burns as it passes through your fire shield.
   The death cry of Silage echoes from somewhere nearby...
   Silage stops following Melkor.
   A fine silver dragon stops following Silage.
   Having no master, a fine silver dragon wanders home.
   A fire snake stops following Silage.
   A fire snake transcends this world and enters another plane.
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW>
   Through your wizard's eye: Khelin has left through the south exit.
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW>
   Trinitus gets a large pile of coins from the corpse of Silage.
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> c 'f b' SilageWho should the spell be cast upon?
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> c 'f b' MelkorIt's a pretty ghastly sight! Searching
   through the remains, you find:
   corpse (here) :
   an ivy wristband
   a jagged bracer
   a brown peaty potion..it glows blue [2]
   a large waterskin [2]
   a bowl of Otik's spiced potatoes [4]
   a glowing scroll of recall..it glows blue..it glows dimly
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> Melkor flies north.
   Who should the spell be cast upon?
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW>
   Dreimal shouts 'seek group. cleric here and need books.. any prime
   blugs out there'
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> Who should the spell be cast upon?
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> c 'f b' Melkor
   A citizen of Tantallon arrives from the east.
   A hill giant stands up.
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> c 'web' MelkorWho should the spell be cast upon?
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW> Who should the spell be cast upon?
   229H 158V 3450151X 1276C [Elyana:Good] [a hill giant:Good] Mem:4
   Exits:NESW>
   A hill giant massacres YOU with its stab.
   A hill giant burns as it passes through your fire shield.
   A hill giant panics, and attempts to flee.
   A hill giant flies east.
   203H 158V 3450151X 1276C Mem:4 Exits:NESW>
   Ronsy stands up.
   203H 158V 3450151X 1276C Mem:4 Exits:NESW>

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
