<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Chudik Tamagogi Just RIP

POV: Elyana

Log Rating: 1.0475

2 vs 4, 3 from 4 died.

286H 156V 17799899X 105C Mem:1 Exits:NS> c 'h p' Tamagogi
Neirel flies south.
You follow Neirel south.
Market Street West
Tamagogi, Harvester of Sorrow is standing here.
286H 155V 17799899X 105C Mem:1 Exits:NESW>
Neirel crashes into Tamagogi in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C Mem:1 Exits:NESW> c 'h p' TamagogiYou utter
the words, 'hold person'
The magic fails!
286H 155V 17799899X 105C Mem:1 Exits:NESW> c 'h p' Tamagogi
Neirel massacres Tamagogi with his stab.
Tamagogi misses Neirel with his hit.
286H 155V 17799899X 105C Mem:1 Exits:NESW> You utter the words, 'hold
person'
Tamagogi freezes in place.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Through your wizard's eye: Chudik has arrived from the north exit.
gt WIZEYE: Chudik has arrived from the north exit.Through your wizard's
eye: Snick has arrived from the north exit.
gt WIZEYE: Snick has arrived from the north exit.
286H 155V 17799899X 105C Mem:2 Exits:NESW> c 'f b' Tamagogi
Just flies in from the south.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Through your wizard's eye: Chudik has left through the east exit.
gt WIZEYE: Chudik has left through the east exit.Through your wizard's
eye: Snick has left through the east exit.
gt WIZEYE: Snick has left through the east exit.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Neirel massacres Tamagogi with his stab.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Just focuses harshly on Neirel and utters the words, 'hold person'.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Chudik arrives from the north.
Snick arrives from the north.
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Neirel crashes into Tamagogi in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C Mem:2 Exits:NESW> You utter the words, 'hold
person'
The magic fails!
286H 155V 17799899X 105C Mem:2 Exits:NESW>
Chudik focuses harshly on you and utters some strange words.
Chudik misses you and destroys an image.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Perfect] Mem:2
Exits:NESW>
Chudik misses you with his hit.
You whip Chudik very hard.
Neirel massacres Tamagogi with his stab.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW> c 'f b' Chudik
Just focuses harshly on Neirel and utters the words, 'hold person'.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW> You tell your group 'WIZEYE: Chudik has arrived from the
north exit.'
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW> You tell your group 'WIZEYE: Snick has arrived from the
north exit.'
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Tamagogi.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW>
Chudik misses you with his hit.
Neirel massacres Tamagogi with his stab.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW>
Chudik focuses harshly on you and utters some strange words.
Chudik misses you and destroys an image.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW>
Just focuses harshly on Neirel and utters the words, 'hold person'.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Good] Mem:2
Exits:NESW>
Neirel crashes into Chudik in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Good] Mem:2
Exits:NESW> You tell your group 'WIZEYE: Chudik has left through the
east exit.'
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Good] Mem:2
Exits:NESW> You tell your group 'WIZEYE: Snick has left through the
east exit.'
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Good] Mem:2
Exits:NESW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Chudik.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:3
Exits:NESW>
Neirel stabs Tamagogi extremely hard.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:3
Exits:NESW> c 'hast' neirelJust focuses harshly on you and utters the
words, 'force bolt'.
Just misses you and destroys an image.
You utter the words, 'haste'
Neirel starts to fidget.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:4
Exits:NESW>
Chudik misses you with his hit.
Neirel massacres Tamagogi with his stab.
Neirel massacres Tamagogi with his stab.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:4
Exits:NESW>
Neirel crashes into Tamagogi in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:4
Exits:NESW>
Thorath shouts '19 thief looking to group up, can lead some'
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:4
Exits:NESW>
Just flies south.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Fair] Mem:4
Exits:NESW> c 'f b' ChudikYou utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Chudik.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Bad] Mem:4
Exits:NESW>
Chudik misses you with his hit.
Neirel stabs Tamagogi extremely hard.
Neirel massacres Tamagogi with his stab.
Tamagogi misses Neirel with his hit.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Bad] Mem:4
Exits:NESW>
Chudik stands up.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Bad] Mem:4
Exits:NESW>
Just flies in from the south.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Bad] Mem:4
Exits:NESW> c 'f b' Chudik
Neirel crashes into Chudik in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Bad] Mem:4
Exits:NESW>
Just flies south.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:V.Bad] Mem:4
Exits:NESW> You whip Chudik extremely hard.
Neirel stabs Tamagogi extremely hard.
Neirel massacres Tamagogi with his stab.
Tamagogi misses Neirel with his hit.
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Chudik.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Awful] Mem:5
Exits:NESW> c 'f b' Chudik
Snick tries to charge into you, but he passes through your image and
falls to the ground.
The images around you fade out of existance.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Awful] Mem:5
Exits:NESW>
Tamagogi stands up.
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Awful] Mem:5
Exits:NESW>
Neirel crashes into Tamagogi in a thundering collision, knocking him to
the ground!
286H 155V 17799899X 105C [Elyana:Perfect] [Chudik:Awful] Mem:5
Exits:NESW>
Snick massacres YOU with his cleave.
Chudik misses you with his hit.
Neirel stabs Tamagogi extremely hard.
Tamagogi misses Neirel with his hit.
263H 155V 17799899X 105C [Elyana:V.Good] [Chudik:Awful] Mem:5
Exits:NESW> You utter the words, 'force bolt'
Your force bolt shatters Chudik's skull into lifeless goo.
You receive 0 experience.
Chudik is dead! R.I.P.
get coins corpseexa corpse
263H 155V 17799899X 105C [Chudik:Dying] Mem:6 Exits:NESW>
The death cry of Chudik echoes from somewhere nearby...
Snick stops following Chudik.
Chudik now follows Snick.
Snick is the new leader of Chudik's group.
Chudik stops following Snick.
You direct your attention to Snick.
263H 155V 17799899X 105C [Elyana:V.Good] [Snick:Perfect] Mem:6
Exits:NESW> c 'f b' Chudikc 'f b' Snick
Neirel gets a large pile of coins from the corpse of Chudik.
Neirel gets a small canteen from the corpse of Chudik.
Neirel gets a small canteen from the corpse of Chudik.
Neirel gets a small canteen from the corpse of Chudik.
Neirel gets an iron ration from the corpse of Chudik.
Neirel gets an iron ration from the corpse of Chudik.
Neirel gets an iron ration from the corpse of Chudik.
263H 155V 17799899X 105C [Elyana:V.Good] [Snick:Perfect] mMem:6
Exits:NESW>
Neirel crashes into Snick in a thundering collision, knocking him to
the ground!
263H 155V 17799899X 105C [Elyana:V.Good] [Snick:V.Good] Mem:6
Exits:NESW>
You whip Snick extremely hard.
Snick cleaves YOU extremely hard.
Neirel massacres Tamagogi with his stab.
Neirel massacres Tamagogi with his stab.
Tamagogi misses Neirel with his hit.
247H 155V 17799899X 105C [Elyana:Good] [Snick:V.Good] Mem:6 Exits:NESW>
The corpse doesn't seem to have what you are looking for.
247H 155V 17799899X 105C [Elyana:Good] [Snick:V.Good] Mem:6 Exits:NESW>
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
247H 155V 17799899X 105C [Elyana:Good] [Snick:V.Good] Mem:6 Exits:NESW>
Who should the spell be cast upon?
247H 155V 17799899X 105C [Elyana:Good] [Snick:V.Good] Mem:6 Exits:NESW>
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Snick.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW>
Tamagogi stands up.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW> c
'f b' Snick
Neirel steps aside as Tamagogi attempts a bash, stumbles, and falls
flat on his face.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW>
Snick misses you with his cleave.
Neirel massacres Tamagogi with his stab.
You receive 0 experience.
Tamagogi is dead! R.I.P.
get coins corpseexa corpseThe death cry of Tamagogi echoes from
somewhere nearby...
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW>
There is lightning in the sky.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW>
Just flies in from the south.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Good] Mem:7 Exits:NESW>
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Snick.
247H 155V 17799899X 105C [Elyana:Good] [Snick:Fair] Mem:8 Exits:NESW>
Neirel gets a wooden shield from the corpse of Tamagogi.
Neirel gets a large pile of coins from the corpse of Tamagogi.
Neirel gets a long sword from the corpse of Tamagogi.
247H 155V 17799899X 105C [Elyana:Good] [Snick:;37mFair] Mem:8
Exits:NESW>
Just focuses harshly on you and utters the words, 'force bolt'.
You feel ribs shatter as Just's force bolt slams into you.
204H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
Sisi arrives from the east.
204H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW> c
'f b' just
Snick cleaves YOU extremely hard.
186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
Snick steps aside as Neirel attempts a bash, stumbles, and falls flat
on his face.
186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
Sisi leaves south.
186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
The corpse doesn't seem to have what you are looking for.
186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:8 Exits:NESW>
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Just.
c 'f b' just186H 155V 17799899X 105C [Elyana:Fair] [Snick:Fair] Mem:9
Exits:NESW>
Snick stops using a two-handed battle axe.
Snick grabs a scroll of recall.
Snick recites a scroll of recall.
Snick disappears.
You direct your attention to Just.
186H 155V 17799899X 105C [Elyana:Fair] [Just:Fair] Mem:9 Exits:NESW>
You whip Just extremely hard.
Just misses you with his bludgeon.
186H 155V 17799899X 105C [Elyana:Fair] [Just:Fair] Mem:9 Exits:NESW>
Chudik tells you 'pidor hahaha'
186H 155V 17799899X 105C [Elyana:Fair] [Just:Fair] Mem:9 Exits:NESW>
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Just.
186H 155V 17799899X 105C [Elyana:Fair] [Just:V.Bad] Mem:10 Exits:NESW>
c 'f b' just
Just barely bludgeons YOU.
The lightning has stopped.
202H 160V 17799899X 105C [Elyana:Fair] [Just:V.Bad] Mem:10 Exits:NESW>
Neirel stands up.
202H 160V 17799899X 105C [Elyana:Fair] [Just:V.Bad] Mem:10 Exits:NESW>
Neirel crashes into Just in a thundering collision, knocking him to the
ground!
202H 160V 17799899X 105C [Elyana:Fair] [Just:V.Bad] Mem:10 Exits:NESW>
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Just.
202H 160V 17799899X 105C [Elyana:Fair] [Just:Awful] Mem:11 Exits:NESW>
c 'f b' just
Neirel stabs Just extremely hard.
You receive 0 experience.
Just is dead! R.I.P.
get coins corpseexa corpseThe death cry of Just echoes from somewhere
nearby...
202H 160V 17799899X 105C Mem:11 Exits:NESW>
There is lightning in the sky.
202H 160V 17799899X 105C Mem:11 Exits:NESW> get all 1.corpseget all
2.corpseget all 3.corpseWho should the spell be cast upon?
202H 160V 17799899X 105C Mem:11 Exits:NESW> The corpse doesn't seem to
have what you are looking for.
202H 160V 17799899X 105C Mem:11 Exits:NESW> Glorfindel arrives from the
east.
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a cedar club
a beaded leather bracelet..it glows blue
a small component pouch..it glows blue
a pair of stiff leather boots
some gaudy pink string
delicate copper necklace..it glows blue [2]
a gold and diamond wedding band..it glows blue
a smooth stone ring..it glows blue..it hums softly
a small copper ring
a small canteen [3]
a scroll of recall..it glows blue
a dwarven mining cap..it glows dimly
a portable keg
a small wooden chest
202H 160V 17799899X 105C Mem:11 Exits:NESW>
Neirel gets a cedar club from the corpse of Just.
Neirel gets a beaded leather bracelet from the corpse of Just.
Neirel gets a small component pouch from the corpse of Just.
Neirel gets a pair of stiff leather boots from the corpse of Just.
Neirel gets some gaudy pink string from the corpse of Just.
Neirel gets delicate copper necklace from the corpse of Just.
Neirel gets delicate copper necklace from the corpse of Just.
Neirel gets a gold and diamond wedding band from the corpse of Just.
Neirel gets a smooth stone ring from the corpse of Just.
Neirel gets a small copper ring from the corpse of Just.
Neirel gets a small canteen from the corpse of Just.
Neirel gets a small canteen from the corpse of Just.
202H 160V 17799899X 105C Mem:11 Exits:NESW> You get a small canteen
from the corpse of Just.
You get a scroll of recall from the corpse of Just.
You get a dwarven mining cap from the corpse of Just.
You get a portable keg from the corpse of Just.
You get a small wooden chest from the corpse of Just.
202H 160V 17799899X 105C Mem:11 Exits:NESW>

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
