   #[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

   Login
   Username: __________
   Password: __________
             Login
   [4]Forgot your password?
   [5]Register for a Login
   Mud Logs
   [6]Recent Logs
   [7]Older Logs
   [8]Newer Logs
   [9]Top Rated Logs
   [10]Most Viewed Logs
   [11]Upload A Log
   [12]Log Collections
   [13]Log Quicklist
   Mud Links
   [14]Vote for Arctic
   on Top Mud Sites
   [15]Vote for Arctic
   on Mud Connect
   [16]ArcticMud Blog
   [17]RGB Mud Log Page
   [18]Xanitha's Mud Log Page (not current)
   [19]Oligo's Logs (not current)
   [20]Arctic Mud Forums
   [21]Arctic Mud Homepage

   What is your favorite class to play?

   (*) Warrior
   ( ) Scout
   ( ) Barbarian
   ( ) Shaman
   ( ) Cleric
   ( ) Mage
   ( ) Druid
   ( ) Dark Knight
   ( ) Paladin
   ( ) Thief
   Vote Results

   [22]Submit a Poll
   [23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

   CR from 2 agro trash players!
   [26]View Comments (4)

   POV: Morpheus

   Log Rating: 0.0000

   They killed my Orea so I had to CR

   You tell your group 'jordan'
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW>
   Cyrus stands up.
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW>
   Cyrus tells your clan 'ok'
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> st
   You are already STANDING.
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> l
   By the Gates of a Small Temple
   This path seems much travelled. You see many village people enter and
   leave the small temple just east of here. You feel a sense of anxiety
   from
   the people of this village, as though they are expecting something is
   about
   to happen, and they have little control over it.
   Inky darkness flows into the room, chilling your bones.
   <DARK> Cyrus the Female Human is STANDING here. (aggressor) (flying)
   A clay golem, Mrsmith, stands here, its hulking mass rippling.
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> #TICK-10
   relo jordan
   You can't remember how to cast that spell!
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> m
   Spells currently memorized:
   1: [ 1]blur [ 5]magic missile [ 1]repose
   2: [ 1]invisibility [ 1]shocking grasp [ 2]silence
   [ 1]sleep
   3: [ 2]dispel magic [ 2]fly [ 1]gust of wind
   [ 1]teleport [ 1]water breath
   4: [ 1]acid blast [ 1]calm [ 1]dimension door
   [ 1]free action [ 1]haste [ 1]hold monster
   [ 1]improved invisibilit
   5: [ 5]force bolt [ 1]mass invisibility [ 2]read magic
   6: [ 4]chain lightning [ 1]potency [ 1]spheres of absorptio
   7: [ 3]force missile [ 1]lightning shield [ 1]mass teleport
   [ 1]mirror image
   8: [ 2]feeblemind [ 1]mnemonic enhancer [ 4]shocking blast
   9: [ 4]thunderbolt
   Spells being memorized:
   1: [ 1]shield
   2: [ 1]continual light [ 1]strength
   6: [ 1]displacement [ 1]minor globe of invul [ 2]relocate
   7: [ 1]antimagic shell [ 1]lightning shield [ 1]tether
   9: [ 1]spell trap
   [return for more, q to stop]
   You estimate your studies will complete in 1 (game) hour.
   Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-0 8-0 9-0
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> r
   You rest your tired bones but stay aloft.
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> gt tic
   You tell your group 'tic'
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW>
   Cyrus begins resting but stays aloft.
   323H 109V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> gt be ready
   Cyrus closes her prayerbook with a content look on her face.
   #OK NEW TICKSIZE SET
   #TICKER IS NOW ON.
   Your studies complete, you close your spellbook with a smile.
   You tell your group 'be ready'
   323H 112V 1X 16.40% 3820C Exits:N(E)SW> ÿùst
   You stand up.
   323H 112V 1X 16.40% 3820C Exits:N(E)SW>
   Cyrus stands up.
   323H 112V 1X 16.40% 3820C Exits:N(E)SW> relo jordan
   You store this spell for later use.
   323H 112V 1X 16.40% 3820C Exits:N(E)SW>
   There is lightning in the sky.
   323H 112V 1X 16.40% 3820C Exits:N(E)SW> relo jordan
   #TICK+10
   You utter the words, 'relocate'
   You are not casting at a high enough level to relocate to Jordan.
   The magic fails!
   323H 112V 1X 16.40% 3820C Mem:1 Exits:N(E)SW>
   There is lightning in the sky.
   323H 112V 1X 16.40% 3820C Mem:1 Exits:N(E)SW>
   The inky blackness thins out.
   323H 112V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> sc
   You are Morpheus the Male Theiwar Dwarf, a level 30 Legendary Red Robe.
   You are casting at level 26.
   You are an Elder in Dark Alliance.
   You are rank 21. You have completed 16.40% of your next rank.
   You are 26 years old.
   You have 323(323) hit and 112(112) movement points.
   You are influenced by the red moon, Lunitari.
   You have scored 199999999 exp, and have 3820(1845) steel coins.
   You have 1 rank point to spend.
   You have died 11 horrible deaths.
   You have been connected for 7 minute(s).
   You have been playing for 7 day(s), 20 hour(s) and 54 minute(s).
   Your natural ability scores are:
   Str: 15 Int: 23 Wis: 16 Dex: 20 Con: 15 Cha: 18
   Your equipment is currently not being concealed.
   You begin to sweat under the weight of your equipment.
   You are STANDING.
   You are flying.
   You are magically tethered to Cyrus.
   You are affected by the following:
   spell trap
   shield
   tether
   strength
   continual light
   displacement
   minor globe of invulnerability
   lightning shield
   antimagic shell
   mirror image (5 images)
   spheres of absorption (3 spheres)
   gift: Lunitari
   mnemonic enhancer
   323H 112V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> wear cloak
   You wear a heavy black cloak with silvery runes about your body.
   323H 112V 1X 16.40% 3820C Mem:1 Exits:N(E)SW> relo jordan
   You utter the words, 'relocate'
   The Vertical Shaft
   You are in a small vertical shaft. You can feel and smell fresh air
   from above you. Looking up, you see what appears to be a small rusted
   grating. Looking down, you see only darkness.
   <SoB> Jordan Kronos, High Druid of the Silent Mic is STANDING here.
   (aggressor) (flying)
   . . . has a tough exterior.
   <SoB> Shiroe Mite, Rise of Vae Victis is STANDING here. (aggressor)
   (flying) (invisible)
   Cyrus stumbles out of a puff of smoke.
   323H 112V 1X 16.40% 3820C Mem:1 Exits:UD>
   Jordan gets a conch from his handkerchief.
   Jordan gets a berries from his handkerchief.
   Jordan gets an ice from his handkerchief.
   Jordan gets a needle from his handkerchief.
   Jordan gets a scale from his handkerchief.
   Jordan gets a vial from his handkerchief.
   Jordan gets a granite from his handkerchief.
   323H 112V 1X 16.40% 3820C Mem:1 Exits:UD> fm jordan
   Shiroe tries to bash you, but he passes right through your image.
   Shiroe slowly fades into existence.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:1
   Exits:UD>
   Jordan focuses harshly on Cyrus and utters the words, 'paralysis'.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:1
   Exits:UD>
   Cyrus MASSACREs Jordan with her pierce.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:1
   Exits:UD> You utter the words, 'force missile'
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You utter the words, 'relocate'
   The magic fails!
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Cyrus pierces Jordan extremely hard.
   Cyrus MASSACREs Jordan with her SLASH.
   Cyrus gracefully steps aside as Jordan attacks!
   Shiroe misses you and destroys an image.
   After briefly disappearing, your mirror image pops back into view.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:2
   Exits:UD> c 'sil' jordan
   Jordan utters the words, 'healing cloud'.
   With a twinkle, a cloud of light appears.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Cyrus connects with a precision thrust, wounding Jordan severely.
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:2
   Exits:UD> You utter the words, 'silence'
   The magic fails!
   323H 112V 1X 16.40% 3820C [Morpheus:Perfect] [Shiroe:V.Good] Mem:2
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus SLASHes Jordan extremely hard.
   Shiroe STABs YOU very hard.
   Shiroe is shocked as he passes through your aura.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Shiroe stands up.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD> ÿùst
   Jordan has his casting disrupted by the fighting.
   Shiroe tries to bash you, but he passes right through your image.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Jordan spasms as Cyrus places her hand on Jordan's chest.
   Jordan shivers and begins to grow extremely pale.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Jordan focuses harshly on Cyrus and utters the words, 'paralysis'.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD> You are already STANDING.
   311H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus misses Jordan with her SLASH.
   Shiroe STABs YOU very hard.
   Shiroe is shocked as he passes through your aura.
   You pierce Shiroe hard.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD> sil jordan
   You utter the words, 'silence'
   The magic fails!
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   Cyrus focuses harshly on Jordan and utters the words, 'soul leech'.
   Jordan shudders with agony as pain lashes and clamps down on his soul.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Good] Mem:2
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Shiroe.
   Cyrus MASSACREs Jordan with her pierce.
   Jordan seems to be BLINDED!
   Cyrus MASSACREs Jordan with her SLASH.
   Jordan misses Cyrus with his hit.
   Shiroe misses you and destroys an image.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD>
   Shiroe stands up.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD>
   Shiroe tries to bash you, but he passes right through your image.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD> fm jordan
   You utter the words, 'force missile'
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD>
   Cyrus focuses harshly on Jordan and utters the words, 'soul leech'.
   Jordan shudders with agony as pain lashes and clamps down on his soul.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus MASSACREs Jordan with her SLASH.
   Jordan misses Cyrus with his hit.
   Shiroe misses you and destroys an image.
   The images around you fade out of existence.
   298H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Perfect] Mem:2
   Exits:UD> fl
   !
   sca
   You flee head over heels.
   The Grate
   You are in a vertical shaft. Directly above you is an iron grate which
   appears quite rusty and old. From above, you can feel fresh air. The
   shaft
   goes up and down.
   298H 111V 1X 16.40% 3820C Mem:2 Exits:(U)D> You're not fighting, why
   bother fleeing?
   298H 111V 1X 16.40% 3820C Mem:2 Exits:(U)D> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   The grate is closed.
   Looking down:
   You see nothing special.
   <DARK> Cyrus the Female Human is STANDING here, fighting Jordan.
   (aggressor) (flying)
   <SoB> Jordan Kronos, High Druid of the Silent Mic is STANDING here,
   fighting Cyrus. (aggressor) (flying)
   . . . has a tough exterior.
   <SoB> Shiroe Mite, Rise of Vae Victis is SITTING here. (aggressor)
   (flying)
   298H 111V 1X 16.40% 3820C Mem:2 Exits:(U)D> d
   The Vertical Shaft
   You are in a small vertical shaft. You can feel and smell fresh air
   from above you. Looking up, you see what appears to be a small rusted
   grating. Looking down, you see only darkness.
   A cloud of light flashes and blinks about the area.
   <DARK> Cyrus the Female Human is STANDING here, fighting Jordan.
   (aggressor) (flying)
   <SoB> Jordan Kronos, High Druid of the Silent Mic is STANDING here,
   fighting Cyrus. (aggressor) (flying)
   . . . has a tough exterior.
   <SoB> Shiroe Mite, Rise of Vae Victis is SITTING here. (aggressor)
   (flying)
   298H 110V 1X 16.40% 3820C Mem:2 Exits:UD> mir
   You utter the words, 'mirror image'
   You are surrounded by 5 duplicate images.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   Shiroe looks at you.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   Shiroe stands up.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   Cyrus focuses harshly on Jordan and utters the words, 'soul leech'.
   Jordan shudders with agony as pain lashes and clamps down on his soul.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus pierces Jordan extremely hard.
   Cyrus SLASHes Jordan extremely hard.
   Jordan misses Cyrus with his hit.
   c 'web' jordan
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> You can't remember how to
   cast that spell!
   Shiroe slowly fades into existence.
   Shiroe crashes into Cyrus in a thundering collision, knocking her to
   the ground!
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> #TICK-10
   fm jordan
   You utter the words, 'force missile'
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Shiroe STABs Cyrus very hard.
   Cyrus misses Jordan with her pierce.
   Cyrus SLASHes Jordan extremely hard.
   Jordan misses Cyrus with his hit.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> gt flee
   !
   !
   You tell your group 'flee'
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> You tell your group 'flee'
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> gcalm
   You tell your group 'flee'
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   Jordan has lost his link.
   Jordan has reconnected.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> Huh?!
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   The cloud of light blinks one last time and then fades away.
   Shiroe STABs Cyrus extremely hard.
   Cyrus misses Jordan with her pierce.
   Cyrus SLASHes Jordan extremely hard.
   Jordan misses Cyrus with his hit.
   calm
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> You utter the words, 'calm'
   Cyrus stops fighting Jordan.
   Jordan stops fighting Cyrus.
   Shiroe stops fighting Cyrus.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD>
   Jordan utters the words, 'healing cloud'.
   With a twinkle, a cloud of light appears.
   298H 110V 1X 16.40% 3820C Mem:3 Exits:UD> #TICK!!!
   gt kill the tank
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Shiroe tries to punch Cyrus, but she deftly avoids the blow.
   Shiroe slowly fades into existence.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD> You tell your group 'kill the
   tank'
   Shiroe stumbles and falls while trying to bash Cyrus.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus stands up.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus panics, and attempts to flee.
   Cyrus flies up.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus flies in from above.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus flies up.
   310H 112V 1X 16.40% 3820C Mem:2 Exits:UD> c 'th' shiroe
   You utter the words, 'thunderbolt'
   The thunderbolt hits Shiroe with full impact.
   Shiroe falls onto his rump and slides backwards a bit.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD>
   Shiroe stands up.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD> #TICK+10
   !
   You utter the words, 'thunderbolt'
   The thunderbolt hits Shiroe with full impact.
   Shiroe falls onto his rump and slides backwards a bit.
   Shiroe's fists appear to crackle with electricity.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD>
   Shiroe stands up.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD> st
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD> c 'th' shiroe
   You are already STANDING.
   310H 112V 1X 16.40% 3820C Mem:3 Exits:UD> You utter the words,
   'thunderbolt'
   The thunderbolt hits Shiroe with full impact.
   Shiroe falls onto his rump and slides backwards a bit.
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD>
   Shiroe stands up.
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD> gt come down
   Shiroe tries to punch you, but you deftly avoid his blow.
   Shiroe slowly fades into existence.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD>
   Shiroe stumbles and falls while trying to bash you.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD>
   Cyrus tells your group 'recall or what'
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD> fm
   You tell your group 'come down'
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD> You can't remember how to cast that spell!
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD>
   Cyrus flies in from above.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Shiroe's attack fails miserably as you magically shift to the side.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:Bad] Mem:4
   Exits:UD> fb
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Shiroe.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD> c 'h m'
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Shiroe misses you and destroys an image.
   After briefly disappearing, your mirror image pops back into view.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD>
   Cyrus ANNIHILATEs Shiroe with her pierce.
   Shiroe seems to be BLINDED!
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD>
   Jordan drops a small block of granite.
   Jordan drops a vial of fishliver oil.
   Jordan drops a small silver sea serpent's scale.
   Jordan drops a magnetized needle.
   Jordan drops a piece of broken pond ice.
   Jordan drops some nightshade berries.
   Jordan drops a small pink and red swirled conch shell.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD> You utter the words, 'hold monster'
   The magic fails!
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD>
   Shiroe stands up.
   310H 112V 1X 16.40% 3820C [Morpheus:V.Good] [Shiroe:V.Bad] Mem:4
   Exits:UD> fb
   Shiroe panics, and attempts to flee.
   Shiroe flies down.
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD>
   The cloud of light blinks one last time and then fades away.
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD> d
   Who should the spell be cast upon?
   310H 112V 1X 16.40% 3820C Mem:4 Exits:UD> Cyrus flies in from above.
   Under the Vertical Shaft
   You are directly below a vertical shaft which seems to have been cut
   straight up into, or out of, the mountain. The hall goes east from
   here.
   Some colourful dust is about to be blown away by a passing breeze.
   Someone has shed some sickly yellow flakes of skin here.
   A fan folded from parchment lies here.
   A small leather pouch rests here.
   A small disc of grey metal lies flat on the ground.
   A soft white powder coats the ground here.
   It looks like someone has been clipping their nails here.
   A heart of a hen is lying on the ground.
   A small puddle forms as a piece of ice slowly melts away.
   Two halves of a round hollow stone lie on the ground.
   A leather bag is here...it glows blue..it glows dimly
   A small silver thimble stained with blood has been left here.
   A small needle glistens in the dust here.
   A small stone carved with runic symbols lies here...it glows blue
   A small needle glistens in the dust here.
   A small gemstone with blue and green bandings lies here.
   A fan folded from parchment lies here.
   A few rose petals a scattered in the proximity.
   <DARK> Cyrus the Female Human is STANDING here. (aggressor) (flying)
   <SoB> Shiroe Mite, Rise of Vae Victis is STANDING here. (aggressor)
   (flying) (invisible)
   310H 111V 1X 16.40% 3820C Mem:4 Exits:EU>
   Cyrus utters the words, 'summon dragon'.
   Miley the fearsome blue dragon suddenly appears!
   310H 111V 1X 16.40% 3820C Mem:4 Exits:EU>
   Shiroe flies east.
   310H 111V 1X 16.40% 3820C Mem:4 Exits:EU> fb shiroe
   Who should the spell be cast upon?
   310H 111V 1X 16.40% 3820C Mem:4 Exits:EU> w
   Alas, you cannot go that way...
   310H 111V 1X 16.40% 3820C Mem:4 Exits:EU> u
   Cyrus flies in from below.
   Miley the fearsome blue dragon flies in from below.
   The Vertical Shaft
   You are in a small vertical shaft. You can feel and smell fresh air
   from above you. Looking up, you see what appears to be a small rusted
   grating. Looking down, you see only darkness.
   A pretty shell with red and pink swirls lies here.
   Some black berries have been left behind.
   A small puddle forms as a piece of ice slowly melts away.
   A small needle glistens in the dust here.
   A small silver scale lies here...it glows blue
   A vial of an oily liquid is here.
   A tiny oblong block of granite sits here.
   A fearsome blue dragon, Miley, is STANDING here, ignoring you.
   <DARK> Cyrus the Female Human is STANDING here. (aggressor) (flying)
   <SoB> Jordan Kronos, High Druid of the Silent Mic is STANDING here.
   (aggressor) (flying)
   . . . has a tough exterior.
   310H 110V 1X 16.40% 3820C Mem:4 Exits:UD> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   310H 110V 1X 16.40% 3820C Mem:4 Exits:UD>
   Cyrus gives Miley the fearsome blue dragon an order.
   r
   310H 110V 1X 16.40% 3820C Mem:4 Exits:UD> You rest your tired bones but
   stay aloft.
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD>
   Jordan utters the words, 'healing cloud'.
   With a twinkle, a cloud of light appears.
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD> deep
   You try to ignore everything around you and focus upon your studies.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD> gt tic
   You tell your group 'tic'
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD> m
   Spells currently memorized:
   1: [ 1]blur [ 5]magic missile [ 1]repose
   [ 1]shield
   2: [ 1]continual light [ 1]invisibility [ 1]shocking grasp
   [ 1]sleep [ 1]strength
   3: [ 2]dispel magic [ 2]fly [ 1]gust of wind
   [ 1]teleport [ 1]water breath
   4: [ 1]acid blast [ 1]dimension door [ 1]free action
   [ 1]haste [ 1]improved invisibilit
   5: [ 4]force bolt [ 1]mass invisibility [ 2]read magic
   6: [ 4]chain lightning [ 1]displacement [ 1]minor globe of invul
   [ 1]potency [ 1]spheres of absorptio
   7: [ 1]antimagic shell [ 2]lightning shield [ 1]mass teleport
   [ 1]tether
   8: [ 2]feeblemind [ 1]mnemonic enhancer [ 4]shocking blast
   9: [ 1]spell trap [ 1]thunderbolt
   Spells being memorized:
   2: [ 2]silence
   4: [ 1]calm [ 1]hold monster
   5: [ 1]force bolt
   6: [ 2]relocate
   [return for more, q to stop]7: [ 3]force missile [ 1]mirror image
   9: [ 3]thunderbolt
   You estimate your studies will complete in 1 (game) hour.
   Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-0 8-0 9-0
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   Cyrus MASSACREs Jordan with her pierce.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus drives her trident to an opening in Jordan's armor.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus MASSACREs Jordan with her SLASH.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD> gt FLEE
   You tell your group 'FLEE'
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   Cyrus issues the order 'ass'.
   Miley the fearsome blue dragon claws Jordan hard.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   Cyrus connects with a precision thrust, wounding Jordan severely.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Miley the fearsome blue dragon claws Jordan very hard.
   Miley the fearsome blue dragon claws Jordan hard.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus MASSACREs Jordan with her SLASH.
   Jordan misses Cyrus with his hit.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD>
   Jordan has his casting disrupted by the fighting.
   310H 110V 1X 16.40% 3820C Mem:1 Exits:UD> watch cyrus
   You now watch Cyrus.
   310H 110V 1X 16.40% 3820C [**Cyrus:V.Good**] [**Jordan:Good**] Mem:1
   Exits:UD>
   Jordan focuses harshly on Cyrus and utters the words, 'granite hand'.
   Jordan has a gleam in his eye as a granite hand gives Cyrus a vicious
   backhand slap.
   Jordan has a gleam in his eye as a granite hand gives Cyrus a vicious
   backhand slap.
   Jordan has a gleam in his eye as a granite hand gives Cyrus a vicious
   backhand slap.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:1
   Exits:UD> st
   You stop studying and stand up.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD>
   Cyrus attacks Jordan with lightning fast series of attacks that leaves
   him defenseless.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> conj
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Miley the fearsome blue dragon claws Jordan very hard.
   Miley the fearsome blue dragon claws Jordan very hard.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus SLASHes Jordan extremely hard.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> You touch a finger to your forehead and then wave it in a
   circle.
   A tiny glob of clay expands and contorts into Mrsmith the clay golem.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> gt flee
   Jordan is hit by Miley the fearsome blue dragon's lightning breath.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> You tell your group 'flee'
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> !
   You tell your group 'flee'
   !
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> You tell your group 'flee'
   !
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> You tell your group 'flee'
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:4
   Exits:UD> #TICK-10
   r
   You rest your tired bones but stay aloft.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:2
   Exits:UD> med
   Huh?!
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:2
   Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Miley the fearsome blue dragon claws madly at Jordan.
   Miley the fearsome blue dragon claws Jordan very hard.
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus MASSACREs Jordan with her SLASH.
   Jordan misses Cyrus with his hit.
   Cyrus panics, and attempts to flee.
   Cyrus flies down.
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD> m
   Spells currently memorized:
   1: [ 1]blur [ 5]magic missile [ 1]repose
   [ 1]shield
   2: [ 1]continual light [ 1]invisibility [ 1]shocking grasp
   [ 1]sleep [ 1]strength
   3: [ 2]dispel magic [ 2]fly [ 1]gust of wind
   [ 1]teleport [ 1]water breath
   4: [ 1]acid blast [ 1]dimension door [ 1]free action
   [ 1]haste [ 1]improved invisibilit
   5: [ 4]force bolt [ 1]mass invisibility [ 2]read magic
   6: [ 4]chain lightning [ 1]displacement [ 1]minor globe of invul
   [ 1]potency [ 1]spheres of absorptio
   7: [ 1]antimagic shell [ 2]lightning shield [ 1]mass teleport
   [ 1]tether
   8: [ 2]feeblemind [ 1]mnemonic enhancer [ 4]shocking blast
   9: [ 1]spell trap [ 1]thunderbolt
   Spells being memorized:
   2: [ 2]silence
   4: [ 1]calm [ 1]hold monster
   5: [ 1]force bolt
   6: [ 2]relocate
   [return for more, q to stop]7: [ 3]force missile [ 1]mirror image
   9: [ 3]thunderbolt
   You estimate your studies will complete in 2 (game) hours.
   Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-0 8-0 9-0
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD>
   Jordan focuses harshly on Miley the fearsome blue dragon and utters the
   words, 'granite hand'.
   Jordan has a gleam in his eye as a granite hand gives Miley the
   fearsome blue dragon a vicious backhand slap.
   Miley the fearsome blue dragon panics, and attempts to flee.
   Miley the fearsome blue dragon flies up.
   mem stop 'thunder'
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD> thunderbolt: removed from
   your list
   310H 110V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus flies in from below.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] Mem:2 Exits:UD> !
   thunderbolt: removed from your list
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD>
   Cyrus begins resting but stays aloft.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD>
   Mahha tells you 'win?'
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD> #TICK!!!
   Cyrus stands up.
   310H 110V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD>
   With a twinkle, a cloud of light moves closer to Jordan.
   With a twinkle, a cloud of light moves closer to Jordan.
   Cyrus closes her prayerbook with a content look on her face.
   #OK NEW TICKSIZE SET
   #TICKER IS NOW ON.
   Your studies complete, you close your spellbook with a smile.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Exits:UD> st
   c 'sil' jordan
   You stand up.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Exits:UD> You utter the
   words, 'silence'
   Jordan suddenly becomes very quiet.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD> gt kill it
   The cloud of light blinks one last time and then fades away.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD> You tell
   your group 'kill it'
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD> c 'th'
   jordan
   You utter the words, 'thunderbolt'
   The thunderbolt hits Jordan with full impact.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] Mem:1 Exits:UD>
   Cyrus pierces Jordan extremely hard.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Good**] Mem:1
   Exits:UD> fm jordan
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus MASSACREs Jordan with her SLASH.
   Jordan misses Cyrus with his hit.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Fair**] Mem:1
   Exits:UD> #TICK+10
   You utter the words, 'force missile'
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Fair**] Mem:2
   Exits:UD> !
   Cyrus MASSACREs Jordan with her pierce.
   Jordan's face goes blank and he begins to drool.
   Cyrus SLASHes Jordan extremely hard.
   Jordan misses Cyrus with his hit.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Bad**] Mem:2
   Exits:UD>
   Cyrus connects with a precision thrust, wounding Jordan severely.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Bad**] Mem:2
   Exits:UD> fb jordan
   You utter the words, 'force missile'
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   You grin triumphantly as your force missile crashes into Jordan.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:V.Bad**] Mem:2
   Exits:UD>
   Cyrus MASSACREs Jordan with her pierce.
   Cyrus SLASHes Jordan extremely hard.
   323H 112V 1X 16.40% 3820C [**Cyrus:Good**] [**Jordan:Awful**] Mem:2
   Exits:UD>
   Cyrus focuses harshly on Jordan and utters the words, 'soul leech'.
   Jordan shudders with agony as pain lashes and clamps down on his soul.
   Jordan is mortally wounded, and will die soon, if not aided.
   323H 112V 1X 16.40% 3820C [**Cyrus:V.Good**] [**Jordan:Dying**] Mem:2
   Exits:UD>
   Zedar shouts 'ok so now i learned that Morpheus is brandon... thanks
   for charging me 3k per readmagic earlier in the wipe jerk!'
   323H 112V 1X 16.40% 3820C [**Cyrus:V.Good**] [**Jordan:Dying**] Mem:2
   Exits:UD> You utter the words, 'force bolt'
   Your force bolt shatters Jordan's skull into lifeless goo.
   Jordan is dead! R.I.P.
   323H 112V 1X 16.40% 3820C [Jordan:Dying] Mem:2 Exits:UD>
   You stop watching Cyrus.
   323H 112V 1X 16.40% 3820C [Jordan:Dying] Mem:2 Exits:UD>
   The death cry of Jordan echoes from somewhere nearby...
   323H 112V 1X 16.40% 3820C Mem:2 Exits:UD> get all corpse
   Cyrus gets a very large pile of coins from the corpse of Jordan.
   323H 112V 1X 16.40% 3820C Mem:2 Exits:UD>
   Cyrus divides 6710 coins equally among the group members present.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> You get a plain component
   pouch from the corpse of Jordan.
   You get an ancient tattered cloak from the corpse of Jordan.
   You get some soft white velvet boots from the corpse of Jordan.
   You get some radiant alabaster legplates from the corpse of Jordan.
   You get a small circlet of platinum from the corpse of Jordan.
   You get a dalmatic robe from the corpse of Jordan.
   You get a plain white handkerchief from the corpse of Jordan.
   You get a glowing scroll of recall from the corpse of Jordan.
   Hammer : You can't carry that much weight.
   Shield : You can't carry that much weight.
   You get dual crimson gauntlets of ogre power from the corpse of Jordan.
   You get a malachite encrusted bracelet from the corpse of Jordan.
   You get a braided black waistband from the corpse of Jordan.
   Braces : You can't carry that much weight.
   You get a globe of radiance from the corpse of Jordan.
   You get a scribed scroll from the corpse of Jordan.
   Potion : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Bread : You can't carry that much weight.
   Potion : You can't carry that much weight.
   Jug : You can't carry that much weight.
   Potion : You can't carry that much weight.
   Potion : You can't carry that much weight.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> gt shiro now
   You tell your group 'shiro now'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> who
   Mortals
   -------
   <SoB> Shiroe Mite, Rise of Vae Victis (aggressor)
   <DARK> Morpheus the Male Theiwar Dwarf (aggressor)
   <DARK> Cyrus the Female Human (aggressor)
   Total visible people : 3 Total people online : 24
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> gt loot
   You tell your group 'loot'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> !
   You tell your group 'loot'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> !
   You tell your group 'loot'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   Cyrus flies down.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> gt loot all
   You tell your group 'loot all'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   Cyrus flies in from below.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> oc get all corpse
   Mrsmith the clay golem gets a runed hammer from the corpse of Jordan.
   Mrsmith the clay golem gets a skull engraved shield from the corpse of
   Jordan.
   Mrsmith the clay golem gets a pair of golden arm braces from the corpse
   of Jordan.
   Mrsmith the clay golem gets a brewed potion from the corpse of Jordan.
   Mrsmith the clay golem gets a loaf of bread from the corpse of Jordan.
   Mrsmith the clay golem gets a loaf of bread from the corpse of Jordan.
   Mrsmith the clay golem gets a loaf of bread from the corpse of Jordan.
   Mrsmith the clay golem gets a loaf of bread from the corpse of Jordan.
   Mrsmith the clay golem gets a loaf of bread from the corpse of Jordan.
   Mrsmith the clay golem gets a milky potion of see invisible from the
   corpse of Jordan.
   Mrsmith the clay golem gets a jug of oil from the corpse of Jordan.
   Mrsmith the clay golem gets a milky potion of see invisible from the
   corpse of Jordan.
   Mrsmith the clay golem gets a milky potion of see invisible from the
   corpse of Jordan.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> gt going
   You tell your group 'going'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD>
   Cyrus utters the words, 'summon dragon'.
   Miley the fearsome blue dragon suddenly appears!
   323H 112V 1X 16.40% 7175C Mem:2 Exits:UD> relo shiroe
   You utter the words, 'relocate'
   The Guard's Quarters
   You are in a small room that appears to be a guard's quarters. Neat
   bunks are lined against the wall and a table with knuckle bones on it
   sits
   in the center of the room. The only exit is north.
   A dwarf dressed in armor stands here, warily searching for intruders.
   <SoB> Shiroe Mite, Rise of Vae Victis is STANDING here. (aggressor)
   (flying) (invisible)
   Cyrus stumbles out of a puff of smoke.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> c 'h m' shiroe
   Cyrus MASSACREs Shiroe with her pierce.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> You utter the words, 'hold
   monster'
   Shiroe freezes in place.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Cyrus drives her trident to an opening in Shiroe's armor.
   Cyrus MASSACREs Shiroe with her pierce.
   Cyrus MASSACREs Shiroe with her SLASH.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> c 'f m' shieroe
   Who should the spell be cast upon?
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> say hi bitch
   You say 'hi bitch'
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Cyrus connects with a precision thrust, wounding Shiroe severely.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Cyrus MASSACREs Shiroe with her pierce.
   Cyrus MASSACREs Shiroe with her SLASH.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> fb shiroe
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Shiroe.
   There is a bright flash as your force bolt explodes in Shiroe's face!
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> #TICK-10
   !
   Shiroe says 'im level 28'
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Shiroe says 'fag'
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Cyrus focuses harshly on Shiroe and utters the words, 'soul leech'.
   Shiroe lets out a short gasp as pain overtakes him completely.
   Shiroe is dead! R.I.P.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   The death cry of Shiroe echoes from somewhere nearby...
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> Who should the spell be cast
   upon?
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> shout bastard trash dies
   Your throat is too sore from all that shouting. Maybe you should wait a
   while.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> l
   The Guard's Quarters
   You are in a small room that appears to be a guard's quarters. Neat
   bunks are lined against the wall and a table with knuckle bones on it
   sits
   in the center of the room. The only exit is north.
   The corpse of Shiroe is lying here.
   <DARK> Cyrus the Female Human is STANDING here. (aggressor) (flying)
   A dwarf dressed in armor stands here, warily searching for intruders.
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N>
   Zedar tells you 'you jew!'
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> exa corpse
   It's a pretty ghastly sight! Searching through the remains, you find:
   corpse (here) :
   a thin steel rapier
   a glowing bracer..it glows blue..it glows dimly
   a berserker shield..it glows dimly
   a blood red cowl inscribed with black runes..it glows blue
   the wings of a silver serpent..it glows blue
   a dragontooth necklace..it glows blue
   an insignia of the lost Set'ahki empire..it glows blue
   a very large pile of coins
   a glowing scroll of recall..it glows blue..it glows dimly
   an entire loaf of bread [2]
   a scribed scroll..it glows blue
   a granite dagger
   a glowing scroll of recall..it glows blue..it glows dimly
   a heavy steel broadsword
   a massive stone club..it glows blue
   a large waterskin [3]
   a braided lock of werewolf hair
   323H 112V 1X 16.40% 7175C Mem:3 Exits:N> #TICK!!!
   The bonds of magic fall away.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> say loot
   You say 'loot'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> conj
   You touch a finger to your forehead and then wave it in a circle.
   A tiny glob of clay expands and contorts into Mrsmith the clay golem.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> oc get all corpse
   Mrsmith the clay golem gets a thin steel rapier from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a glowing bracer from the corpse of Shiroe.
   Mrsmith the clay golem gets a berserker shield from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a blood red cowl inscribed with black runes
   from the corpse of Shiroe.
   Mrsmith the clay golem gets the wings of a silver serpent from the
   corpse of Shiroe.
   Mrsmith the clay golem gets a dragontooth necklace from the corpse of
   Shiroe.
   Mrsmith the clay golem gets an insignia of the lost Set'ahki empire
   from the corpse of Shiroe.
   Mrsmith the clay golem gets a very large pile of coins from the corpse
   of Shiroe.
   Mrsmith the clay golem gets a glowing scroll of recall from the corpse
   of Shiroe.
   Mrsmith the clay golem gets an entire loaf of bread from the corpse of
   Shiroe.
   Mrsmith the clay golem gets an entire loaf of bread from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a scribed scroll from the corpse of Shiroe.
   Mrsmith the clay golem gets a granite dagger from the corpse of Shiroe.
   Mrsmith the clay golem gets a glowing scroll of recall from the corpse
   of Shiroe.
   Mrsmith the clay golem gets a heavy steel broadsword from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a massive stone club from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a large waterskin from the corpse of
   Shiroe.
   Mrsmith the clay golem gets a large waterskin from the corpse of
   Shiroe.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Cyrus utters the words, 'summon dragon'.
   Miley the fearsome blue dragon suddenly appears!
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> shout
   Your throat is too sore from all that shouting. Maybe you should wait a
   while.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Cyrus gives Miley the fearsome blue dragon an order.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> ÿù#TICK+10
   Cyrus drops a small warding stone.
   Cyrus drops a magnetized needle.
   Cyrus drops a thimble of human blood.
   Cyrus drops an enchanted bag of astral space.
   Cyrus drops two halves of a spherical geode.
   Cyrus drops a piece of broken pond ice.
   Cyrus drops a heart of a hen.
   Cyrus drops some bitten fingernails.
   Cyrus drops a pinch of white talcum(Mid Abjuration).
   Cyrus drops a flattened lead disc(High Abjuration).
   Cyrus drops a leather pouch of vampire dust.
   Cyrus drops a neatly folded parchment fan.
   Cyrus drops flakes of leprous skin.
   Cyrus drops a pinch of chameleon dust.
   Cyrus drops a piece of broken pond ice.
   Cyrus drops a delicate snowflake.
   Cyrus drops a handful of fine sand.
   Cyrus drops a plain component pouch.
   say shout something
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> You say 'shout something'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> who
   Mortals
   -------
   <DARK> Cyrus the Female Human (aggressor)
   <DARK> Morpheus the Male Theiwar Dwarf (aggressor)
   Total visible people : 2 Total people online : 23
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Cyrus rolls on the floor in a fit of laughter.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Mahha tells you 'killed them?'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> reply yea
   You tell Mahha 'yea'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> reply fucking scum bitches
   You tell Mahha 'fucking scum bitches'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Cyrus tells your group 'like what'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Mahha tells you ':P'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> gt call them names
   You tell your group 'call them names'
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N> gig
   You giggle.
   323H 112V 1X 16.40% 7175C Mem:2 Exits:N>
   Mahha tells you 'grats'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. http://arctic.elay.org/rss.xml
   2. http://www.topmudsites.com/vote-just.html
   3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
   4. file:///index.php?option=forgot
   5. file:///index.php?option=register
   6. file:///index.php?option=recentlogs
   7. file:///index.php?option=recentlogs&lognbr=10
   8. file:///index.php?option=recentlogs&lognbr=0
   9. file:///index.php?option=toplogs
  10. file:///index.php?option=mostviewedlogs
  11. file:///index.php?option=uploadlog
  12. file:///index.php?option=collections
  13. file:///index.php?option=quicklist
  14. http://www.topmudsites.com/vote-just.html
  15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
  16. http://arcticmud.blogspot.com/
  17. http://pollux.ldz.lv/~punk/upload/index.php
  18. http://mudlogs.foghaven.net/
  19. http://normstorm.com/template/m-news.html
  20. http://mud.arctic.org/forum/
  21. http://mud.arctic.org/
  22. file:///index.php?option=poll&action=new
  23. file:///index.php?option=poll&action=listpolls
  24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
  25. http://twitter.com/arcticelayorg
  26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log3305.html?option=forums&action=displaythread&threadid=3305
