<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Alynthia RIP

   POV: Rurh

   Log Rating: -1.8824

   If you are going to random someone, Lesson 1: Don't attack someone
   higher level than you. Lesson 2: Don't go afk in guild rooms when you
   fail. Cryax later told me that "he didn't mean to". Yes, you mustof
   fell on your keyboard and smashed a bunch of keys that resulted in "c
   'l b' ruhr", all just coincidentally at the same time the thief tried
   to backstab me. Uhhuh.

   [The incident]
   306H 126V 5171902X 1393C Mem:2 Exits:ES> ord all.horse kill balia
   Cyrax arrives from the east.
   Alynthia flies in from the east.
   306H 126V 5171902X 1393C Mem:2 Exits:ES> A white pegasus misses Balia
   with her hit.
   You issue the order 'kill balia'.
   306H 126V 5171902X 1393C Mem:2 Exits:ES> ass horse
   You stab Balia extremely hard.
   306H 126V 5171573X 1393C [a white pegasus:Perfect] [Balia:V.Good] Mem:2
   Exits:ES>
   Cyrax looks at you.
   306H 126V 5171573X 1393C [a white pegasus:Perfect] [Balia:V.Good] Mem:2
   Exits:ES>
   Cyrax bows deeply.
   306H 126V 5171573X 1393C [a white pegasus:Perfect] [Balia:V.Good] Mem:2
   Exits:ES>
   The rally cry fades.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   Balia pierces a white pegasus hard.
   306H 126V 5171203X 1393C [a white pegasus:V.Good] [Balia:V.Good] Mem:2
   Exits:ES> ral
   You yell and inspire your companions to fight harder!
   306H 126V 5171203X 1393C [a white pegasus:V.Good] [Balia:V.Good] Mem:2
   Exits:ES>
   You stab Balia extremely hard.
   A white pegasus hits Balia very hard.
   Balia barely pierces YOU.
   302H 126V 5170812X 1393C [Rurh:Fair] [Balia:Good] Mem:2 Exits:ES> av
   leg
   You attempt to focus on Balia and fail horribly.
   302H 126V 5170812X 1393C [Rurh:Fair] [Balia:Good] Mem:2 Exits:ES>
   Cyrax says 'shes urs huh'
   302H 126V 5170812X 1393C [Rurh:Fair] [Balia:Good] Mem:2 Exits:ES>
   Balia pierces YOU hard.
   You stab Balia extremely hard.
   A white pegasus hits Balia very hard.
   293H 126V 5170462X 1393C [Rurh:Fair] [Balia:Good] Mem:2 Exits:ES> av
   leg
   You attempt to focus on Balia and fail horribly.
   293H 126V 5170462X 1393C [Rurh:Fair] [Balia:Good] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus hits Balia hard.
   293H 126V 5170051X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES> 'who?
   You say 'who?'
   293H 126V 5170051X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   You raise your shield and block Balia's blow.
   You stab Balia extremely hard.
   A white pegasus hits Balia hard.
   293H 126V 5169681X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   Cyrax says 'balia'
   293H 126V 5169681X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES> av
   leg
   You focus your purity on Balia's leg!
   293H 126V 5169681X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   Cyrax says 'need help?'
   293H 126V 5169681X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus hits Balia hard.
   293H 126V 5169331X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   'balia is male
   You say 'balia is male'
   293H 126V 5169331X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   Cyrax looks at you.
   293H 126V 5169331X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   Balia pierces YOU hard.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   284H 126V 5169002X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES> 'Im
   fi ne
   Balia pierces YOU very hard.
   You stab Balia extremely hard.
   A white pegasus hits Balia hard.
   Cyrax closes his spellbook with a content look on his face.
   The rally cry fades.
   You throw away your bloody bandages.
   band selfYou say 'Im fi ne'
   284H 142V 5168673X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES>
   You're too busy fighting!
   284H 142V 5168673X 1393C [Rurh:Fair] [Balia:Fair] Mem:2 Exits:ES> str
   You attempt to strike at Balia with your pike.
   You stab Balia very hard.
   284H 142V 5168447X 1393C [Rurh:Fair] [Balia:Bad] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   284H 142V 5168097X 1393C [Rurh:Fair] [Balia:Bad] Mem:2 Exits:ES> ral
   You yell and inspire your companions to fight harder!
   284H 142V 5168097X 1393C [Rurh:Fair] [Balia:Bad] Mem:2 Exits:ES> str
   Balia pierces YOU hard.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   277H 142V 5167706X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES> You
   attempt to strike at Balia with your pike.
   You stab Balia very hard.
   277H 142V 5167439X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES>
   Cyrax says 'k'
   277H 142V 5167439X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   277H 142V 5167028X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES> str
   You strike at Balia, but miss him completely.
   277H 142V 5167028X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus hits Balia hard.
   277H 142V 5166658X 1393C [Rurh:Fair] [Balia:V.Bad] Mem:2 Exits:ES> str
   You raise your shield and block Balia's blow.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   You attempt to strike at Balia with your pike.
   You stab Balia very hard.
   277H 142V 5166021X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES>
   You hear gears grinding as Cyrax thinks.
   277H 142V 5166021X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES> str
   Balia pierces YOU hard.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   268H 142V 5165651X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES> You
   strike at Balia, but miss him completely.
   268H 142V 5165651X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES> str
   Balia pierces YOU hard.
   You stab Balia extremely hard.
   A white pegasus misses Balia with her hit.
   259H 142V 5165322X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES> You
   strike at Balia, but miss him completely.
   259H 142V 5165322X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES>
   Cyrax says 'well, wat else'
   259H 142V 5165322X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES> str
   You hear gears grinding as Cyrax thinks.
   259H 142V 5165322X 1393C [Rurh:Fair] [Balia:Awful] Mem:2 Exits:ES>
   Balia misses you with his pierce.
   You stab Balia extremely hard.
   A white pegasus hits Balia very hard.
   Balia is stunned, but will likely regain consciousness again.
   259H 142V 5164931X 1393C [Balia:Awful] Mem:2 Exits:ES> You hear gears
   grinding as Cyrax thinks.
   You attempt to strike at Balia with your pike.
   You massacre Balia with your stab.
   You receive 93297 experience.
   Balia is dead! R.I.P.
   watch lexmarkget all.coins corpse
   259H 142V 5071634X 1393C [Balia:Dying] Mem:2 Exits:ES>
   The death cry of Balia echoes from somewhere nearby...
   259H 142V 5071634X 1393C Mem:2 Exits:ES>
   Alynthia gets a large pile of coins from the corpse of Balia.
   259H 142V 5071634X 1393C Mem:2 Exits:ES>
   Alynthia tried to backstab you, but you avoid her.
   259H 142V 5071634X 1393C [Rurh:Fair] [Alynthia:Perfect] Mem:2 Exits:ES>
   Cyrax focuses harshly on you and utters some strange words.
   YOU'RE HIT. A lightning bolt from Cyrax has reached its goal.
   230H 142V 5071634X 1393C [Rurh:Fair] [Alynthia:Perfect] Mem:2 Exits:ES>
   The rally cry fades.
   Alynthia misses you with her pierce.
   Alynthia misses you with her pierce.
   You find an opening in Alynthia's armor and drive your pike there.
   You massacre Alynthia with your stab.
   230H 142V 5071634X 1393C [Rurh:Fair] [Alynthia:Good] Mem:2 Exits:ES>
   flee
   They don't seem to be here.
   230H 142V 5071634X 1393C [Rurh:Fair] [Alynthia:Good] Mem:2 Exits:ES>
   The corpse doesn't seem to have what you are looking for.
   230H 142V 5071634X 1393C [Rurh:Fair] [Alynthia:Good] Mem:2 Exits:ES>
   flee
   You flee head over heels.
   The Backroom
   Less smoke-filled than the main bar, you at last have a chance to
   recuperate your breath. Several evil-looking elves are seated around a
   small round table, gambling and betting. They seem to scorn your
   entrance.
   The conversation in this room is limited to what is going on at the
   table.
   230H 141V 5071634X 1393C Mem:2 Exits:N> flee
   You're not fighting, why bother fleeing?
   230H 141V 5071634X 1393C Mem:2 Exits:N> You're not fighting, why bother
   fleeing?
   230H 141V 5071634X 1393C Mem:2 Exits:N>
   Cyrax arrives from the north.
   Alynthia flies in from the north.
   230H 141V 5071634X 1393C Mem:2 Exits:N>
   Cyrax focuses harshly on you and utters some strange words.
   YOU'RE HIT. A lightning bolt from Cyrax has reached its goal.
   169H 141V 5071634X 1393C [Rurh:Bad] [Cyrax:Perfect] Mem:2 Exits:N> flee
   You flee head over heels.
   [The result]
   421H 45V 5071634X 1133C Exits:NEW>
   Kimozabi leaves west.
   You follow Kimozabi west.
   A white pegasus flies in from the east.
   At the Balifor Jail
   A beautiful white horse with majestic wings roams the area.
   Kimozabi the Male Human is standing here. (invisible)
   A member of the Balifor town watch patrols the outside of the
   jailhouse.
   A member of the Balifor town watch patrols the outside of the
   jailhouse.
   421H 44V 5071634X 1133C Exits:NEW>
   Kimozabi leaves north.
   You follow Kimozabi north.
   A white pegasus flies in from the south.
   Corner of a Building
   A beautiful white horse with majestic wings roams the area.
   Kimozabi the Male Human is standing here. (invisible)
   Alynthia the Female Wild Elf is resting here. (red aura)
   421H 43V 5071634X 1133C Exits:ES> ord horse kill Alynthia
   kill Alynthia
   A white pegasus massacres Alynthia with her hit.
   421H 43V 5071634X 1133C Exits:ES> You massacre Alynthia with your stab.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Good]
   Exits:ES>
   Kimozabi leaves east.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Good]
   Exits:ES>
   Mosxari shouts '24 ranger lookin for group'
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Good]
   Exits:ES>
   You massacre Alynthia with your stab.
   A white pegasus hits Alynthia extremely hard.
   Alynthia misses a white pegasus with her pierce.
   Alynthia misses a white pegasus with her pierce.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Fair]
   Exits:ES> av prim
   Kimozabi arrives from the east.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Fair]
   Exits:ES> You attempt to focus on Alynthia and fail horribly.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Fair]
   Exits:ES>
   Kimozabi utters some strange words.
   A shimmering light fills the room, somehow tickling your nose.
   421H 43V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Fair]
   Exits:ES> av prim
   You massacre Alynthia with your stab.
   A white pegasus hits Alynthia extremely hard.
   Alynthia misses a white pegasus with her pierce.
   Alynthia pierces a white pegasus hard.
   421H 43V 5071634X 1133C [a white pegasus:V.Good] [Alynthia:Bad]
   Exits:ES> You focus your purity on Alynthia's arm!
   You force Alynthia to drop her weapon.
   421H 43V 5071634X 1133C [a white pegasus:V.Good] [Alynthia:Bad]
   Exits:ES>
   Kimozabi leaves south.
   421H 43V 5071634X 1133C [a white pegasus:V.Good] [Alynthia:Bad]
   Exits:ES>
   You massacre Alynthia with your stab.
   A white pegasus hits Alynthia extremely hard.
   Alynthia misses a white pegasus with her hit.
   Alynthia misses a white pegasus with her pierce.
   A flash of lightning announces the storm's arrival.
   The elixir flashes a silvery glint and twinkles out.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:V.Bad]
   Exits:ES> get all
   Sword : You can't carry that much weight.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:V.Bad]
   Exits:ES>
   Kimozabi arrives from the south.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:V.Bad]
   Exits:ES>
   You massacre Alynthia with your stab.
   A white pegasus hits Alynthia very hard.
   Alynthia misses a white pegasus with her hit.
   Alynthia misses a white pegasus with her pierce.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES> drop brass
   You drop a brass voulge.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES> get all
   You get a brass voulge.
   Sword : You can't carry that much weight.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES>
   You massacre Alynthia with your stab.
   A white pegasus hits Alynthia very hard.
   Alynthia misses a white pegasus with her hit.
   Alynthia misses a white pegasus with her pierce.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES> drop bras
   You can't seem to find that!
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES> drop brass
   You drop a brass voulge.
   421H 64V 5071634X 1133C [a white pegasus:Perfect] [Alynthia:Awful]
   Exits:ES>
   You massacre Alynthia with your stab.
   You receive 0 experience.
   Alynthia is dead! R.I.P.
   The death cry of Alynthia echoes from somewhere nearby...
   421H 64V 5071634X 1133C Exits:ES> They don't seem to be here.
   421H 64V 5071634X 1133C Exits:ES> You get a pile of coins from the
   corpse of Alynthia.
   There were 45 coins.
   split 45
   421H 64V 5071634X 1178C Exits:ES> You can't split 45 evenly among the
   people in the room; splitting 44 instead.
   You divide 44 coins equally among the group members present.
   421H 64V 5071634X 1156C Exits:ES> get swordYou get a slightly tarnished
   short sword.
   421H 64V 5071634X 1156C Exits:ES> l
   Corner of a Building
   The corpse of Alynthia is lying here.
   A long brass voulge is here.
   Kimozabi the Male Human is standing here. (invisible)
   . . . is surrounded by a shimmering light.
   A beautiful white horse with majestic wings roams the area.
   421H 64V 5071634X 1156C Exits:ES> inv
   You are carrying:
   a slightly tarnished short sword
   a scroll of recall [5]
   a small first-aid kit
   a milky potion of see invisible
   a huge green emerald
   a teakwood helm
   a suit of bronze field plate
   a tarnished silver key
   a small white ring
   a scroll of recall
   a bone-handled mace
   a shimmering blue potion [2]
   421H 64V 5071634X 1156C Exits:ES> drop all.plate
   You drop a suit of bronze field plate.
   421H 64V 5071634X 1156C Exits:ES>
   Kimozabi rolls on the floor in a fit of laughter.
   421H 64V 5071634X 1156C Exits:ES> drop all.key
   You drop a tarnished silver key.
   421H 64V 5071634X 1156C Exits:ES> lCorner of a Building
   A key made of silver lays upon the floor.
   A suit of bronze field plate sits forgotten upon the floor.
   The corpse of Alynthia is lying here.
   A long brass voulge is here.
   Kimozabi the Male Human is standing here. (invisible)
   . . . is surrounded by a shimmering light.
   A beautiful white horse with majestic wings roams the area.
   421H 64V 5071634X 1156C Exits:ES> get all corpse
   You get a short sword from the corpse of Alynthia.
   You get a white sailor's shirt from the corpse of Alynthia.
   You get a wicked draconian dagger from the corpse of Alynthia.
   You get a scroll of recall from the corpse of Alynthia.
   You get a waterskin from the corpse of Alynthia.
   You get a waterskin from the corpse of Alynthia.
   You get a waterskin from the corpse of Alynthia.
   You get a leather purse from the corpse of Alynthia.
   You get a hoopak from the corpse of Alynthia.
   You get a smoked sausage from the corpse of Alynthia.
   You get a smoked sausage from the corpse of Alynthia.
   You get a smoked sausage from the corpse of Alynthia.
   421H 64V 5071634X 1156C Exits:ES>
   Kimozabi says 'did they kill u'
   421H 64V 5071634X 1156C Exits:ES> 'no
   You say 'no'
   421H 64V 5071634X 1156C Exits:ES> 'too low hehe
   You say 'too low hehe'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
