<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   ArayelRIP

   POV: Scelesta

   Log Rating: -0.0909

   Quick pickoff.

   You utter the words, 'clairvoyance'
   A Dark Cave
   Within this large, dark cave you see the remains of half-eaten animals
   and some humanoids covering the ground. Claw marks cover the cave
   walls.
   Whatever inhabits this cave, you certainly don't want to meet, or annoy
   in
   any way.
   The room moves in all directions under the influence of an earthquake.
   Aquinas, Author of Shady Practices is standing here, fighting a red
   dragon. (flying)
   Arayel Betrayal, Shades of Autumn is standing here, fighting a red
   dragon. (flying)
   Fraen de Mynd, Shades of Grey Matter is standing here, fighting a red
   dragon. (flying)
   . . . has a tough exterior.
   A red dragon is standing here, fighting Fraen.
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Archeopteryx shouts 'formed group seeking more evils'
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Samppi tells you 'not gulnam galdar?'
   272H 146V 17885956X 1010C Mem:2 Exits:S> gt arayel/aquinas/fraen
   You tell your group 'arayel/aquinas/fraen'
   272H 146V 17885956X 1010C Mem:2 Exits:S> gt red dragon
   You tell your group 'red dragon'
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Dooku stands up.
   272H 146V 17885956X 1010C Mem:2 Exits:S> gt in a dark cave
   You tell your group 'in a dark cave'
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Dooku utters the words, 'dimension door'.
   A glowing portal opens, and Dooku steps through it.
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Schmendrick tells your group 'fighting it?'
   272H 146V 17885956X 1010C Mem:2 Exits:S> # {Aquinas} is now highlighted
   white in group [default
   ].
   Schmendrick tells your group 'should go if its fighting dragon'
   272H 146V 17885956X 1010C Mem:2 Exits:S>
   Schmendrick tells your group 'go'
   272H 146V 17885956X 1010C Mem:2 Exits:S> tell samppi nope
   You tell Samppi 'nope'
   272H 146V 17885956X 1010C Mem:2 Exits:S> cast 'relocate' arayel
   You utter the words, 'relocate'
   In the Forest
   You are deep inside the forest. Tall forest trees form a nice cool
   shade in the region. You don't see anything unusual except it is very
   quiet, not even a chirp. The forest seems to extend endlessly in every
   single direction. You may go in any direction.
   Fraen de Mynd, Shades of Grey Matter is standing here, fighting a
   bandit. (flying)
   . . . has a tough exterior.
   Aquinas, Author of Shady Practices is standing here, fighting a bandit
   leader. (flying)
   Arayel Betrayal, Shades of Autumn is standing here, fighting a bandit.
   (flying)
   A bandit is standing here, fighting Fraen.
   A bandit is standing here, fighting Fraen.
   A bandit leader is standing here, fighting Aquinas.
   A deer is standing here, fighting Arayel.
   A sneaky kender is standing here, fighting Arayel.
   A bandit delivers a quick snap kick to Fraen. Fraen staggers and tries
   to recover.
   A bandit delivers a quick snap kick to Fraen. Fraen staggers and tries
   to recover.
   A bandit loses his balance and tumbles to the ground.
   A bandit leader delivers a quick snap kick to Aquinas. Aquinas staggers
   and tries to recover.
   A sneaky kender attempts to unbalance Arayel, but he quickly avoids
   him.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Arayel focuses harshly on a bandit and utters some strange words.
   Huge flames burn a bandit from above.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Manny tells your group 'log this'
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Aquinas smites a bandit leader extremely hard.
   A bandit misses Fraen with his hit.
   Fraen massacres a bandit with his slash.
   A bandit is dead! R.I.P.
   A sneaky kender hits Arayel hard.
   A deer hits Arayel hard.
   A bandit leader hits Aquinas very hard.
   A bandit bruises Fraen with his hit.
   The death cry of a bandit echoes from somewhere nearby...
   A bandit stops following a bandit leader.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen gets a pile of coins from the corpse of a bandit.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW> cast 'h p' arayel
   Aquinas steps aside as a bandit leader attempts a bash, stumbles, and
   falls flat on his face.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW> You utter the words, 'hold
   person'
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   A bandit stands up.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   A glowing portal opens in front of you, and Schmendrick steps from it.
   A bandit tries to sweep Fraen's legs, but misses badly.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   Arayel focuses harshly on you and utters some strange words.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW> cast 'h p' fraen
   Fraen stops using a sturdy granite hand axe.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   Fraen slashes a bandit extremely hard.
   A sneaky kender hits Arayel hard.
   A deer misses Arayel with its hit.
   A bandit leader hits Aquinas very hard.
   A bandit misses Fraen with his hit.
   Finally the lingering smell from your journies in the swamp has left
   you.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen gets a shield from his chest.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen starts using a brass dwarven shield as a shield.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW> You utter the words, 'hold
   person'
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Jorgo shouts 'lvl 10 cleric seeking group'
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen steps aside as a bandit attempts a bash, stumbles, and falls flat
   on his face.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Aquinas focuses harshly on a bandit leader and utters the words, 'hold
   person'.
   A bandit leader freezes in place.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW> cast 'h p' fraen
   Arayel utters some strange words.
   The air swirls and a funnel cloud forms.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen massacres a bandit with his slash.
   A sneaky kender hits Arayel extremely hard.
   A deer hits Arayel very hard.
   A bandit hits Fraen very hard.
   272H 146V 17885956X 1010C Mem:4 Exits:NESW>
   Fraen crashes into a bandit in a thundering collision, knocking him to
   the ground!
   272H 146V 17885956X 1010C Mem:4 Exits:NESW> You utter the words, 'hold
   person'
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   Aquinas focuses harshly on a bandit leader and utters some strange
   words.
   A bandit leader briefly reveals a red aura!
   Aquinas makes a bandit leader's evil spirit shiver and suffer!
   Arayel utters some strange words.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW> cast 'f b' arayel
   A small whirlwind crashes into Schmendrick, pummeling his entire body.
   A small whirlwind crashes into a bandit, pummeling his entire body.
   Schmendrick slowly fades into existence.
   Schmendrick misses Arayel with his hit.
   Fraen massacres a bandit with his slash.
   A sneaky kender hits Arayel very hard.
   A deer hits Arayel hard.
   A bandit hits Fraen very hard.
   Schmendrick focuses harshly on Aquinas and utters the words, 'hold
   person'.
   Aquinas freezes in place.
   272H 146V 17885956X 1010C Mem:5 Exits:NESW>
   You hear bones crack as your force bolt slams into Arayel.
   272H 146V 17885956X 1010C Mem:6 Exits:NESW> l fraen
   A small whirlwind crashes into Schmendrick, pummeling his entire body.
   A small whirlwind crashes into a deer, pummeling its entire body.
   Arayel pierces a sneaky kender hard.
   Fraen massacres a bandit with his slash.
   A bandit is dead! R.I.P.
   A sneaky kender misses Arayel with his hit.
   A deer hits Arayel very hard.
   The death cry of a bandit echoes from somewhere nearby...
   A bandit stops following a bandit leader.
   272H 146V 17885956X 1010C Mem:6 Exits:NESW> cast 'h p' fraen
   A large black bear plods into the area from the east.
   You step aside as Fraen tries to bash you, causing him to tumble and
   fall face
   Fraen the adult male hylar dwarf has quite a few wounds.
   Fraen is using:
   <worn on body> a black suit of spiked chainmail armor
   <worn on head> a dark black helm..it glows dimly
   <worn on feet> a pair of dark black boots..it glows dimly
   <worn as shield> a brass dwarven shield
   <worn about waist> a thick leather belt
   <used in primary hand> an ergothian battle blade
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:6
   Exits:NESW> You utter the words,
   'hold person'
   Fraen freezes in place.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:6
   Exits:NESW>
   Schmendrick focuses harshly on Arayel and utters the words, 'force
   bolt'.
   The sound of bones cracking echoes as Schmendrick's force bolt slams
   into Arayel.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:6
   Exits:NESW>
   Arayel panics, and attempts to flee.
   Arayel flies north.
   Arayel flies in from the south.
   Arayel notices a sneaky kender eyeing his possessions.
   A sneaky kender misses Arayel with his hit.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:6
   Exits:NESW>
   A sneaky kender misses Arayel with his hit.
   Arayel pierces a sneaky kender.
   Aquinas massacres a bandit leader with his smite.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:6
   Exits:NESW> cast 'f b' arayel
   cast 'f b'
   Schmendrick focuses harshly on Arayel and utters the words, 'force
   bolt'.
   The sound of bones cracking echoes as Schmendrick's force bolt slams
   into Arayel.
   Arayel is mortally wounded, and will die soon, if not aided.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:8
   Exits:NESW>
   The violent funnel dissipates.
   A sneaky kender massacres Arayel with his hit.
   Arayel is dead! R.I.P.
   Aquinas smites a bandit leader extremely hard.
   The death cry of Arayel echoes from somewhere nearby...
   Aquinas stops following Arayel.
   Arayel now follows Aquinas.
   Aquinas is the new leader of Arayel's group.
   Arayel stops following Aquinas.
   Fraen stops following Arayel.
   Fraen now follows Aquinas.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Fair] Mem:8
   Exits:NESW> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Fraen.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW> get all corpse
   Schmendrick gets a tablet of blackened wood from the corpse of Arayel.
   Schmendrick gets an ice pick from the corpse of Arayel.
   Schmendrick gets an obsidian bracelet from the corpse of Arayel.
   Schmendrick gets a metallic belt from the corpse of Arayel.
   Schmendrick gets a transparent fish skin robe from the corpse of
   Arayel.
   Schmendrick gets a blood red cowl inscribed with black runes from the
   corpse of Arayel.
   Schmendrick is zapped by a web shaped pendant and instantly drops it.
   Schmendrick gets a circlet of horse hairs from the corpse of Arayel.
   Schmendrick gets a small grey ring from the corpse of Arayel.
   Schmendrick gets a pile of coins from the corpse of Arayel.
   Schmendrick gets a crystal ball of life from the corpse of Arayel.
   Schmendrick gets a medallion fragment from the corpse of Arayel.
   Schmendrick gets a piece of broken medallion from the corpse of Arayel.
   Schmendrick gets a black bearskin bag from the corpse of Arayel.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW> cast 'f b'
   Aquinas massacres a bandit leader with his smite.
   A bandit leader misses Aquinas with his hit.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW>
   Aquinas stops using the eye of an umber hulk.
   Aquinas grabs a scroll of recall.
   Aquinas recites a scroll of recall.
   Aquinas disappears.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW>
   A bandit leader stands up.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW> The corpse doesn't see
   m to have what you are looking for.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Bad] Mem:9
   Exits:NESW> You utter the words, '
   force bolt'
   You hear bones crack as your force bolt slams into Fraen.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:V.Bad] Mem:10
   Exits:NESW>
   Schmendrick focuses harshly on Fraen and utters the words, 'lightning
   bolt'.
   Fraen wavers under the impact of the lightning bolt sent by
   Schmendrick.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:V.Bad] Mem:10
   Exits:NESW> cast 'f b'
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Fraen.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:V.Bad] Mem:11
   Exits:NESW>
   Manny tells your group 'you guys winning?'
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:V.Bad] Mem:11
   Exits:NESW>
   Schmendrick focuses harshly on Fraen and utters the words, 'lightning
   bolt'.
   Fraen wavers under the impact of the lightning bolt sent by
   Schmendrick.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Awful] Mem:11
   Exits:NESW>
   A bandit leader delivers a quick snap kick to Fraen. Fraen staggers and
   tries to recover.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Awful] Mem:11
   Exits:NESW> gt yes
   cast 'f b'
   A sneaky kender tries to steal something from Schmendrick.
   You tell your group 'yes'
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Awful] Mem:11
   Exits:NESW> You utter the words
   , 'force bolt'
   You hear bones crack as your force bolt slams into Fraen.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Awful] Mem:12
   Exits:NESW> get all corpse
   A bandit leader hits Fraen very hard.
   A bandit leader misses Fraen with his hit.
   Fraen misses you and destroys an image.
   272H 146V 17885956X 1010C [Scelesta:Perfect] [Fraen:Awful] Mem:12
   Exits:NESW>
   Fraen grabs a glowing scroll of recall.
   Fraen recites a glowing scroll of recall.
   Fraen disappears.
   272H 146V 17885956X 1010C Mem:12 Exits:NESW>
   A bandit leader hits Schmendrick extremely hard.
   272H 146V 17885956X 1010C Mem:12 Exits:NESW> exa corpse
   A bandit leader misses Schmendrick with his hit.
   Schmendrick misses a bandit leader with his hit.
   The corpse doesn't seem to have what you are looking for.
   272H 146V 17885956X 1010C Mem:12 Exits:NESW>
   Schmendrick focuses harshly on a bandit leader and utters the words,
   'lightning bolt'.
   A bandit leader receives the full blast of a lightning bolt from
   Schmendrick ... and is no more.
   You receive 20407 experience.
   A bandit leader is dead! R.I.P.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
