<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   rahl rip

   POV: Scelesta

   Log Rating: -0.3751

   i had to paste this one because i hate this guy

   n
   Rahl flies in from the north.
   307H 87V 19558463X 24C [**Kyzer:Perfect**] Mem:4 Exits:NS>
   Kyzer crashes into Rahl in a thundering collision, knocking him to the
   ground!
   307H 87V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Good**] Mem:4
   Exits:NS> n
   South of A Junction of Paths
   North of here you can see a junction of roads. South of you lies the
   Vingaard river and the ferry that leads across it. Around you the
   fields
   blow in the wind, and small animals scurry around. The road here is
   made up
   of rocks stacked together neatly.
   307H 85V 19558463X 24C Mem:4 Exits:NS> s
   A Junction of Paths
   The road reaches a large fork, branching off in three directions. The
   grasses that grow along the Vingaard Estuary blow gently in the seaside
   winds. The smell of salt is strong coming from the east, giving the
   impression that the Northern Courrain is not far to the east. The
   northern
   trek leads towards a small village on the north shore of the Vingaard
   River. Towards the south, the Vingaard River breaks the road, leaving
   only
   a ferry to carry passengers towards the city of Kalaman and the lands
   beyond. Looking west, the road winds its course through the plains
   towards
   the distant city of Palanthas.
   A jolly, old bard travels along the road, strumming a mandolin.
   A solemn knight of the sword patrols the area for draconians.
   A solemn knight of the sword patrols the area for draconians.
   307H 83V 19558463X 24C Mem:4 Exits:NSW> c 'h p' rahl
   South of A Junction of Paths
   North of here you can see a junction of roads. South of you lies the
   Vingaard river and the ferry that leads across it. Around you the
   fields
   blow in the wind, and small animals scurry around. The road here is
   made up
   of rocks stacked together neatly.
   307H 81V 19558463X 24C Mem:4 Exits:NS> s
   Who should the spell be cast upon?
   307H 81V 19558463X 24C Mem:4 Exits:NS> c 'h p' rahl
   Banks of the Vingaard River
   You are standing on the northern banks of the Vingaard river. The
   roaring river flows past you, splashing water near your feet. The river
   appears to be too fast and wide for you to cross safely by yourself. As
   you
   survey the river banks around you, you notice a ferry not far from you.
   Perhaps you can get a ride across the river on it. Leading away from
   the
   river there is a path heading north.
   Lord Rahl, Guiding, Teaching and Protecting a Myth is sitting here,
   fighting Kyzer. (flying)
   Kyzer Reborn is standing here, fighting Rahl. (flying)
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Good**] Mem:4
   Exits:NS> You utter the words,
   'hold person'
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Good**] Mem:4
   Exits:NS>
   Kyzer massacres Rahl with his crush.
   Rahl misses Kyzer with his pierce.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Good**] Mem:4
   Exits:NS> c 'h p' rahl
   You utter the words, 'hold person'
   Rahl freezes in place.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Good**] Mem:5
   Exits:NS>
   Kyzer massacres Rahl with his crush.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Good**] Mem:5
   Exits:NS> c 'f b' rahl
   Kyzer crashes into Rahl in a thundering collision, knocking him to the
   ground!
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Good**] Mem:5
   Exits:NS> You utter the words, '
   force bolt'
   You hear bones crack as your force bolt slams into Rahl.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Fair**] Mem:7
   Exits:NS>
   Kyzer crushes Rahl extremely hard.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Fair**] Mem:7
   Exits:NS> say EAT SHIT BITCH
   c 'f b' rahl
   Kyzer massacres Rahl with his crush.
   You say 'EAT SHIT BITCH'
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Fair**] Mem:7
   Exits:NS> You utter the words, '
   force bolt'
   You hear bones crack as your force bolt slams into Rahl.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Bad**] Mem:8
   Exits:NS> c 'f b' rahl
   Kyzer crashes into Rahl in a thundering collision, knocking him to the
   ground!
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Bad**] Mem:8
   Exits:NS>
   Kyzer massacres Rahl with his crush.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:V.Bad**] Mem:8
   Exits:NS> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Rahl.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Awful**] Mem:9
   Exits:NS> c 'f b' rahl
   Kyzer massacres Rahl with his crush.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Awful**] Mem:9
   Exits:NS> You utter the words,
   'force bolt'
   Your force bolt shatters Rahl's skull into lifeless goo.
   You receive 0 experience.
   Rahl is dead! R.I.P.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] [**Rahl:Dying**] Mem:11
   Exits:NS> gt recall now
   The death cry of Rahl echoes from somewhere nearby...
   307H 79V 19558463X 24C [**Kyzer:Perfect**] Mem:11 Exits:NS> get all
   corpse
   Kyzer gets a faerie stick from the corpse of Rahl.
   Kyzer gets an onyx shortsword from the corpse of Rahl.
   Kyzer gets an adamantine bracelet from the corpse of Rahl.
   Kyzer gets a small green quiver from the corpse of Rahl.
   Kyzer gets a blacksmith's shield from the corpse of Rahl.
   Kyzer gets a pair of fine metal boots from the corpse of Rahl.
   Kyzer gets a suit of darkened tusk scalemail from the corpse of Rahl.
   Kyzer gets a thin gold necklace from the corpse of Rahl.
   Kyzer gets the seal of Balifor from the corpse of Rahl.
   Kyzer gets a very large pile of coins from the corpse of Rahl.
   Kyzer gets a scroll of refresh from the corpse of Rahl.
   Kyzer gets a shimmering white scroll from the corpse of Rahl.
   Kyzer gets a silvery potion from the corpse of Rahl.
   Kyzer gets a bright ball of light from the corpse of Rahl.
   Kyzer gets a glowing scroll of recall from the corpse of Rahl.
   Kyzer gets a bronze shield from the corpse of Rahl.
   Kyzer gets a large pole axe from the corpse of Rahl.
   Kyzer gets a milky potion of see invisible from the corpse of Rahl.
   Kyzer gets a milky potion of see invisible from the corpse of Rahl.
   Kyzer gets a milky potion of see invisible from the corpse of Rahl.
   Kyzer gets a milky potion of see invisible from the corpse of Rahl.
   Kyzer gets a backpack from the corpse of Rahl.
   Kyzer gets a plainsman war hatchet from the corpse of Rahl.
   Kyzer gets an ancient yew bow from the corpse of Rahl.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] Mem:11 Exits:NS> reply rahl
   rip
   The corpse doesn't seem to have what you are looking for.
   307H 79V 19558463X 24C [**Kyzer:Perfect**] Mem:11 Exits:NS> You tell
   your group 'recall now'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
