<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Lucas RIP

   POV: Elyana

   Log Rating: 0.9000

   but not Martinez yet

   340H 43V 1X 665C Mem:2 Exits:NESW> eBhul flies in from the west.
   Forest Maze
   The head of a small brown rat lies here.
   The head of a large sewer rat lies here.
   The corpse of a metallic leucrotta is lying here.
   The head of a towering silver tree lies here.
   The head of Olino lies here.
   The corpse of a towering silver tree is lying here.
   340H 41V 1X 665C Mem:2 Exits:NSW> scanLooking north:
   You see nothing special.
   A towering silver tree stands barring your path.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   340H 41V 1X 665C Mem:2 Exits:NSW>
   A metallic leucrotta arrives from the south.
   340H 41V 1X 665C Mem:2 Exits:NSW> lForest Maze
   The head of a small brown rat lies here.
   The head of a large sewer rat lies here.
   The corpse of a metallic leucrotta is lying here.
   The head of a towering silver tree lies here.
   The head of Olino lies here.
   The corpse of a towering silver tree is lying here.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   Bhul the Lethal Weapon is standing here. (flying)
   340H 41V 1X 665C Mem:2 Exits:NSW> sBhul flies in from the north.
   Forest Maze
   The head of the communications expert lies here.
   The corpse of a towering silver tree is lying here.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C Mem:2 Exits:NSW> assistYou attempt to assist Bhul.
   You pierce a metallic leucrotta very hard.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:V.Good] Mem:2
   Exits:NSW>
   A metallic leucrotta arrives from the north.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:V.Good] Mem:2
   Exits:NSW>
   You pierce a metallic leucrotta extremely hard.
   A metallic leucrotta misses Bhul with his bite.
   Bhul crushes a metallic leucrotta extremely hard.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:2
   Exits:NSW> scan
   Iian arrives from the south.
   Junumuj flies in from the south.
   A sylph arrives from the south.
   A metallic leucrotta bites a sylph hard.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:2
   Exits:NSW>
   Through your wizard's eye: a Tarsian peasant has left through the north
   exit.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:2
   Exits:NSW> c 'f b' Junumuj
   Bhul crashes into Junumuj in a thundering collision, knocking him to
   the ground!
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:2
   Exits:NSW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   A griffon is sitting here.
   . . . is outlined with a glittery dust.
   A medium sized horse is here, awaiting a rider.
   Looking west:
   You see nothing special.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   A leucrotta with a metallic sheen to his coat is here with his teeth
   bared.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:2
   Exits:NSW> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Junumuj.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:4
   Exits:NSW>
   Iian slashes Bhul very hard.
   340H 39V 1X 665C [Bhul:V.Good] [a metallic leucrotta:Fair] Mem:4
   Exits:NSW> c 'f b' Junumuj
   Iian slashes Bhul very hard.
   Junumuj slowly fades into existence.
   Junumuj whips Bhul extremely hard.
   A metallic leucrotta misses a sylph with his bite.
   A sylph hits a metallic leucrotta hard.
   A metallic leucrotta misses Bhul with his bite.
   Bhul massacres a metallic leucrotta with his crush.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Fair] Mem:4
   Exits:NSW> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Junumuj.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Fair] Mem:5
   Exits:NSW>
   Iian focuses his purity on Bhul's arm!
   Iian focuses on Bhul's arm, but is thwarted.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Fair] Mem:5
   Exits:NSW> c 'f b' Junumuj
   You feel yourself exposed.
   Iian slashes Bhul extremely hard.
   Junumuj whips Bhul extremely hard.
   A metallic leucrotta bites Junumuj hard.
   A sylph hits a metallic leucrotta hard.
   A metallic leucrotta misses Bhul with his bite.
   Bhul massacres a metallic leucrotta with his crush.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:5
   Exits:NSW>
   Bhul crashes into Junumuj in a thundering collision, knocking him to
   the ground!
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:5
   Exits:NSW> c 'f b' JunumujYou utter the words, 'force bolt'
   Your force bolt shatters Junumuj's skull into lifeless goo.
   You receive 0 experience.
   Junumuj is dead! R.I.P.
   exa corpse
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW>
   The death cry of Junumuj echoes from somewhere nearby...
   Junumuj stops following Iian.
   A sylph stops following Junumuj.
   A sylph transcends this world and enters another plane.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW>
   Iian slashes Bhul extremely hard.
   A metallic leucrotta misses Bhul with his bite.
   Bhul crushes a metallic leucrotta extremely hard.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW> get all corpse
   Iian gets a dragontail whip from the corpse of Junumuj.
   Iian gets a silver bracelet from the corpse of Junumuj.
   Iian gets an intricately twined gold bracelet from the corpse of
   Junumuj.
   Iian gets a leopard skin sash from the corpse of Junumuj.
   Iian gets a backpack of holding from the corpse of Junumuj.
   Iian gets a pair of dog hair sleeves from the corpse of Junumuj.
   Iian gets some boots of phasing from the corpse of Junumuj.
   Iian gets dual anklets of gold from the corpse of Junumuj.
   Iian gets a pair of silver spectacles from the corpse of Junumuj.
   Iian gets a fine silver string from the corpse of Junumuj.
   Iian gets a glass eye from the corpse of Junumuj.
   Iian gets the Queen's diamond wedding ring from the corpse of Junumuj.
   Iian gets a pile of coins from the corpse of Junumuj.
   Iian gets a colorful mushroom from the corpse of Junumuj.
   Iian gets a colorful mushroom from the corpse of Junumuj.
   Iian gets a large first-aid kit from the corpse of Junumuj.
   c 'h p' iianIian gets a gnome skull from the corpse of Junumuj.
   Iian gets a scroll of recall from the corpse of Junumuj.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW> Through your wizard's eye: a carrion crow has arrived from
   the north exit.
   Who should the spell be cast upon?
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW>
   Iian stops using a crimson dust covered chest.
   Iian grabs a scroll of recall.
   Iian recites a scroll of recall.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW> It's a pretty ghastly sight! Searching through the remains,
   you find:
   corpse (here) :
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:V.Bad] Mem:6
   Exits:NSW> Iian slashes Bhul extremely hard.
   A metallic leucrotta misses Bhul with his bite.
   Bhul massacres a metallic leucrotta with his crush.
   The corpse doesn't seem to have what you are looking for.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Awful] Mem:6
   Exits:NSW> You utter the words, 'hold person'
   The magic fails!
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Awful] Mem:7
   Exits:NSW>
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C [Bhul:Good] [a metallic leucrotta:Awful] Mem:7
   Exits:NSW> c 'relo' iian
   A metallic leucrotta bites Bhul very hard.
   Iian massacres Bhul with his slash.
   A metallic leucrotta misses Bhul with his bite.
   Bhul massacres a metallic leucrotta with his crush.
   A metallic leucrotta is mortally wounded, and will die soon, if not
   aided.
   340H 39V 1X 665C [a metallic leucrotta:Dying] Mem:7 Exits:NSW> You
   utter the words, 'relocate'
   The magic fails!
   340H 39V 1X 665C [a metallic leucrotta:Dying] Mem:8 Exits:NSW> gt bah
   Bhul says 'bah'
   340H 39V 1X 665C [a metallic leucrotta:Dying] Mem:8 Exits:NSW>
   A metallic leucrotta bites Bhul very hard.
   Iian slashes Bhul extremely hard.
   Bhul obliterates a metallic leucrotta with his crush.
   You receive 0 experience.
   A metallic leucrotta is dead! R.I.P.
   exa corpseThe death cry of a metallic leucrotta echoes from somewhere
   nearby...
   Iian panics, and attempts to flee.
   Iian leaves north.
   340H 39V 1X 665C Mem:8 Exits:NSW> You tell your group 'bah'
   340H 39V 1X 665C Mem:8 Exits:NSW> It's a pretty ghastly sight!
   Searching through the remains, you find:
   corpse (here) :
   a pile of coins
   340H 39V 1X 665C Mem:8 Exits:NSW>
   Iian arrives from the north.
   340H 39V 1X 665C Mem:8 Exits:NSW>
   Iian leaves south.
   340H 39V 1X 665C Mem:8 Exits:NSW>
   Through your wizard's eye: a carrion crow has left through the west
   exit.
   340H 39V 1X 665C Mem:8 Exits:NSW>
   Bhul massacres a metallic leucrotta with his crush.
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C Mem:8 Exits:NSW> c 'h p' IianWho should the spell be
   cast upon?
   340H 39V 1X 665C Mem:8 Exits:NSW>
   A metallic leucrotta arrives from the west.
   340H 39V 1X 665C Mem:8 Exits:NSW>
   Bhul massacres a metallic leucrotta with his crush.
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C Mem:8 Exits:NSW> assistYou attempt to assist Bhul.
   You pierce a metallic leucrotta very hard.
   340H 39V 1X 665C [Bhul:Fair] [a metallic leucrotta:Fair] Mem:8
   Exits:NSW>
   You pierce a metallic leucrotta very hard.
   Bhul massacres a metallic leucrotta with his crush.
   A metallic leucrotta bites Bhul very hard.
   340H 39V 1X 665C [Bhul:Fair] [a metallic leucrotta:V.Bad] Mem:8
   Exits:NSW>
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C [Bhul:Fair] [a metallic leucrotta:V.Bad] Mem:8
   Exits:NSW>
   Bhul says 'he still here'
   340H 39V 1X 665C [Bhul:Fair] [a metallic leucrotta:V.Bad] Mem:8
   Exits:NSW>
   A metallic leucrotta misses Bhul with his bite.
   You pierce a metallic leucrotta hard.
   Bhul massacres a metallic leucrotta with his crush.
   A metallic leucrotta misses Bhul with his bite.
   340H 39V 1X 665C [Bhul:Fair] [a metallic leucrotta:Awful] Mem:8
   Exits:NSW>
   Bhul crashes into a metallic leucrotta in a thundering collision,
   knocking him to the ground!
   A metallic leucrotta is mortally wounded, and will die soon, if not
   aided.
   340H 39V 1X 665C [a metallic leucrotta:Dying] Mem:8 Exits:NSW>
   A metallic leucrotta arrives from the south.
   340H 39V 1X 665C [a metallic leucrotta:Dying] Mem:8 Exits:NSW>
   A metallic leucrotta bites Bhul.
   You annihilate a metallic leucrotta with your pierce.
   You receive 0 experience.
   A metallic leucrotta is dead! R.I.P.
   exa corpseThe death cry of a metallic leucrotta echoes from somewhere
   nearby...
   340H 67V 1X 665C Mem:7 Exits:NSW> It's a pretty ghastly sight!
   Searching through the remains, you find:
   corpse (here) :
   a pile of coins
   340H 67V 1X 665C Mem:7 Exits:NSW> sForest Maze
   The head of a crystal lion lies here.
   The corpse of a metallic leucrotta is lying here.
   The head of an elven villager lies here.
   The corpse of a towering silver tree is lying here.
   The head of an ogre scout lies here.
   The head of Jack Nine-Fingers lies here.
   The corpse of a metallic leucrotta is lying here.
   A griffon is sitting here.
   . . . is outlined with a glittery dust.
   A medium sized horse is here, awaiting a rider.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
