<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Elyana and Gabol die

POV: Duulket

Log Rating: 1.8844

While Duulket attempts to gain experience, Elyana continues losing it

164V 2689C Mem:1 Exits:NE>
Hitakori says 'evils come we panic right'
164V 2689C Mem:1 Exits:NE> 'yeah
You say 'yeah'
164V 2689C Mem:1 Exits:NE> '
Hitakori grins evilly.
164V 2689C Mem:1 Exits:NE> i
Your studies complete, you close your spellbook with a smile.
Kam closes his prayerbook with a content look on his face.
Hitakori closes her prayerbook with a content look on her face.
2689C Exits:NE> edrain you
You say 'i edrain you'
2689C Exits:NE> st
You stand up.
2689C Exits:NE> 'you
Leroy shouts 'foul-smelling tome for free for the 1st guy asking for
it'
2689C Exits:NE>
Hitakori stands up.
2689C Exits:NE> strike kam
You say 'you strike kam'
2689C Exits:NE> f
Your group of 3 members consists of:
Duulket perfect rested standing Y N N 1 0
Kam perfect rested resting Y Y N 1 0
Hitakori perfect rested standing Y N N 1 0
2689C Exits:NE> 'st
Kam stands up.
2689C Exitsn
wKam flies in from the south.
Hitakori flies in from the south.
Inside the Tower
A small sword lies discarded in the dirt.
The corpse of a draconian soldier is lying here.
A small sword lies discarded in the dirt. [2]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
167V 2689C Exits:NESW>
w
Hitakori chuckles politely.
167V 2689C Exits:NESW>
Kam flies in from the east.
Hitakori flies in from the east.
A Lit Corridor
A small sword lies discarded in the dirt. [15]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
166V 2689C Exits:(N)ESW> vKam flies in from the east.
Hitakori flies in from the east.
At the Bottom of the Stairs
The corpse of a draconian soldier is lying here. [2]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
165V 2689C Exits:EU>
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
A magical draconian with silvery scales stands here.
Looking down:
You see nothing special.
165V 2689C Exits:EU> 'u
You say 'u'
165V 2689C Exits:EU> v
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
A magical draconian with silvery scales stands here.
Looking down:
You see nothing special.
165V 2689C Exits:EU>
Kam nods his head in agreement.
165V 2689C Exits:EU> u;.
Hitakori flies up.
165V 2689C Exits:EU>
Kam flies in from below.
On the Second Floor Stairs
The corpse of a draconian soldier is lying here.
A small torch on the wall keeps the room well lit.
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here,
fighting an enchanted sivak draconian. (flying)
An enchanted sivak draconian is standing here, fighting Hitakori.
164V 2689C Exits:EUD> You attempt to assist Hitakori.
You miss an enchanted sivak draconian with your drain.
164V 2689C [Me:Perfect] [Hitakori:Good] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Hitakori focuses her purity on an enchanted sivak draconian's arm!
Hitakori focuses on an enchanted sivak draconian's arm, but is
thwarted.
164V 2689C [Me:Perfect] [Hitakori:Good] [an enchanted sivak
draconian:V.Good] Exits:EUD>
An enchanted bozak draconian arrives from above.
164V 2689C [Me:Perfect] [Hitakori:Good] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Kam stares at the sky.
164V 2689C [Me:Perfect] [Hitakori:Good] [an enchanted sivak
draconian:V.Good] Exits:EUD>
You drain an enchanted sivak draconian very hard.
An enchanted sivak draconian misses Hitakori with his pierce.
An enchanted sivak draconian misses Hitakori with his pierce.
An enchanted sivak draconian massacres Hitakori with his pierce.
Hitakori massacres an enchanted sivak draconian with her slash.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Kam looks at an enchanted bozak draconian.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Through your wizard's eye: Elyana has arrived from the north exit.
Through your wizard's eye: Gabol has arrived from the north exit.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD> lb
Through your wizard's eye: Elyana has left through the west exit.
Through your wizard's eye: Gabol has left through the west exit.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
A draconian soldier arrives from the east.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Hitakori attempts to strike at an enchanted bozak draconian with her
blade.
Hitakori slashes an enchanted bozak draconian extremely hard.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:Egt here
You tell your group 'here'
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD> !
You tell your group 'here'
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
Kam says 'ring!'
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
An enchanted bozak draconian focuses harshly on Hitakori and utters the
words, 'zahliyjguai'.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:V.Good] Exits:EUD>
An enchanted bozak draconian pierces Hitakori extremely hard.
An enchanted bozak draconian misses Hitakori with his pierce.
You drain an enchanted sivak draconian extremely hard.
An enchanted sivak draconian massacres Hitakori with his pierce.
Hitakori deflects part of an enchanted sivak draconian's blow with her
shield.
An enchanted sivak draconian pierces Hitakori very hard.
An enchanted sivak draconian misses Hitakori with his pierce.
Hitakori slashes an enchanted sivak draconian extremely hard.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:Good] Exits:EUD> swap me kam
Kam stops following you.
You now follow Kam.
Kam is the new leader of Duulket's group.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:Good] Exits:EUD> gt move down
You tell your group 'move down'
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:Good] Exits:EUD> c '
Hitakori attempts to strike at a draconian soldier with her blade.
Hitakori slashes a draconian soldier extremely hard.
164V 2689C [Me:Perfect] [Hitakori:Fair] [an enchanted sivak
draconian:Good] Exits:EUD> calm'
You utter the words, 'calm'
A draconian soldier stops fighting Hitakori.
An enchanted bozak draconian stops fighting Hitakori.
You stop fighting an enchanted sivak draconian.
Hitakori stops fighting an enchanted sivak draconian.
An enchanted sivak draconian stops fighting Hitakori.
An enchanted sivak draconian looks calmer.
164V 2689C Mem:3 Exits:EUD>
A draconian soldier misses you with his hit.
A draconian soldier hits YOU very hard.
You drain a draconian soldier extremely hard.
270H 164V 2689C [Me:V.Good] [a draconian soldier:Good] Mem:3 Exits:EUD>
Kam flies down.
270H 164V 2689C [Me:V.Good] [a draconian soldier:Good] Mem:3 Exits:EUD>
rl kam
Hitakori flies down.
270H 164V 2689C [Me:V.Good] [a draconian soldier:Good] Mem:3 Exits:EUD>
You utter the words, 'relocate'
At the Bottom of the Stairs
The corpse of a draconian soldier is lying here. [2]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
270H 164V 2689C Mem:3 Exits:EU> gt swap
tar
Kam flies east.
You follow Kam east.
Hitakori flies in from the west.
A Lit Corridor
A small sword lies discarded in the dirt. [15]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
270H 163V 2689C Mem:3 Exits:(N)ESW> g Elyana
#Ok. $target is now set to {Elyana}.
Elyana flies in from the east.
Gabol flies in from the east.
270H 163V 2689C Mem:3 Exits:(N)ESW> gt
Hitakori focuses harshly on Gabol and utters some strange words.
270H 163V 2689C Mem:3 Exits:(N)ESW> s
Elyana flies west.
Gabol flies west.
270H 163V 2689C Mem:3 Exits:(N)ESW>You tell your group 'swap'
270H 163V 2689C Mem:3 Exits:(N)EYou cannot concentrate enough to cast!
270H 163V 2689C Mem:3 Exits:(N)Emag
Elyana flies in from the west.
Gabol flies in from the west.
270H 163V 2689C Mem:3 Exits:(N)ESW> Gabol focuses harshly on Kam and
utters the words, 'force bolt'.
The sound of bones cracking echoes as Gabol's force bolt slams into
Kam.
You cannot concentrate enough to cast!
270H 163V 2689C Mem:3 Exits:(N)ESW> ely
Hitakori deftly steps in front of Kam, pushing into the frey.
Hitakori heroically rescues Kam.
Gabol misses Hitakori with his bludgeon.
Gabol misses Hitakori with his bludgeon.
Hitakori massacres Gabol with her slash.
Hitakori is burned, as she swings at Gabol.
270H 163V 2689C Mem:3 Exits:(N)ESW> ana
Elyana utters the words, 'sfugwahuq gsgrul'.
Elyana's hands issue a spray of prismatic color!
Hitakori is struck by a spray of vibrant green!
You are caught in a spray of bright orange!
You feel a slight chill.
Kam is struck by a spray of murky violet!
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:Perfect] Mem:3
Exits:(N)ESW> You cannot concentrate enough to cast!
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:Perfect] Mem:3
Exits:(N)ESW> targ
Kam utters some strange words.
Kam's hands send forth blinding rays of sunlight!
Gabol withers as a ray of sunlight sent by Kam engulfs him!
Kam destroys Elyana's mirror images.
Elyana withers as a ray of sunlight sent by Kam engulfs her!
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:V.Good] Mem:3
Exits:(N)ESW> fsdlsdfl
#Ok. $target is now set to {fsdlsdfl}.
st
You are already standing.
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:V.Good] Mem:3
Exits:(N)ESW> fb
You cannot concentrate enough to cast!
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:V.Good] Mem:3
Exits:(N)ESW> f
Elyana misses Hitakori with her pierce.
Elyana misses Hitakori with her pierce.
Gabol misses Hitakori with his bludgeon.
Gabol misses Hitakori with his bludgeon.
Hitakori massacres Gabol with her slash.
Hitakori is burned, as she swings at Gabol.
241H 163V 2689C [Me:Good] [Hitakori:Fair] [Elyana:V.Good] Mem:3
Exits:(N)ESW>f
Elyana utters the words, 'sfugwahuq gsgrul'.
Elyana's hands issue a spray of prismatic color!
Hitakori is blasted by a spray of scintillating blue!
You are blasted by a spray of scintillating blue!
You feel a slight chill.
Kam is hit by a spray of gleaming indigo!
Kam is blasted by a spray of scintillating blue!
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:V.Good] Mem:3
Exits:(Nfb
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Elyana.
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:Good] Mem:4
Exits:(N)ESW>
Kam utters some strange words.
Kam heals Kam.
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:Good] Mem:4
Exits:(N)ESW>
Gabol focuses harshly on Kam and utters the words, 'force bolt'.
The sound of bones cracking echoes as Gabol's force bolt slams into
Kam.
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:Good] Mem:4
Exits:(N)ESW> gt heal hitakori
fYou tell your group 'heal hitakori'
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:Good] Mem:4
Exits:(N)ESW> b
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Elyana.
202H 163V 2689C [Me:Fair] [Hitakori:Bad] [Elyana:Fair] Mem:5
Exits:(N)ESW>
Kam focuses on Hitakori and utters some strange words.
Kam heals Hitakori.
202H 163V 2689C [Me:Fair] [Hitakori:V.Good] [Elyana:Fair] Mem:5
Exits:(N)ESW>
Gabol focuses harshly on Hitakori and utters the words, 'force bolt'.
The sound of bones cracking echoes as Gabol's force bolt slams into
Hitakori.
202H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:5
Exits:(N)ESW>
Elyana misses Hitakori with her pierce.
Hitakori slashes Gabol extremely hard.
Hitakori is burned, as she swings at Gabol.
202H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:5
Exits:(N)ESW>
Hitakori focuses her purity on Gabol's head!
202H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:5
Exits:(N)ESW> f
Elyana quaffs a brewed potion.
202H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:5
Exits:(N)ESW>
Elyana utters the words, 'sfugwahuq gsgrul'.
Elyana's hands issue a spray of prismatic color!
Hitakori is caught in a spray of bright orange!
You are hit by a spray of gleaming indigo!
You feel a slight chill.
Kam is caught in a spray of shimmering red!
Kam seems weaker.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:5
Exits:(N)ESW> b gabol
Your casting is disrupted by the fighting!
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:6
Exits:(N)ESW>
Kam utters some strange words.
Kam's hands send forth blinding rays of sunlight!
Gabol withers as a ray of sunlight sent by Kam engulfs him!
Elyana withers as a ray of sunlight sent by Kam engulfs her!
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:6 Exits:(N)
Gabol misses Hitakori with his bludgeon.
Hitakori massacres Gabol with her slash.
Hitakori is burned, as she swings at Gabol.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:6
Exits:(N)ESW> !
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Gabol.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:7
Exits:(N)ESW>
Hitakori attempts to strike at Gabol with her blade.
Hitakori slashes Gabol extremely hard.
Hitakori is burned, as she swings at Gabol.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:7
Exits:(N)ESW> fb gabol
Gabol panics, and attempts to flee.
Gabol flies south.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:7
Exits:(N)ESW>
Gabol flies in from the south.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Good] Mem:7
Exits:(N)ESW>
Hitakori slashes Elyana extremely hard.
Hitakori is burned, as she swings at Elyana.
Kam misses Elyana with his stab.
Elyana misses Hitakori with her pierce.
Elyana misses Hitakori with her pierce.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:7
Exits:(N)ESW> You utter the words, 'force bolt'
Your force bolt shatters Gabol's skull into lifeless goo.
You receive 0 experience.
Gabol is dead! R.I.P.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:7
Exits:(N)ESW>
The death cry of Gabol echoes from somewhere nearby...
Gabol sinks gently to the ground.
Gabol stops following Elyana.
154H 163V 2689C [Me:Fair] [Hitakori:Good] [Elyana:Fair] Mem:7
Exits:(N)ESW>
Hitakori attempts to strike at Elyana with her blade.
Hitakori slashes Elyana extremely hard.
Hitakori is burned, as she swings at Elyana.
154H 163V 2689C [Me:Fair] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)E
Elyana utters the words, 'sfugwahuq gsgrul'.
Elyana's hands issue a spray of prismatic color!
Hitakori is struck by a spray of vibrant green!
You are caught in a spray of radiant yellow!
That Really did HURT!
You feel a slight chill.
Kam is blasted by a spray of scintillating blue!
90H 163V 2689C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)gt heal duulket
!
!
Hitakori massacres Elyana with her slash.
Hitakori is burned, as she swings at Elyana.
90H 163V 2689C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> !
You get a very large pile of coins from the corpse of Gabol.
There were 1563 coins.
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> You tell your group 'heal duulket'
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> f
Kam is zapped by a coin of two faces and instantly drops it.
Kam gets an ornately carved staff from the corpse of Gabol.
Kam gets a silver waist chain from the corpse of Gabol.
Kam is zapped by a black robe of the Thorn and instantly drops it.
Kam gets a pair of black silk sleeves from the corpse of Gabol.
Kam is zapped by a pair of magi boots and instantly drops it.
Kam gets a pointy mage's hat from the corpse of Gabol.
Kam is zapped by a black robe of shadows and instantly drops it.
Kam is zapped by a skull shaped medallion and instantly drops it.
Kam gets a long black stole, lined with red from the corpse of Gabol.
Kam is zapped by a ring of the Dark Merchant and instantly drops it.
Kam gets a rune etched mithril ring from the corpse of Gabol.
Kam gets an entire loaf of bread from the corpse of Gabol.
Kam gets a large waterskin from the corpse of Gabol.
Kam gets an imp skin pouch from the corpse of Gabol.
Kam gets a glowing scroll of recall from the corpse of Gabol.
Kam gets a glowing scroll of recall from the corpse of Gabol.
Kam gets a glowing scroll of recall from the corpse of Gabol.
Kam gets a small wooden chest from the corpse of Gabol.
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> You tell your group 'heal duulket'
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> b
You tell your group 'heal duulket'
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> You tell your group 'heal duulket'
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Fair] Mem:7
Exits:(N)ESW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Elyana.
90H 163V 4252C [Me:V.Bad] [Hitakori:Fair] [Elyana:Bad] Mem:8
Exits:(N)ESW>
Kam focuses on you and utters some strange words.
Your entire body tingles for a few seconds.
279H 163V 4252C [Me:V.Good] [Hitakori:Fair] [Elyana:Bad] Mem:8
Exits:(N)ESW>
Elyana misses Hitakori with her pierce.
Elyana misses Hitakori with her pierce.
You feel less righteous.
The white aura around your body fades.
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:Bad] Mem:8 Exits:(N)ESW>
Hitakori focuses her purity on Elyana's leg!
Hitakori forces Elyana to the ground.
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:Bad] Mem:8 Exits:(N)ESW> fb
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Elyana.
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:V.Bad] Mem:9 Exits:(N)ESW>
Hitakori massacres Elyana with her slash.
Hitakori is burned, as she swings at Elyana.
Kam misses Elyana with his hit.
Elyana misses Hitakori with her pierce.
Kam focuses harshly on Elyana and utters the words, 'hold person'.
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:Awful] Mem:9 Exits:(N)ESW>
Hitakori attempts to strike at Elyana with her blade.
Hitakori massacres Elyana with her slash.
Hitakori is burned, as she swings at Elyana.
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:Awful] Mem:9 Exits:(N)ESW>
fb
You can't remember how to cast that spell!
4252C [Me:Perfect] [Hitakori:Fair] [Elyana:Awful] Mem:9 Exits:(N)ESW>
mag
You utter the words, 'magic missile'
You watch with selfpride as the magic missile hits Elyana.
You watch with selfpride as the magic missile hits Elyana.
You watch with selfpride as the magic missile hits Elyana.
You watch with selfpride as the magic missile hits Elyana.
Elyana is incapacitated and will slowly die, if not aided.
The magic missile tears away the remaining life of Elyana.
You receive 0 experience.
Elyana is dead! R.I.P.
4252C [Me:Perfect] [Elyana:Dying] Mem:9 Exits:(N)ESW>
The death cry of Elyana echoes from somewhere nearby...
A grey wyvern stops following Elyana.
4252C Mem:9 Exits:(N)ESW> s
Kam gets a very large pile of coins from the corpse of Elyana.
4252C Mem:9 Exits:(N)ESW> hout
Kam divides 2553 coins equally among the group members present.
5103C Mem:9 Exits:(N)ESW> learn
Kam gets a glowing scroll of recall from the corpse of Elyana.
Kam gets a long wooden spear from the corpse of Elyana.
Kam is zapped by a leather wrist band and instantly drops it.
Kam is zapped by a leather wrist band and instantly drops it.
Kam gets a blue canvas belt from the corpse of Elyana.
Kam is zapped by a snow leopard pelt and instantly drops it.
Kam is zapped by an ice shield and instantly drops it.
Kam is zapped by a pair of grey cloth sleeves and instantly drops it.
Kam is zapped by a pair of leather boots and instantly drops it.
Kam is zapped by a pair of grey linen breeches and instantly drops it.
Kam is zapped by a leather cap and instantly drops it.
Kam is zapped by some flowing black armor and instantly drops it.
Kam is zapped by a fine cloth cloak and instantly drops it.
Kam is zapped by a fine cloth cloak and instantly drops it.
Kam gets a granite ring from the corpse of Elyana.
Kam gets a brewed potion from the corpse of Elyana.
Kam gets a brewed potion from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a large first-aid kit from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
Kam gets a shiny red apple from the corpse of Elyana.
5103C Mem:9 Exits:(N)ESW> to use the spell shiThe corpse doesn't seem
to have what you are looking for.
5103C Mem:9 Exits:(N)ESW> eld you fucking twink
You shout 'learn to use the spell shield you fucking twink'
5103C Mem:9 Exits:(N)ESW>
Kam drops an entire loaf of bread.
Kam drops a delicous piece of sweetbeef.
Kam drops a delicous piece of sweetbeef.
Kam drops a delicous piece of sweetbeef.
Kam drops a delicous piece of sweetbeef.
Kam drops a delicous piece of sweetbeef.
Kam drops a delicous piece of sweetbeef.
5103C Mem:9 Exits:(N)ESW>
Valek shouts 'Iopi tells you 'You know ive seen your pick and i think
your really sexy, a sexy bitch even, and i hope you
feel the way about me' You tell Iopi 'Dude ima guy and s are you, so
get out of here with that gay stuff!!!!''
5103C Mem:9 Exits:(N)ESW>
Hitakori shouts 'BAM BITCHES!!!'
5103C Mem:9 Exits:(N)ESW> 'swap
You say 'swap'
5103C Mem:9 Exits:(N)ESW>
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
Kam drops a shiny red apple.
5103C Mem:9 Exits:(N)ESW>
Hitakori gets a shiny red apple from the corpse of Elyana.
Hitakori gets a shiny red apple from the corpse of Elyana.
Hitakori gets a milky potion of see invisible from the corpse of
Elyana.
Hitakori gets a small wooden chest from the corpse of Elyana.
Hitakori gets a magical watering can from the corpse of Elyana.
5103C Mem:9 Exits:(N)ESW>
You stop following Kam.
Kam starts following you.
You are now the new leader of Kam's group.
5103C Mem:9 Exits:(N)ESW> e
sKam flies in from the west.
Hitakori flies in from the west.
Inside the Tower
A small sword lies discarded in the dirt.
The corpse of a draconian soldier is lying here.
A small sword lies discarded in the dirt. [2]
A small torch on the wall keeps the room well lit.
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
168V 5103C Mem:9 Exits:NESW>
Kam flies in from the north.
Hitakori flies in from the north.
By the Gates of the Draconian Tower
A wrist guard has been dropped here. [11]
A small, well cooked piece of sweetbeef scowls at you from the
ground...it glows blue [16]
Lady Hitakori Maharu, Wild's Lil Lady Deathstrike is standing here.
(flying)
Kam Molleh, Aspiring Savant is standing here. (flying) (invisible)
. . . has a metallic luster.
166V 5103C Mem:9 Exits:NE> r
You rest your tired bones but stay aloft.
166V 5103C Mem:4 Exits:NE> 'mem
You say 'mem'
166V 5103C Mem:4 Exits:NE> wh
q[Hero 31] Thunder Bolts and Lightning, Very Very Frightening
Iopi the Male Hylar Dwarf
Suerjwe the Male Goblin
Kyndrez the Male Half Elf
Sonero the Male High Elf
Xru the Male Half Elf
Marak the Male Human
Tarni the Male Human
Jessicar the Female Gnome
Erik the Male Minotaur
Lord Valek, WarBringer for the Rebels of Taladas
Vallengor the Male Hylar Dwarf
Ilastin, Mythical Genie of the Lamp
Halgar the Male Hylar Dwarf
Mochamba the Male Gnome
Gandelf the Male Human
Kobayashii the Male Human
Picki the Male Wild Elf
Asashi Sash, Mythical Dreamer
Valentines the Male High Elf
Seraph the Female Human
[more]
166V 5103C Mem:4 Exits:NE>
Hitakori begins resting but stays aloft.
166V 5103C Mem:4 Exits:NE>
Kam begins resting but stays aloft.
166V 5103C Mem:4 Exits:NE>
**Hitakori: woohoo
166V 5103C Mem:4 Exits:NE>
**Kam: nice

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
