<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Dia R.I.P.

   POV: Scelesta?

   Log Rating: 0.1000

   It died...

   302H 163V 19170788X 1509C Mem:3 Exits:ESW> Eastern Avenue
   The wide road ends in a small intersection to the east and leads toward
   the center of New Tarsis to the west. The smooth, wide road is alive
   with
   people hurrying here and there, each one going about his business.
   A Tarsian peasant cleans up the streets.
   Dia, Mythical Fish in the Barrel is sitting here, fighting Manny.
   (flying)
   Manny, Sassy Mcfat Fat is standing here, fighting Dia. (flying)
   A mercenary is standing here, fighting Manny.
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 162V 19170788X 1509C Mem:3 Exits:ESW>
   A mercenary hits Manny very hard.
   Manny cleaves Dia extremely hard.
   Dia misses Manny with her cleave.
   302H 162V 19170788X 1509C Mem:3 Exits:ESW> c 'f b' dia
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Dia.
   302H 162V 19170788X 1509C Mem:4 Exits:ESW>
   Dia stands up.
   Manny crashes into Dia in a thundering collision, knocking her to the
   ground!
   302H 162V 19170788X 1509C Mem:4 Exits:ESW> c 'h p' dia
   A mercenary misses Manny with his hit.
   Manny cleaves Dia extremely hard.
   Dia misses Manny with her cleave.
   302H 162V 19170788X 1509C Mem:4 Exits:ESW>
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 162V 19170788X 1509C Mem:4 Exits:ESW> You utter the words, 'hold
   person'
   The magic fails!
   302H 162V 19170788X 1509C Mem:5 Exits:ESW> c 'h p' dia
   A mercenary misses Manny with his hit.
   Manny cleaves Dia extremely hard.
   Dia misses Manny with her cleave.
   The rising sun proclaims a new day.
   The images around you fade out of existance.
   302H 167V 19170788X 1509C Mem:4 Exits:ESW> You utter the words, 'hold
   person'
   The magic fails!
   302H 167V 19170788X 1509C Mem:5 Exits:ESW>
   Dia steps aside as Manny attempts a bash, stumbles, and falls flat on
   his face.
   302H 167V 19170788X 1509C Mem:5 Exits:ESW>
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 167V 19170788X 1509C Mem:5 Exits:ESW>
   A mercenary hits Manny very hard.
   Manny cleaves Dia extremely hard.
   Dia cleaves Manny extremely hard.
   302H 167V 19170788X 1509C Mem:5 Exits:ESW>
   Dia stands up.
   302H 167V 19170788X 1509C Mem:5 Exits:ESW> watch manny
   c 'h p' dia
   You now watch Manny.
   302H 167V 19170788X 1509C [**Manny:V.Good**] [**Dia:Good**] Mem:5
   Exits:ESW> You can't remember h
   ow to cast that spell!
   302H 167V 19170788X 1509C [**Manny:V.Good**] [**Dia:Good**] Mem:5
   Exits:ESW>
   Dia crashes into Manny in a thundering collision, knocking him to the
   ground!
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Good**] Mem:5
   Exits:ESW>
   A mercenary misses Manny with his hit.
   A mercenary misses Manny with his hit.
   Manny cleaves Dia very hard.
   Dia massacres Manny with her cleave.
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Fair**] Mem:5
   Exits:ESW> c 'f b' dia
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Dia.
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Fair**] Mem:6
   Exits:ESW>
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Fair**] Mem:6
   Exits:ESW> c 'f b' dia
   A glowing portal opens in front of Dia, and Relix steps from it.
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Fair**] Mem:6
   Exits:ESW>
   A mercenary hits Manny extremely hard.
   Manny cleaves Dia extremely hard.
   Dia cleaves Manny extremely hard.
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:Fair**] Mem:6
   Exits:ESW> You utter the words, '
   force bolt'
   You hear bones crack as your force bolt slams into Dia.
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:V.Bad**] Mem:7
   Exits:ESW>
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:V.Bad**] Mem:7
   Exits:ESW>
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 167V 19170788X 1509C [**Manny:Good**] [**Dia:V.Bad**] Mem:7
   Exits:ESW> c 'f b' dia
   A mercenary misses Manny with his hit.
   Manny cleaves Dia extremely hard.
   Dia cleaves Manny extremely hard.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:V.Bad**] Mem:7
   Exits:ESW>
   Relix focuses harshly on Manny and utters the words, 'web'.
   Relix shoots webs at Manny but narrowly misses him!
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:V.Bad**] Mem:7
   Exits:ESW> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Dia.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:V.Bad**] Mem:8
   Exits:ESW> c 'f b' dia
   Manny stands up.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:V.Bad**] Mem:8
   Exits:ESW>
   Manny crashes into Dia in a thundering collision, knocking her to the
   ground!
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:V.Bad**] Mem:8
   Exits:ESW>
   A mercenary misses Manny with his hit.
   Manny cleaves Dia extremely hard.
   Dia cleaves Manny extremely hard.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Awful**] Mem:8
   Exits:ESW>
   A mercenary looks at Manny and yells 'There's the scoundrel!'
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Awful**] Mem:8
   Exits:ESW> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Dia.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Awful**] Mem:10
   Exits:ESW>
   A mercenary misses Manny with his hit.
   Manny cleaves Dia extremely hard.
   Dia cleaves Manny very hard.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Awful**] Mem:10
   Exits:ESW> c 'f b' dia
   Relix glances at Dia.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Awful**] Mem:10
   Exits:ESW> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Dia.
   Dia is incapacitated and will slowly die, if not aided.
   Dia suffers from lack of blood, and the lack of a beating heart...
   You receive 0 experience.
   Dia is dead! R.I.P.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**Dia:Dying**] Mem:11
   Exits:ESW> get all corpse
   The death cry of Dia echoes from somewhere nearby...
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:Perfect**]
   Mem:11 Exits:ESW>
   A mercenary spins and tries to kick Manny, but Manny dodges out of the
   way.
   Manny gets a black granite axe from the corpse of Dia.
   Manny gets a thick leather belt from the corpse of Dia.
   Manny gets a backpack from the corpse of Dia.
   Manny gets an ebony shield from the corpse of Dia.
   Manny gets a pair of mithril sleeves from the corpse of Dia.
   Manny gets a pair of sleek black boots from the corpse of Dia.
   Manny gets a suit of sea elf scale mail from the corpse of Dia.
   Manny gets a heavy bearskin cloak from the corpse of Dia.
   Manny gets a ring of the panther from the corpse of Dia.
   Manny gets a ring of the panther from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a glowing scroll of recall from the corpse of Dia.
   Manny gets a milky potion of see invisible from the corpse of Dia.
   Manny gets a malevolent hooked beast goad from the corpse of Dia.
   Manny gets a dark cudgel from the corpse of Dia.
   Manny gets a roasted turkey leg from the corpse of Dia.
   Manny gets a roasted turkey leg from the corpse of Dia.
   Manny gets a roasted turkey leg from the corpse of Dia.
   Manny gets a roasted turkey leg from the corpse of Dia.
   Manny gets a rough edged axe from the corpse of Dia.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:Perfect**]
   Mem:11 Exits:ESW>
   Manny cleaves a mercenary very hard.
   A mercenary misses Manny with his hit.
   Relix steps aside as Manny attempts a bash, stumbles, and falls flat on
   his face.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:V.Good**]
   Mem:11 Exits:ESW>
   Relix panics, and attempts to flee.
   Relix leaves south.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:V.Good**]
   Mem:11 Exits:ESW> c 'f b' rel
   ix
   You get a dark crystal ball from the corpse of Dia.
   You get a blindfold from the corpse of Dia.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   Barrel : You can't carry that many items.
   Plate : You can't carry that many items.
   Ham : You can't carry that many items.
   Die : You can't carry that many items.
   Die : You can't carry that many items.
   Tunic : You can't carry that many items.
   Ball : You can't carry that many items.
   Chest : You can't carry that many items.
   Sword : You can't carry that many items.
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:V.Good**]
   Mem:11 Exits:ESW> s
   Who should the spell be cast upon?
   302H 167V 19170788X 1509C [**Manny:Fair**] [**a mercenary:V.Good**]
   Mem:11 Exits:ESW> c 'f b' rel
   ix
   Vallenwood Lane
   A pleasant lane winds southward through a grove of young Vallenwood
   trees. Rumor has it that a blizzard of druids worked this corner of the
   city to make it green and growing and pleasant for the inhabitants who
   survived to return. An intersection lies to the north.
   Relix the Male Theiwar Dwarf is standing here.
   302H 166V 19170788X 1509C Mem:11 Exits:NS>
   Relix stops using a small first-aid kit.
   Relix grabs a glowing scroll of recall.
   Relix recites a glowing scroll of recall.
   Relix disappears.
   302H 166V 19170788X 1509C Mem:11 Exits:NS> Who should the spell be cast
   upon?

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
