<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Palanthas Chaos

   POV: Scelesta

   Log Rating: 2.5152

   4 small groups go at it in front of the inn, each with different
   intent.

   289H 166V 17172941X 1350C [**Manny:Perfect**] Exits:D>
   Kelpo leaves down.
   Iopi flies down.
   Kisoon leaves down.
   A pech leaves down.
   Jus flies down.
   289H 166V 17172941X 1350C [**Manny:Perfect**] Exits:D> sca
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   Floyd, the barkeep, idly whistles a merry tune while polishing the bar.
   289H 166V 17172941X 1350C [**Manny:Perfect**] Exits:D> st
   You stand up.
   289H 166V 17172941X 1350C [**Manny:Perfect**] Exits:D> d
   n
   c 'h p' iopi
   A pech arrives from above.
   The Ebullient Elephant Inn
   This spacious tavern is full of customers. This is obviously a favorite
   hangout of many of Palanthas's middle class citizens. There is a bar
   against one wall and a staircase leading upstairs to the room clerk's
   office. The only exit is back north to Sword Street.
   A small pigmy-like creature stands here. (invisible)
   Floyd, the barkeep, idly whistles a merry tune while polishing the bar.
   289H 165V 17172941X 1350C Exits:NU> A pech arrives from the south.
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A small roll of bread lies here...it glows blue [9]
   A small pigmy-like creature stands here. (invisible)
   Jus the Male Goblin is sitting here, fighting Syrus. (flying)
   A small pigmy-like creature stands here.
   You see the outline of a life form here, carrying: a glowing scroll of
   recall.
   Iopi is standing here. (flying)
   Lord Kelpo Vonaxle III is sitting here, fighting Kort.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   Kort O'Law, Corporate Judge is standing here, fighting Kelpo.
   . . . is outlined with a glittery dust.
   Nana, Corporate Bag Man is standing here, fighting Kisoon.
   . . . is outlined with a glittery dust.
   Syrus D'Vyrus, Chairman of the Board is standing here, fighting Jus.
   . . . has a tough exterior.
   Bucky the Male Hylar Dwarf is standing here. (invisible)
   . . . is outlined with a glittery dust.
   289H 164V 17172941X 1350C Exits:ESW>
   Syrus focuses harshly on Jus and utters the words, 'hold person'.
   Jus freezes in place.
   289H 164V 17172941X 1350C Exits:ESW> You utter the words, 'hold person'
   The magic fails!
   289H 164V 17172941X 1350C Mem:2 Exits:ESW>
   Iopi crashes into Kort in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C Mem:2 Exits:ESW>
   Iopi massacres Kort with his slash.
   Nana massacres Kisoon with his slash.
   Kisoon slowly fades into existence.
   Kisoon comes out of hiding.
   Kisoon bludgeons Nana very hard.
   Kort slashes Kelpo extremely hard.
   Kelpo misses Kort with his bludgeon.
   289H 164V 17172941X 1350C Mem:2 Exits:ESW>
   Eligarf arrives from the west.
   A young adventurer arrives from the west.
   A young adventurer arrives from the west.
   289H 164V 17172941X 1350C Mem:2 Exits:ESW> c 'h p' iopi
   Eligarf issues the order 'bash kisoon'.
   Kisoon steps aside as a young adventurer attempts a bash, stumbles, and
   falls flat on his face.
   Kisoon steps aside as a young adventurer attempts a bash, stumbles, and
   falls flat on his face.
   289H 164V 17172941X 1350C Mem:2 Exits:ESW> You utter the words, 'hold
   person'
   Iopi freezes in place.
   289H 164V 17172941X 1350C Mem:3 Exits:ESW>
   Manny arrives from the south.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:3 Exits:ESW>
   Kelpo steps aside as Manny attempts a bash, stumbles, and falls flat on
   his face.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Good**] Mem:3
   Exits:ESW>
   Syrus focuses harshly on Kisoon and utters some strange words.
   Kisoon cries out in pain as Syrus grabs him.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Good**] Mem:3
   Exits:ESW>
   Manny cleaves Kelpo extremely hard.
   A young adventurer hits Kisoon extremely hard.
   A young adventurer hits Kisoon hard.
   Nana slashes Kisoon extremely hard.
   Kisoon misses Nana with his bludgeon.
   Kort misses Kelpo with his slash.
   Kelpo misses Kort with his bludgeon.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW> c 'h p' kelpo
   Kisoon stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Kelpo stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Nana crashes into Kisoon in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Eligarf focuses harshly on Kelpo and utters some strange words.
   Flesh burns as Eligarf enshrouds Kelpo in a cloak of flames.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Philanderer arrives from the south.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Woa flies in from the east.
   Parn arrives from the east.
   Gabol flies in from the east.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW> You utter the words, 'hold person'
   The magic fails!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Philanderer leaves west.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Lathalos arrives from the south.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Kelpo focuses harshly on Kort and utters the words, 'hold monster'.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Woa slowly fades into existence.
   Woa crashes into Syrus in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Parn slowly fades into existence.
   Nana steps aside as Parn attempts a bash, stumbles, and falls flat on
   his face.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Philanderer arrives from the west.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Fair**] Mem:3
   Exits:ESW>
   Parn cleaves Nana very hard.
   Woa massacres Syrus with his crush.
   Manny cleaves Kelpo hard.
   A young adventurer hits Kisoon hard.
   A young adventurer hits Kisoon very hard.
   Nana massacres Kisoon with his slash.
   Kisoon bludgeons Nana very hard.
   Kort slashes Kelpo very hard.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Bad**] Mem:3
   Exits:ESW> c 'h p' kelpo
   Eligarf focuses harshly on Kelpo and utters some strange words.
   Flesh burns as Eligarf enshrouds Kelpo in a cloak of flames.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:3
   Exits:ESW> You utter the words, 'hold person'
   The magic fails!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Dia shouts 'play that funky music white boy'
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Manny stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Kelpo focuses harshly on Kort and utters the words, 'hold monster'.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Manny crashes into Kelpo in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Luthian flies in from the east.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Kelpo:Awful**] Mem:4
   Exits:ESW>
   Parn cleaves Nana extremely hard.
   Woa annihilates Syrus with his crush.
   Manny massacres Kelpo with his cleave.
   You receive 0 experience.
   Kelpo is dead! R.I.P.
   A young adventurer hits Kisoon extremely hard.
   Kisoon is dead! R.I.P.
   Syrus smites Jus extremely hard.
   The death cry of Kisoon echoes from somewhere nearby...
   Kisoon stops following Kelpo.
   The death cry of Kelpo echoes from somewhere nearby...
   Iopi stops following Kelpo.
   Kelpo now follows Iopi.
   Iopi is the new leader of Kelpo's group.
   Kelpo stops following Iopi.
   Luthian stops following Kelpo.
   Luthian now follows Iopi.
   Jus stops following Kelpo.
   Jus now follows Iopi.
   A pech stops following Kelpo.
   A pech transcends this world and enters another plane.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Syrus steps aside as Luthian attempts a bash, stumbles, and falls flat
   on his face.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW> tell woa
   i'm not formed with them
   Gabol utters the words, 'relocate'.
   Gabol disappears in a puff of smoke.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Eligarf issues the order 'st'.
   A young adventurer stands up.
   A young adventurer stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW> c 'f b'
   kisoon
   Eligarf issues the order 'bash kisoon'.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Dia arrives from the south.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW> You tell
   Woa 'i'm not formed with them'
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW> Who
   should the spell be cast upon?
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Syrus steps aside as Woa attempts a bash, stumbles, and falls flat on
   his face.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Lathalos leaves west.
   Syrus stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Luthian slashes Syrus extremely hard.
   Kort slashes Iopi hard.
   Nana slashes Parn extremely hard.
   Parn cleaves Nana extremely hard.
   Woa massacres Syrus with his crush.
   Parn stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Parn crashes into Nana in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW>
   Syrus focuses harshly on Jus and utters some strange words.
   Jus cries out in pain as Syrus grabs him.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:4 Exits:ESW> c 'f b'
   luthian
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Luthian.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:5 Exits:ESW>
   Eligarf issues the order 'bash jus'.
   A young adventurer crashes into Jus in a thundering collision, knocking
   him to the ground!
   A young adventurer crashes into Jus in a thundering collision, knocking
   him to the ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:5 Exits:ESW>
   Manny gets an enchanted hoopak from the corpse of Kelpo.
   Manny gets a jagged bracer from the corpse of Kelpo.
   Manny gets a jagged bracer from the corpse of Kelpo.
   Manny gets a dwarven mining belt from the corpse of Kelpo.
   Manny gets an aspen shield from the corpse of Kelpo.
   Manny gets a pair of work gloves from the corpse of Kelpo.
   Manny gets a pair of lizard skin boots from the corpse of Kelpo.
   Manny gets a crown of heliconia flowers from the corpse of Kelpo.
   Manny gets a bone vest from the corpse of Kelpo.
   Manny gets a dog tag from the corpse of Kelpo.
   Manny gets a light medallion from the corpse of Kelpo.
   Manny gets a small grey ring from the corpse of Kelpo.
   Manny gets a black pearl from the corpse of Kelpo.
   Manny gets a chest made of bones from the corpse of Kelpo.
   Manny gets a white gold ring from the corpse of Kelpo.
   Manny gets a blue ring from the corpse of Kelpo.
   Manny gets an emerald-studded leather collar from the corpse of Kelpo.
   Manny gets a short cloak from the corpse of Kelpo.
   Manny gets a thin monocle from the corpse of Kelpo.
   Manny gets a set of thick green leather boots from the corpse of Kelpo.
   Manny gets a ragged pair of leather gloves from the corpse of Kelpo.
   Manny gets a glowing scroll of recall from the corpse of Kelpo.
   Manny gets a scroll of recall from the corpse of Kelpo.
   Manny gets a light medallion from the corpse of Kelpo.
   Manny gets a milky potion of see invisible from the corpse of Kelpo.
   Manny gets a milky potion of see invisible from the corpse of Kelpo.
   Manny gets a light medallion from the corpse of Kelpo.
   Manny gets a light medallion from the corpse of Kelpo.
   Manny gets a light medallion from the corpse of Kelpo.
   Manny gets a captain's sabre from the corpse of Kelpo.
   289H 164V 17172941X 1350C [**Manny:Perfect**] Mem:5 Exits:ESW>
   Manny crashes into Iopi in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:V.Good**] Mem:5
   Exits:ESW>
   Manny massacres Iopi with his cleave.
   A young adventurer misses Jus with his hit.
   A young adventurer hits Jus extremely hard.
   Luthian slashes Syrus extremely hard.
   Kort slashes Iopi hard.
   Nana slashes Parn very hard.
   Parn cleaves Nana extremely hard.
   Woa massacres Syrus with his crush.
   Jus misses Syrus with his smite.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW> c 'h p' luthian
   Fenmore shouts 'go to hell, honkey'
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW>
   Luthian stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW>
   Syrus focuses harshly on Jus and utters some strange words.
   Jus cries out in pain as Syrus grabs him.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW>
   Luthian crashes into Syrus in a thundering collision, knocking him to
   the ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW> You can't remember how to cast that spell!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW>
   Eligarf focuses harshly on Jus and utters some strange words.
   Flesh burns as Eligarf enshrouds Jus in a cloak of flames.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:5
   Exits:ESW> c 'f b' luthian
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Luthian.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Woa stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Syrus steps aside as Woa attempts a bash, stumbles, and falls flat on
   his face.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Manny massacres Iopi with his cleave.
   A young adventurer hits Jus very hard.
   A young adventurer hits Jus very hard.
   Luthian massacres Syrus with his slash.
   Kort slashes Iopi extremely hard.
   Nana slashes Parn extremely hard.
   Parn massacres Nana with his cleave.
   Woa massacres Syrus with his crush.
   Iopi slashes Kort extremely hard.
   Jus smites Syrus very hard.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Nana stands up.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Nana crashes into Luthian in a thundering collision, knocking him to
   the ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Dia leaves south.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW> watch luthian
   c 'f b' luthian
   Parn crashes into Nana in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Eligarf focuses harshly on Jus and utters some strange words.
   Flesh burns as Eligarf enshrouds Jus in a cloak of flames.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW>
   Philanderer looks at Woa.
   289H 164V 17172941X 1350C [**Manny:Perfect**] [**Iopi:Good**] Mem:6
   Exits:ESW> You now watch Luthian.
   289H 164V 17172941X 1350C [**Luthian:Fair**] [**Syrus:V.Bad**] Mem:6
   Exits:ESW> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Luthian.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:V.Bad**] Mem:7
   Exits:ESW>
   Iopi stands up.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:V.Bad**] Mem:7
   Exits:ESW>
   Iopi panics, and attempts to flee.
   Iopi flies east.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:V.Bad**] Mem:7
   Exits:ESW>
   A young adventurer misses Jus with his hit.
   A young adventurer hits Jus extremely hard.
   Luthian massacres Syrus with his slash.
   Nana slashes Parn very hard.
   Parn massacres Nana with his cleave.
   Woa annihilates Syrus with his crush.
   Jus massacres Syrus with his smite.
   Syrus smites Jus very hard.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW>
   Lathalos arrives from the west.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW>
   Iopi flies in from the east.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW>
   Iopi flies west.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW> c 'f b' luthian
   Eligarf issues the order 'st'.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW>
   Lathalos leaves east.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW>
   Jus sinks gently to the ground.
   Jus stops using a grey owl's feather.
   Jus grabs a scroll of recall.
   Jus recites a scroll of recall.
   Jus disappears.
   289H 164V 17172941X 1350C [**Luthian:Bad**] [**Syrus:Awful**] Mem:7
   Exits:ESW> You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Luthian.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] [**Syrus:Awful**] Mem:8
   Exits:ESW>
   A Palanthanian guard leaves west.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] [**Syrus:Awful**] Mem:8
   Exits:ESW>
   Syrus smites Luthian extremely hard.
   Luthian massacres Syrus with his slash.
   Nana slashes Parn very hard.
   Parn massacres Nana with his cleave.
   Woa massacres Syrus with his crush.
   Syrus is dead! R.I.P.
   The death cry of Syrus echoes from somewhere nearby...
   Nana stops following Syrus.
   Syrus now follows Nana.
   Nana is the new leader of Syrus's group.
   Syrus stops following Nana.
   Eligarf stops following Syrus.
   Eligarf now follows Nana.
   Kort stops following Syrus.
   Kort now follows Nana.
   Woa stands up.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW>
   Kort gets a small pile of coins from the corpse of Syrus.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW>
   Woa slowly fades into existence.
   Woa crashes into Kort in a thundering collision, knocking him to the
   ground!
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW>
   Lathalos arrives from the east.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW>
   Eligarf gets a glowing scroll of recall from the corpse of Syrus.
   Eligarf gets a spiritual hammer from the corpse of Syrus.
   Eligarf gets a milky potion of see invisible from the corpse of Syrus.
   Eligarf gets a milky potion of see invisible from the corpse of Syrus.
   Eligarf gets a glowing scroll of recall from the corpse of Syrus.
   Eligarf gets a glowing scroll of recall from the corpse of Syrus.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW> c 'f b'
   luthian
   Nana steps aside as Parn attempts a bash, stumbles, and falls flat on
   his face.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW>
   Eligarf issues the order 'st'.
   289H 164V 17172941X 1350C [**Luthian:V.Bad**] Mem:8 Exits:ESW> You
   utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Luthian.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   You stop watching Luthian.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   You miss Luthian with your sting.
   Luthian misses you and destroys an image.
   Woa massacres Kort with his crush.
   Kort barely slashes Woa.
   Nana massacres Parn with his slash.
   Parn massacres Nana with his cleave.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Syrus arrives from the south.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Syrus opens his prayerbook and begins reading it intently.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Lathalos leaves west.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Luthian stands up.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Luthian crashes into Syrus in a devastating bash, killing him
   mercilessly.
   Syrus is dead! R.I.P.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   The death cry of Syrus echoes from somewhere nearby...
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Eligarf issues the order 'bash parn'.
   A young adventurer crashes into Parn in a thundering collision,
   knocking him to the ground!
   Parn steps aside as a young adventurer attempts a bash, stumbles, and
   falls flat on his face.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Nana stands up.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW> c 'f b' luthian
   Lathalos arrives from the west.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Luthian steps aside as Nana attempts a bash, stumbles, and falls flat
   on his face.
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW>
   Manny crashes into Luthian in a thundering collision, knocking him to
   the ground!
   289H 164V 17172941X 1350C [Scelesta:Perfect] [Luthian:Awful] Mem:9
   Exits:ESW> Manny misses Luthian with his cleave.
   A young adventurer hits Parn extremely hard.
   A young adventurer misses Parn with his hit.
   You miss Luthian with your sting.
   Luthian slashes YOU extremely hard.
   Woa annihilates Kort with his crush.
   Kort bruises Woa with his slash.
   Nana slashes Parn extremely hard.
   Parn massacres Nana with his cleave.
   You utter the words, 'force bolt'
   Your force bolt shatters Luthian's skull into lifeless goo.
   You receive 0 experience.
   Luthian is dead! R.I.P.
   270H 164V 17172941X 1350C [Luthian:Dying] Mem:10 Exits:ESW>
   The death cry of Luthian echoes from somewhere nearby...
   Luthian sinks gently to the ground.
   Philanderer gets a very large pile of coins from the corpse of Luthian.
   270H 164V 17172941X 1350C Mem:10 Exits:ESW>
   Kort steps aside as Woa attempts a bash, stumbles, and falls flat on
   his face.
   270H 164V 17172941X 1350C Mem:10 Exits:ESW> get all corpse
   Kort stands up.
   270H 164V 17172941X 1350C Mem:10 Exits:ESW>
   Lathalos leaves west.
   270H 164V 17172941X 1350C Mem:10 Exits:ESW> get all 2.corpse
   Eligarf utters some strange words.
   Philanderer is torn to pieces by hundreds of shards of ice.
   Philanderer is dead! R.I.P.
   Parn is shredded by shards of ice.
   Woa is shredded by shards of ice.
   Manny is shredded by shards of ice.
   A pech is shredded by shards of ice.
   Eligarf destroys your mirror images.
   The images around you fade out of existance.
   Your body is torn by huge pieces of ice.
   Kort is shredded by shards of ice.
   Nana is shredded by shards of ice.
   Bucky is torn to pieces by hundreds of shards of ice.
   Bucky is dead! R.I.P.
   227H 164V 17172941X 1350C [Philanderer:Dying] [Eligarf:Perfect] Mem:10
   Exits:ESW>
   The death cry of Philanderer echoes from somewhere nearby...
   The death cry of Bucky echoes from somewhere nearby...
   Kort gets a small pile of coins from the corpse of Bucky.
   227H 164V 17172941X 1350C [Scelesta:Good] [Eligarf:Perfect] Mem:10
   Exits:ESW>
   Kort crashes into Woa in a thundering collision, knocking him to the
   ground!
   227H 164V 17172941X 1350C [Scelesta:Good] [Eligarf:Perfect] Mem:10
   Exits:ESW> l
   Eligarf misses you with his hit.
   You miss Eligarf with your sting.
   A pech slowly fades into existence.
   A pech hits Eligarf very hard.
   Manny cleaves Eligarf hard.
   A young adventurer misses Parn with his hit.
   A young adventurer hits Parn.
   Woa massacres Kort with his crush.
   Kort slashes Woa very hard.
   Nana slashes Parn very hard.
   Parn cleaves Nana extremely hard.
   227H 164V 17172941X 1350C [Scelesta:Good] [Eligarf:V.Good] Mem:10
   Exits:ESW> You get a wooden training club from the corpse of Bucky.
   You get a training shield from the corpse of Bucky.
   You get a pair of leather training boots from the corpse of Bucky.
   You get a leather training cap from the corpse of Bucky.
   You get some leather training armor from the corpse of Bucky.
   You get a map of Palanthas from the corpse of Bucky.
   You get a small leather bag from the corpse of Bucky.
   You get a hooded lantern from the corpse of Bucky.
   You get a complimentary stable note from the corpse of Bucky.
   You get a loaf of bread from the corpse of Bucky.
   You get a loaf of bread from the corpse of Bucky.
   You get a waterskin from the corpse of Bucky.
   227H 164V 17172941X 1350C [Scelesta:Good] [Eligarf:V.Good] Mem:10
   Exits:ESW> flee
   You get a long training sword from the corpse of Philanderer.
   You get a training shield from the corpse of Philanderer.
   Boots : You can't carry that many items.
   Cap : You can't carry that many items.
   Armor : You can't carry that many items.
   You get a very large pile of coins from the corpse of Philanderer.
   There were 1751 coins.
   Map : You can't carry that many items.
   Sword : You can't carry that many items.
   Bag : You can't carry that many items.
   Lantern : You can't carry that many items.
   Note : You can't carry that many items.
   Bread : You can't carry that many items.
   Bread : You can't carry that many items.
   Waterskin : You can't carry that many items.
   227H 164V 17172941X 3101C [Scelesta:Good] [Eligarf:V.Good] Mem:10
   Exits:ESW> flee
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   The corpse of Bucky is lying here.
   The corpse of Philanderer is lying here.
   The corpse of Luthian is lying here.
   The corpse of Syrus is lying here. [2]
   The corpse of Kelpo is lying here.
   The corpse of Kisoon is lying here.
   A small roll of bread lies here...it glows blue [9]
   Parn Shop is sitting here, fighting Nana.
   Woa Nitro, Rallying the Pirates around the Bloody Standard is sitting
   here, fighting Kort. (flying)
   Manny the Male Wild Elf is standing here, fighting Eligarf.
   A young adventurer is standing here, fighting Parn.
   A young adventurer is sitting here, fighting Parn.
   Eligarf the Male Human is standing here, fighting YOU.
   A pech is standing here, fighting Eligarf.
   Kort O'Law, Corporate Judge is standing here, fighting Woa.
   sca
   . . . is outlined with a glittery dust.
   Nana, Corporate Bag Man is sitting here, fighting Parn.
   . . . is outlined with a glittery dust.
   227H 164V 17172941X 3101C [Scelesta:Good] [Eligarf:V.Good] Mem:10
   Exits:ESW> You flee head over heels.
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas. (invisible)
   227H 163V 17172941X 3101C Mem:10 Exits:ESW> You're not fighting, why
   bother fleeing?
   227H 163V 17172941X 3101C Mem:10 Exits:ESW>
   Iopi flies in from the south.
   227H 163V 17172941X 3101C Mem:10 Exits:ESW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Parn Shop is sitting here, fighting Nana.
   Woa Nitro, Rallying the Pirates around the Bloody Standard is sitting
   here, fighting Kort. (flying)
   Manny the Male Wild Elf is standing here, fighting Eligarf.
   A young adventurer is standing here, fighting Parn.
   A young adventurer is sitting here, fighting Parn.
   Eligarf the Male Human is standing here, fighting a pech.
   A pech is standing here, fighting Eligarf.
   Kort O'Law, Corporate Judge is standing here, fighting Woa.
   . . . is outlined with a glittery dust.
   Nana, Corporate Bag Man is sitting here, fighting Parn.
   . . . is outlined with a glittery dust.
   Looking south:
   You see nothing special.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   An apprentice mage is here watching the store for his master.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   227H 163V 17172941X 3101C Mem:10 Exits:ESW>
   Iopi flies east.
   227H 163V 17172941X 3101C Mem:10 Exits:ESW> e
   Iopi flies in from the east.
   227H 163V 17172941X 3101C Mem:10 Exits:ESW> Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   The corpse of Bucky is lying here.
   The corpse of Philanderer is lying here.
   The corpse of Luthian is lying here.
   The corpse of Syrus is lying here. [2]
   The corpse of Kelpo is lying here.
   The corpse of Kisoon is lying here.
   A small roll of bread lies here...it glows blue [9]
   Bucky the Male Hylar Dwarf is standing here.
   Parn Shop is sitting here, fighting Nana.
   Woa Nitro, Rallying the Pirates around the Bloody Standard is sitting
   here, fighting Kort. (flying)
   Manny the Male Wild Elf is standing here, fighting Eligarf.
   A young adventurer is standing here, fighting Parn.
   A young adventurer is sitting here, fighting Parn.
   Eligarf the Male Human is standing here, fighting a pech.
   A pech is standing here, fighting Eligarf.
   Kort O'Law, Corporate Judge is standing here, fighting Woa.
   . . . is outlined with a glittery dust.
   Nana, Corporate Bag Man is standing here, fighting Parn.
   . . . is outlined with a glittery dust.
   227H 162V 17172941X 3101C Mem:10 Exits:ESW>
   Manny gets a small down feather from the corpse of Luthian.
   Manny gets an ergothian battle blade from the corpse of Luthian.
   227H 162V 17172941X 3101C Mem:10 Exits:ESW>
   Manny panics, and attempts to flee.
   Manny leaves east.
   227H 162V 17172941X 3101C Mem:10 Exits:ESW>
   Eligarf misses a pech with his hit.
   A pech hits Eligarf very hard.
   A young adventurer hits Parn very hard.
   A young adventurer hits Parn extremely hard.
   Woa massacres Kort with his crush.
   Kort slashes Woa extremely hard.
   Nana massacres Parn with his slash.
   Parn massacres Nana with his cleave.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW>
   Eligarf gets a pair of leather training boots from the corpse of
   Philanderer.
   Eligarf gets a leather training cap from the corpse of Philanderer.
   Eligarf gets some leather training armor from the corpse of
   Philanderer.
   Eligarf gets a map of Palanthas from the corpse of Philanderer.
   Eligarf gets a short training sword from the corpse of Philanderer.
   Eligarf gets a small leather bag from the corpse of Philanderer.
   Eligarf gets a hooded lantern from the corpse of Philanderer.
   Eligarf gets a complimentary stable note from the corpse of
   Philanderer.
   Eligarf gets a loaf of bread from the corpse of Philanderer.
   Eligarf gets a loaf of bread from the corpse of Philanderer.
   Eligarf gets a waterskin from the corpse of Philanderer.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW>
   Bucky bruises Eligarf with his hit.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW> l
   Parn stands up.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW>
   Nana panics, and attempts to flee.
   Nana leaves south.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW>
   Parn crashes into a young adventurer in a thundering collision,
   knocking him to the ground!
   244H 166V 17172941X 3101C Mem:9 Exits:ESW> Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   The corpse of Bucky is lying here.
   The corpse of Philanderer is lying here.
   The corpse of Luthian is lying here.
   The corpse of Syrus is lying here. [2]
   The corpse of Kelpo is lying here.
   The corpse of Kisoon is lying here.
   A small roll of bread lies here...it glows blue [9]
   Bucky the Male Hylar Dwarf is standing here, fighting Eligarf.
   Parn Shop is standing here, fighting a young adventurer.
   Woa Nitro, Rallying the Pirates around the Bloody Standard is sitting
   here, fighting Kort. (flying)
   A young adventurer is sitting here, fighting Parn.
   A young adventurer is sitting here, fighting Parn.
   Eligarf the Male Human is standing here, fighting a pech.
   A pech is standing here, fighting Eligarf.
   Kort O'Law, Corporate Judge is standing here, fighting Woa.
   . . . is outlined with a glittery dust.
   244H 166V 17172941X 3101C Mem:9 Exits:ESW>
   Eligarf utters some strange words.
   Your body is torn by huge pieces of ice.
   Bucky is torn to pieces by hundreds of shards of ice.
   Bucky is dead! R.I.P.
   Parn is shredded by shards of ice.
   Woa is shredded by shards of ice.
   A pech is shredded by shards of ice.
   A pech is mortally wounded, and will die soon, if not aided.
   Kort is shredded by shards of ice.
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW>
   Nana arrives from the south.
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW>
   The death cry of Bucky echoes from somewhere nearby...
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW>
   You sting Eligarf.
   Parn massacres a young adventurer with his cleave.
   A young adventurer misses Parn with his hit.
   A young adventurer hits Parn hard.
   Woa massacres Kort with his crush.
   Kort misses Woa with his slash.
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW>
   Kelpo arrives from the south.
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW> flee
   flee
   Woa steps aside as Kort attempts a bash, stumbles, and falls flat on
   his face.
   200H 166V 17172941X 3101C [a pech:Dying] [Eligarf:V.Good] Mem:9
   Exits:ESW> sca
   You flee head over heels.
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas. (invisible)
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> You're not fighting, why
   bother fleeing?
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Lord Kelpo Vonaxle III is standing here.
   Nana, Corporate Bag Man is standing here.
   . . . is outlined with a glittery dust.
   Parn Shop is standing here, fighting a young adventurer.
   Woa Nitro, Rallying the Pirates around the Bloody Standard is sitting
   here, fighting Kort. (flying)
   A young adventurer is sitting here, fighting Parn.
   A young adventurer is sitting here, fighting Parn.
   Eligarf the Male Human is standing here, fighting a pech.
   A pech is lying here, about to die.
   Kort O'Law, Corporate Judge is sitting here, fighting Woa.
   . . . is outlined with a glittery dust.
   Looking south:
   You see nothing special.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   An apprentice mage is here watching the store for his master.
   Looking west:
   You see nothing special.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW>
   Flexer arrives from the east.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW>
   Flexer leaves south.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW>
   Your blood freezes as you hear someone's death cry.
   A pech stops following you.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> gt well
   Woa flies in from the east.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> in
   You tell your group 'well'
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> You are carrying:
   a training shield
   a long training sword
   a waterskin
   a loaf of bread [2]
   a complimentary stable note
   a hooded lantern
   a small leather bag
   a map of Palanthas
   some leather training armor
   a leather training cap
   a pair of leather training boots
   a training shield
   a wooden training club
   an entire loaf of bread [3]
   a toy stuffed dog
   some phosphorous moss..it glows dimly [2]
   a large first-aid kit
   a noisy cowbell [2]
   a cup
   a jewel engraved grail..it glows blue
   a ceramic urn
   a bent tin shield [2]
   a small wooden chest
   a glowing scroll of recall..it glows blue..it glows dimly
   a small wooden lute
   a large waterskin
   a blue potion of remove poison..it glows blue
   a large waterskin
   a grey leather pouch..it glows blue
   200H 165V 17172941X 3101C Mem:9 Exits:ESW>
   Woa flies east.
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> gt that was hilarious
   You tell your group 'that was hilarious'
   200H 165V 17172941X 3101C Mem:9 Exits:ESW> l
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas. (invisible)
   200H 165V 17172941X 3101C Mem:9 Exits:ESW>
   ----------------------------------------------------------------
   200H 164V 17172941X 3101C Mem:9 Exits:ESW>
   Manny leaves south.
   200H 164V 17172941X 3101C Mem:9 Exits:ESW>
   Woa slowly fades into existence.
   Woa crashes into Kort in a thundering collision, knocking him to the
   ground!
   200H 164V 17172941X 3101C Mem:9 Exits:ESW>
   Woa massacres Kort with his crush.
   Kort massacres Bucky with his slash.
   Bucky is dead! R.I.P.
   Parn massacres a young adventurer with his cleave.
   A young adventurer misses Parn with his hit.
   A young adventurer hits Parn very hard.
   The death cry of Bucky echoes from somewhere nearby...
   ----------------------------------------------------------------
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A large shield of gleaming bronze lies here.
   A waterskin is lying here. [2]
   A large white box made of wood is sitting on the ground here.
   The corpse of Bucky is lying here.
   The corpse of Kelpo is lying here.
   The corpse of a pech is lying here.
   The corpse of Bucky is lying here. [2]
   The corpse of Philanderer is lying here.
   The corpse of Luthian is lying here.
   The corpse of Syrus is lying here. [2]
   The corpse of Kelpo is lying here.
   The corpse of Kisoon is lying here.
   A small roll of bread lies here...it glows blue [9]
   Woa Nitro, Rallying the Pirates around the Bloody Standard is standing
   here, fighting Kort. (flying)
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   Kort O'Law, Corporate Judge is sitting here, fighting Woa.
   . . . is outlined with a glittery dust.
   Bucky the Male Hylar Dwarf is standing here.
   Manny the Male Wild Elf is standing here.
   Eligarf the Male Human is standing here.
   A young adventurer newly arrived in town is looking for the tavern.
   A young adventurer newly arrived in town is looking for the tavern.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Woa massacres Kort with his crush.
   Kort misses Woa with his slash.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Eligarf looks at Woa.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Kort stands up.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Kelpo arrives from the south.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Woa crashes into Kort in a thundering collision, knocking him to the
   ground!
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Eligarf focuses harshly on Woa and utters some strange words.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW> wield staff
   You do not seem to have what you are looking for.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Poda arrives from the south.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Woa annihilates Kort with his crush.
   Kort is dead! R.I.P.
   The death cry of Kort echoes from somewhere nearby...
   Kort stops following Eligarf.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Poda leaves west.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW>
   Kelpo gets a pile of coins from the corpse of Kort.
   234H 166V 17172941X 4528C Mem:8 Exits:ESW> c 'e drain' kelpo
   You utter the words, 'energy drain'
   Kelpo crumples as you kill him by draining his energy.
   You receive 0 experience.
   Kelpo is dead! R.I.P.
   234H 166V 17172941X 4528C [Kelpo:Dying] Mem:10 Exits:ESW>

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
