<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Battle of the useless area

POV: Lara

Log Rating: 1.7333

Really, for 9th circle spell, tent is a joke, wheres my pws! Tornado
looking shaky too...

Maratus flies east.
You follow Velhuus east.
Eastern Paladine Way
Arvar, Chekist of the Wild is standing here. (flying) (invisible)
Koili S'Kum, Bloody Goblins Band is standing here. (flying) (red aura)
Noko Zaeboko, Red Reincarnate of Mavlad is standing here. (flying) (red
aura)
. . . is outlined with a dim aura.
You sense that you are not alone.
Yuhee, Six Wrecks and Forty Disasters is standing here. (flying)
(invisible)
One of Caergoth's humble citizens is out on some business today.
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Woa slowly fades into existence.
Woa crashes into Arvar in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Maratus slowly fades into existence.
Maratus crashes into Koili in a thundering collision, knocking him to
the ground!
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Pti slowly fades into existence.
Pti crashes into Kel in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Zyyr slowly fades into existence.
Zyyr crashes into Arvar in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Zyyr massacres Arvar with her slash.
Pti cleaves Kel extremely hard.
Kel comes out of hiding.
Kel massacres Pti with his pierce.
Kel pierces Pti extremely hard.
Maratus massacres Koili with her slash.
Maratus massacres Koili with her slash.
Koili misses Maratus with his crush.
Woa massacres Arvar with his crush.
Arvar pierces Woa very hard.
Arvar barely slashes Woa.
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Jabbervok slowly fades into existence.
Koili steps aside as Jabbervok attempts a bash, stumbles, and falls
flat on her face.
354H 71V 1X 3997C Mem:3 Exits:N(E)SW>
Through your wizard's eye: a Solace peacekeeper has arrived from the
north exit.
354H 71V 1X 3997C Mem:3 Exits:N(E)SW> cmt
You utter the words, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Arvar screams in pain as inky black tentacles constrict him.
Koili screams in pain as inky black tentacles constrict him.
Noko screams in pain as inky black tentacles constrict her.
Kel screams in pain as inky black tentacles constrict him.
Yuhee screams in pain as inky black tentacles constrict him.
A humble citizen screams in pain as inky black tentacles constrict her.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Terl utters some strange words.
The air swirls and a funnel cloud forms.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Velhuus focuses on Habutz and utters the words, 'haste'.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Yuhee gets a scroll from his satchel.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Yuhee stops using a flaming white whip.
Yuhee grabs a glowing scroll of recall.
Yuhee recites a glowing scroll of recall.
Yuhee disappears.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
#10 SECONDS TO TICK
Woa crashes into Arvar in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Koili steps aside as Maratus attempts a bash, stumbles, and falls flat
on her face.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Habutz slowly fades into existence.
Habutz comes out of hiding.
Habutz massacres Kel with his slash.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Terl slowly fades into existence.
A small whirlwind crashes into Kel, pummeling his entire body.
A humble citizen screams in pain as inky black tentacles constrict her.
Terl slashes Kel very hard.
Habutz misses Kel with his slash.
Noko misses you with her bludgeon.
You massacre Arvar with your bludgeon.
Jabbervok misses Koili with her hit.
Zyyr massacres Arvar with her slash.
Pti cleaves Kel extremely hard.
Pti massacres Kel with his cleave.
Kel massacres Pti with his pierce.
Kel pierces Pti extremely hard.
Maratus massacres Koili with her slash.
Maratus slashes Koili extremely hard.
Koili massacres Maratus with his crush.
Woa massacres Arvar with his crush.
Woa massacres Arvar with his crush.
Arvar misses Woa with his pierce.
Arvar misses Woa with his slash.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW>
Terl utters some strange words.
The air swirls and a funnel cloud forms.
354H 71V 1X 3997C [Me:Perfect] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW> quaff brewed
You quaff a brewed potion which dissolves.
Your body grows to immense proportions.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Fair] Mem:4
Exits:N(E)SW> cmt
Velhuus utters the words, 'malevolent tentacles'.
Velhuus conjures a writhing mass of inky black tentacles!
Velhuus slowly fades into existence.
Arvar screams in pain as inky black tentacles constrict him.
Koili screams in pain as inky black tentacles constrict him.
Noko screams in pain as inky black tentacles constrict her.
Kel screams in pain as inky black tentacles constrict him.
A humble citizen is strangled to death by the writhing black tentacles.
You receive 0 experience.
A humble citizen is dead! R.I.P.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:4
Exits:N(E)SW>
The death cry of a humble citizen echoes from somewhere nearby...
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:4
Exits:N(E)SW> You utter the words
, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Arvar screams in pain as inky black tentacles constrict him.
Koili screams in pain as inky black tentacles constrict him.
Noko screams in pain as inky black tentacles constrict her.
Kel screams in pain as inky black tentacles constrict him.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:6
Exits:N(E)SW>
Habutz crashes into Kel in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:6
Exits:N(E)SW>
Through your wizard's eye: a Solace peacekeeper has left through the
east exit.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:6
Exits:N(E)SW>
Noko focuses on Arvar and utters some strange words.
Noko heals Arvar.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Good] Mem:6
Exits:N(E)SW>
Maratus stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Good] Mem:6
Exits:N(E)SW> cmt
Koili steps aside as Maratus attempts a bash, stumbles, and falls flat
on her face.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Good] Mem:6
Exits:N(E)SW>
Kel steps aside as Pti attempts a bash, stumbles, and falls flat on his
face.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Good] Mem:6
Exits:N(E)SW>
A small whirlwind crashes into Noko, pummeling her entire body.
A small whirlwind crashes into Arvar, pummeling his entire body.
Velhuus misses Arvar with her bludgeon.
Habutz slashes Kel extremely hard.
Habutz massacres Kel with his slash.
Jabbervok misses Koili with her hit.
Zyyr massacres Arvar with her slash.
Pti cleaves Kel very hard.
Pti cleaves Kel extremely hard.
Kel annihilates Pti with his pierce.
Kel annihilates Pti with his pierce.
Maratus massacres Koili with her slash.
Maratus massacres Koili with her slash.
Koili massacres Maratus with his crush.
Woa massacres Arvar with his crush.
Arvar misses Woa with his pierce.
Arvar slashes Woa hard.
Zyyr gets a vial from her girdle.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Through your wizard's eye: Ryoga has arrived from the north exit.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Zyyr quaffs a vial of orange flame.
Zyyr smiles as the air around her solidifies.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Jabbervok stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Through your wizard's eye: Ryoga has left through the west exit.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Zyyr crashes into Noko in a thundering collision, knocking her to the
ground!
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Koili stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Koili steps aside as Jabbervok attempts a bash, stumbles, and falls
flat on her face.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW>
Terl utters some strange words.
The air swirls and a funnel cloud forms.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW> The corpse doesn't
seem to have what you are looking for.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW> Velhuus utters the
words, 'malevolent tentacles'.
Velhuus conjures a writhing mass of inky black tentacles!
Arvar screams in pain as inky black tentacles constrict him.
Koili screams in pain as inky black tentacles constrict him.
Noko screams in pain as inky black tentacles constrict her.
Kel screams in pain as inky black tentacles constrict him.
Woa crashes into Arvar in a thundering collision, knocking him to the
ground!
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a steel coin
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Good] Mem:6
Exits:N(E)SW> You utter the word
s, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Arvar screams in pain as inky black tentacles constrict him.
Koili screams in pain as inky black tentacles constrict him.
Noko screams in pain as inky black tentacles constrict her.
Kel screams in pain as inky black tentacles constrict him.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Fair] Mem:7
Exits:N(E)SW>
Maratus stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Fair] Mem:7
Exits:N(E)SW>
Kel steps aside as Maratus attempts a bash, stumbles, and falls flat on
her face.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Fair] Mem:7
Exits:N(E)SW> cmt
Pti stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Fair] Mem:7
Exits:N(E)SW>
A small whirlwind crashes into Arvar, pummeling his entire body.
A small whirlwind crashes into Kel, pummeling his entire body.
Noko is strangled to death by the writhing black tentacles.
Noko is dead! R.I.P.
Habutz massacres Kel with his slash.
Jabbervok misses Koili with her hit.
Zyyr massacres Arvar with her slash.
Zyyr massacres Arvar with her slash.
Pti massacres Kel with his cleave.
Pti cleaves Kel very hard.
Kel is mortally wounded, and will die soon, if not aided.
Maratus slashes Koili extremely hard.
Maratus slashes Koili extremely hard.
Koili massacres Maratus with his crush.
Woa annihilates Arvar with his crush.
Woa massacres Arvar with his crush.
Arvar misses Woa with his pierce.
Arvar slashes Woa extremely hard.
The death cry of Noko echoes from somewhere nearby...
Noko sinks gently to the ground.
Pti crashes into Kel in a devastating bash, killing him mercilessly.
You receive 0 experience.
Kel is dead! R.I.P.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
The death cry of Kel echoes from somewhere nearby...
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
#TICK
cmt
Habutz is zapped by a jagged spear and instantly drops it.
Habutz gets an emerald short sword from the corpse of Kel.
Habutz gets a spiked bronze bracer from the corpse of Kel.
Habutz is zapped by an etched cobalt bracer and instantly drops it.
Habutz is zapped by a girdle with a human skull buckle and instantly
drops it.
Habutz gets a heavy asbestos apron from the corpse of Kel.
Habutz gets the ancient sleeves of stealth from the corpse of Kel.
Habutz gets a pair of silver clawed gauntlets from the corpse of Kel.
Habutz gets a pair of black climbing talons from the corpse of Kel.
Habutz is zapped by a pair of gnome-skin pants and instantly drops it.
Habutz gets a dog's head hood from the corpse of Kel.
Habutz gets a suit of red dragonscale plate from the corpse of Kel.
Habutz is zapped by the Gargoyle chieftain's cloak and instantly drops
it.
Habutz is zapped by an inverted cross and instantly drops it.
Habutz is zapped by the black knight's insignia and instantly drops it.
Habutz is zapped by the black knight's insignia and instantly drops it.
Habutz gets a brewed potion from the corpse of Kel.
Habutz gets a brewed potion from the corpse of Kel.
Habutz gets a brewed potion from the corpse of Kel.
Habutz gets a bottle of green paste from the corpse of Kel.
Habutz gets a bottle of green paste from the corpse of Kel.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
Koili gets a scroll from his pouch.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
Koili stops using a black sledgehammer.
Koili grabs a glowing scroll of recall.
Koili recites a glowing scroll of recall.
Koili disappears.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
Terl utters some strange words.
The air swirls and a funnel cloud forms.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW>
Woa is zapped by the black knight's insignia and instantly drops it.
Woa is zapped by the black knight's insignia and instantly drops it.
Woa is zapped by an inverted cross and instantly drops it.
Woa is zapped by the Gargoyle chieftain's cloak and instantly drops it.
Woa is zapped by a pair of gnome-skin pants and instantly drops it.
Woa is zapped by a girdle with a human skull buckle and instantly drops
it.
Woa is zapped by an etched cobalt bracer and instantly drops it.
Woa is zapped by a jagged spear and instantly drops it.
Woa gets the corpse of Kel.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:7
Exits:N(E)SW> You utter the words
, 'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
Arvar screams in pain as inky black tentacles constrict him.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Bad] Mem:8
Exits:N(E)SW>
A Knight of the Crown arrives from the south.
Velhuus utters the words, 'malevolent tentacles'.
Velhuus conjures a writhing mass of inky black tentacles!
A Knight of the Crown screams in pain as inky black tentacles constrict
him.
Arvar screams in pain as inky black tentacles constrict him.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Bad] Mem:8
Exits:N(E)SW>
The violent funnel cloud rips through the area, hitting nothing.
A small whirlwind crashes into a Knight of the Crown, pummeling his
entire body.
A Knight of the Crown screams in pain as inky black tentacles constrict
him.
Terl misses a Knight of the Crown with his slash.
Zyyr massacres Arvar with her slash.
Woa massacres Arvar with his crush.
Woa massacres Arvar with his crush.
Arvar misses Woa with his pierce.
Arvar's blow is absorbed by Woa's armor.
Pti gets a large pile of coins from the corpse of Noko.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Bad] Mem:8
Exits:N(E)SW>
Pti gets a staff of meditation from the corpse of Noko.
Pti gets a blue guardian robe from the corpse of Noko.
Pti gets a griffon wing shield from the corpse of Noko.
Pti gets a pair of black ice arm guards from the corpse of Noko.
Pti gets a pair of grey leather boots from the corpse of Noko.
Pti gets some dark leggings from the corpse of Noko.
Pti gets a nephaline crown inlaid with fire opals from the corpse of
Noko.
Pti gets a chasuble from the corpse of Noko.
Pti gets a necklace of gnomish ears from the corpse of Noko.
Pti gets a dark amulet from the corpse of Noko.
Pti gets a loop of darkness from the corpse of Noko.
Pti gets a mithril and gold ring from the corpse of Noko.
Pti gets a bright ball of light from the corpse of Noko.
Pti gets a piece of sweet bread from the corpse of Noko.
Pti gets a mithril cube from the corpse of Noko.
Pti gets a grey leather pouch from the corpse of Noko.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Bad] Mem:8
Exits:N(E)SW>
Pti gets a steel coin from the corpse of a humble citizen.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Bad] Mem:8
Exits:N(E)SW>
Pti gets a jagged spear.
Pti gets an etched cobalt bracer.
Pti gets a girdle with a human skull
Pti gets a pair of gnome-skin pants.
Pti gets the Gargoyle chieftain's cloak.
Pti gets an inverted cross.
Pti gets the black knight's insignia.
Pti gets the black knight's insignia.
Pti gets the corpse of Noko.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:V.Bad] Mem:8
Exits:N(E)SW>
Zyyr crashes into Arvar in a thundering collision, knocking him to the
ground!
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW> cmt
Jabbervok stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW>
Arvar steps aside as Woa attempts a bash, stumbles, and falls flat on
his face.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW>
Habutz slowly fades into existence.
Habutz comes out of hiding.
Habutz slashes Arvar extremely hard.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW>
Maratus stands up.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW> Maratus misses Ar
var with her slash.
The corpse doesn't seem to have what you are looking for.
354H 71V 1X 3997C [Me:V.Good] [Woa:V.Good] [Arvar:Awful] Mem:8
Exits:N(E)SW> The violent funne
l dissipates.
A Knight of the Crown screams in pain as inky black tentacles constrict
him.
Maratus slashes Arvar extremely hard.
Maratus slashes Arvar extremely hard.
Habutz slashes Arvar extremely hard.
Habutz massacres Arvar with his slash.
Terl misses a Knight of the Crown with his slash.
Velhuus bludgeons Arvar extremely hard.
Arvar is incapacitated and will slowly die, if not aided.
You massacre Arvar with your bludgeon.
You receive 0 experience.
Arvar is dead! R.I.P.
The death cry of Arvar echoes from somewhere nearby...
Iduna stops following Arvar.
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a long diamond-edged blade..it glows blue
an old and tarnished lance..it glows blue
a belt-pouch
a large backpack
a pair of midnight blue bracers..it glows blue
some worn dwarven gloves
the robe of the elements..it glows blue
a crimson cape..it glows blue
a medallion of Paladine
a ring of ice..it glows blue..it glows dimly
a very large pile of coins
a pair of leather sleeves..it glows blue
a crimson cape..it glows blue
a scroll of recall..it glows blue
a glowing scroll of recall..it glows blue..it glows dimly
a scroll of recall..it glows blue
a milky potion of see invisible..it glows blue
a gnome skull
a rusted iron shield
a glowing ice crystal..it glows blue..it glows dimly
[return for more, q to stop]
354H 71V 1X 3997C Mem:8 Exits:N(E)SW>
Pti massacres a Knight of the Crown with his cleave.
354H 71V 1X 3997C Mem:8 Exits:N(E)SW>
Velhuus gets a very large pile of coins from the corpse of Arvar.
354H 71V 1X 3997C Mem:8 Exits:N(E)SW> It's a pretty ghastly sight!
Searching through the remai
ns, you find:
corpse (here) :
a long diamond-edged blade..it glows blue
an old and tarnished lance..it glows blue
a belt-pouch
a large backpack
a pair of midnight blue bracers..it glows blue
some worn dwarven gloves
the robe of the elements..it glows blue
a crimson cape..it glows blue
a medallion of Paladine
a ring of ice..it glows blue..it glows dimly
a pair of leather sleeves..it glows blue
a crimson cape..it glows blue
a scroll of recall..it glows blue
a glowing scroll of recall..it glows blue..it glows dimly
a scroll of recall..it glows blue
a milky potion of see invisible..it glows blue
a gnome skull
a rusted iron shield
a glowing ice crystal..it glows blue..it glows dimly
a piece of sweet bread..it glows blue
[return for more, q to stop]a scribed scroll..it glows blue
a timberwolf pelt
a pork pie
some small gold links
a purple silk robe..it glows blue..it glows dimly
a holy symbol made of oak..it glows blue
a scorched black scaled band (invisible)
a pinch of white talcum
a pouch
354H 71V 1X 3997C Mem:8 Exits:N(E)SW> You utter the words, 'malevolent
tentacles'
You conjure a writhing mass of inky black tentacles!
A Knight of the Crown screams in pain as inky black tentacles constrict
him.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
Through your wizard's eye: a Solace peacekeeper has arrived from the
north exit.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
Jabbervok gets a long diamond-edged blade from the corpse of Arvar.
Jabbervok gets an old and tarnished lance from the corpse of Arvar.
Jabbervok gets a belt-pouch from the corpse of Arvar.
Jabbervok gets a large backpack from the corpse of Arvar.
Jabbervok gets a pair of midnight blue bracers from the corpse of
Arvar.
Jabbervok gets some worn dwarven gloves from the corpse of Arvar.
Jabbervok gets the robe of the elements from the corpse of Arvar.
Jabbervok gets a crimson cape from the corpse of Arvar.
Jabbervok gets a medallion of Paladine from the corpse of Arvar.
Jabbervok gets a ring of ice from the corpse of Arvar.
Jabbervok gets a pair of leather sleeves from the corpse of Arvar.
Jabbervok gets a crimson cape from the corpse of Arvar.
Jabbervok gets a scroll of recall from the corpse of Arvar.
Jabbervok gets a glowing scroll of recall from the corpse of Arvar.
Jabbervok gets a scroll of recall from the corpse of Arvar.
Jabbervok gets a milky potion of see invisible from the corpse of
Arvar.
Jabbervok gets a gnome skull from the corpse of Arvar.
Jabbervok gets a rusted iron shield from the corpse of Arvar.
Jabbervok gets a glowing ice crystal from the corpse of Arvar.
Jabbervok gets a piece of sweet bread from the corpse of Arvar.
Jabbervok gets a scribed scroll from the corpse of Arvar.
Jabbervok gets a timberwolf pelt from the corpse of Arvar.
Jabbervok gets a pork pie from the corpse of Arvar.
Jabbervok gets some small gold links from the corpse of Arvar.
Jabbervok gets a purple silk robe from the corpse of Arvar.
Jabbervok gets a holy symbol made of oak from the corpse of Arvar.
Jabbervok gets a pinch of white talcum from the corpse of Arvar.
Jabbervok gets a pouch from the corpse of Arvar.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
A Knight of the Crown tries in vain to disarm Velhuus's weapon.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
Woa stands up.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW> g all corpse
Habutz gets a scorched black scaled band from the corpse of Arvar.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
Through your wizard's eye: a drunken dwarf has left through the east
exit.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
A Knight of the Crown steps aside as Pti attempts a bash, stumbles, and
falls flat on his face
.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
Habutz slashes a Knight of the Crown extremely hard.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Fair] Mem:10 Exits:N(E)
SW>
The violent funnel cloud rips through the area, hitting nothing.
The violent funnel cloud rips through the area, hitting nothing.
The violent funnel dissipates.
A Knight of the Crown screams in pain as inky black tentacles constrict
him.
Habutz hits the tentacles constricting a Knight of the Crown instead!
You miss a Knight of the Crown with your bludgeon.
Pti cleaves a Knight of the Crown very hard.
Velhuus misses a Knight of the Crown with her bludgeon.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W> g all corpse
Zane shouts 'anyone know whats going to happen w/ the mid level
division of the tourney?'
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W>
Maratus crashes into a Knight of the Crown in a thundering collision,
knocking him to the grou
nd!
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W> You can't remember how to cast that spell!
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W>
Through your wizard's eye: Ryoga has arrived from the west exit.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W> The corpse doesn't seem to have what you are looking for.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W> fb
Through your wizard's eye: Ryoga has left through the north exit.
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W> It's a pretty ghastly sight! Searching through the remains, you
find:
corpse (here) :
354H 71V 1X 3997C [Me:V.Good] [Velhuus:Perfect] [a Knight of the
Crown:Bad] Mem:10 Exits:N(E)S
W>
Velhuus utters the words, 'calm'.
A Knight of the Crown stops fighting Velhuus.
Pti stops fighting a Knight of the Crown.
Terl stops fighting a Knight of the Crown.
Habutz stops fighting a Knight of the Crown.
Maratus stops fighting a Knight of the Crown.
You direct your attention to a Knight of the Crown.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:Bad] Mem:10
Exits:N(E)SW> The corpse does
n't seem to have what you are looking for.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:Bad] Mem:10
Exits:N(E)SW> The corpse does
n't seem to have what you are looking for.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:Bad] Mem:10
Exits:N(E)SW> You utter the w
ords, 'force bolt'
You hear bones crack as your force bolt slams into a Knight of the
Crown.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
Pti stands up.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
Through your wizard's eye: a drunken dwarf has arrived from the south
exit.
Through your wizard's eye: a Solace peacekeeper has left through the
east exit.
354H 71V 1X 3997C [Me:V.Good] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
The violent funnel dissipates.
A Knight of the Crown misses you and destroys an image.
Woa tells your group 'fuck yes'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> gt pala
Habutz utters some strange words.
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> gt now
Velhuus says 'PALA'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> You tell you
r group 'pala'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> You tell you
r group 'now'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
The violent funnel dissipates.
You massacre a Knight of the Crown with your bludgeon.
A Knight of the Crown misses you and destroys an image.
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> gt PALALA
You tell your group 'PALALA'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> gt PALALA
You tell your group 'PALALA'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> gt PALALA
You tell your group 'PALALA'
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
Velhuus utters the words, 'mass invisibility'.
A Knight of the Crown slowly fades out of existence.
You vanish.
Woa slowly fades out of existence.
Pti slowly fades out of existence.
Terl slowly fades out of existence.
Habutz slowly fades out of existence.
Zyyr slowly fades out of existence.
Jabbervok slowly fades out of existence.
Velhuus slowly fades out of existence.
Maratus slowly fades out of existence.
fb
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW>
A Knight of the Crown stands up.
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:V.Bad] Mem:11
Exits:N(E)SW> You utter th
e words, 'force bolt'
Your force bolt shatters a Knight of the Crown's skull into lifeless
goo.
You receive 0 experience.
A Knight of the Crown is dead! R.I.P.
366H 82V 1X 3997C [Me:Perfect] [a Knight of the Crown:Dying] Mem:11
Exits:N(E)SW>
The death cry of a Knight of the Crown echoes from somewhere nearby...

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
