<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   mythrop massrip

   POV: Scelesta

   Log Rating: 1.1538

   pre other massrip

   You tell your group 'killit'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D> You tell
   your group 'killit'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D>
   Iopi beckons secretively to Dia.
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D>
   Charo tells your group 'come inn'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D> gt go
   Luze tells your group 'get it'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D>
   Charo tells your group 'come inn'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D> You tell
   your group 'go'
   293H 161V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:D> d
   The Ebullient Elephant Inn
   This spacious tavern is full of customers. This is obviously a favorite
   hangout of many of Palanthas's middle class citizens. There is a bar
   against one wall and a staircase leading upstairs to the room clerk's
   office. The only exit is back north to Sword Street.
   Floyd, the barkeep, idly whistles a merry tune while polishing the bar.
   293H 160V 10273734X 1962C Mem:2 Exits:NU> c 'l b' monalis
   Virtue flies north.
   293H 160V 10273734X 1962C Mem:2 Exits:NU> c 'l b' monalis
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A delicious roasted turkey leg has been dropped here. [18]
   The corpse of Dia is lying here.
   Virtue Of Takhisis, Pure Evil is standing here. (flying) (invisible)
   A young adventurer newly arrived in town is looking for the tavern.
   Lord Charo the Grand is standing here. (flying)
   . . . has a metallic luster.
   Manny, Sassy Mcfat Fat is standing here. (flying)
   Jenie Einej, Genie of Doom is standing here. (flying) (invisible)
   Jojo the Male Human is standing here. (flying)
   Luze is standing here. (flying)
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   A sailor, just off the boat, stands here with his hands in his pockets.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> c 'l b' monalis
   Who should the spell be cast upon?
   293H 159V 10273734X 1962C Mem:2 Exits:ESW>
   A young adventurer leaves east.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW>
   Fraen flies in from the west.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> Who should the spell be cast
   upon?
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> c 'l b' monalis
   Fraen flies south.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW>
   Anne flies in from the west.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> Who should the spell be cast
   upon?
   293H 159V 10273734X 1962C Mem:2 Exits:ESW>
   Anne flies south.
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> Who should the spell be cast
   upon?
   293H 159V 10273734X 1962C Mem:2 Exits:ESW> Who should the spell be cast
   upon?
   293H 159V 10273734X 1962C Mem:2 Exits:ESW>
   Monalis flies in from the south.
   Cano arrives from the south.
   Aemen flies in from the south.
   Hymak flies in from the south.
   Iopi flies in from the south.
   Anne flies in from the south.
   293H 159V 10273734X 1962C [**Monalis:Fair**] Mem:2 Exits:ESW> gt KILL
   MONALIS
   Manny crashes into Monalis in a thundering collision, knocking her to
   the ground!
   293H 159V 10273734X 1962C [**Monalis:Fair**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Luze crashes into Monalis in a thundering collision, knocking her to
   the ground!
   293H 159V 10273734X 1962C [**Monalis:Fair**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Jojo massacres Monalis with his slash.
   293H 159V 10273734X 1962C [**Monalis:Bad**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Virtue slowly fades into existence.
   Monalis steps aside as Virtue attempts a bash, stumbles, and falls flat
   on her face.
   293H 159V 10273734X 1962C [**Monalis:Bad**] [**Manny:V.Good**] Mem:2
   Exits:ESW> c 'l b' monalis
   Charo focuses harshly on Monalis and utters some strange words.
   Monalis cries out in pain as Charo grabs her.
   293H 159V 10273734X 1962C [**Monalis:Awful**] [**Manny:V.Good**] Mem:2
   Exits:ESW> You tell your g
   roup 'KILL MONALIS'
   293H 159V 10273734X 1962C [**Monalis:Awful**] [**Manny:V.Good**] Mem:2
   Exits:ESW> You utter the w
   ords, 'lightning bolt'
   The lightning bolt hits Monalis with full impact.
   293H 159V 10273734X 1962C [**Monalis:Awful**] [**Manny:V.Good**] Mem:3
   Exits:ESW>
   Anne focuses on Monalis and utters some strange words.
   Anne heals Monalis.
   293H 159V 10273734X 1962C [**Monalis:V.Good**] [**Manny:V.Good**] Mem:3
   Exits:ESW>
   Virtue crushes Monalis extremely hard.
   Jojo massacres Monalis with his slash.
   Luze slashes Monalis very hard.
   Manny massacres Monalis with his cleave.
   Monalis bludgeons Manny.
   Monalis's crystal flickers and goes out.
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Hymak utters the words, 'blur'.
   Hymak begins to become blurry and hard to see.
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Fraen flies in from the south.
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW> c 'l b' monalis
   Aemen slashes Manny very hard.
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Charo focuses harshly on Anne and utters the words, 'hold person'.
   Anne freezes in place.
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW> get all monalis
   Jojo yells a battle cry and fights like a madman!
   293H 167V 10273734X 1962C [**Monalis:Good**] [**Manny:V.Good**] Mem:2
   Exits:ESW>
   Iopi tries to bash you, but he passes right through your image.
   293H 167V 10273734X 1962C [Scelesta:Perfect] [Iopi:Perfect] Mem:2
   Exits:ESW>
   You stop watching Monalis.
   293H 167V 10273734X 1962C [Scelesta:Perfect] [Iopi:Perfect] Mem:2
   Exits:ESW> You utter the words,
   'lightning bolt'
   The lightning bolt hits Monalis with full impact.
   293H 167V 10273734X 1962C [Scelesta:Perfect] [Iopi:Perfect] Mem:2
   Exits:ESW>
   You are sent sprawling as Cano crashes into you.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Fraen slashes Monalis extremely hard.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Jenie focuses harshly on Monalis and utters the words, 'force bolt'.
   Jenie slowly fades into existence.
   The sound of bones cracking echoes as Jenie's force bolt slams into
   Monalis.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Jojo tries to shove you out of the way of battle.
   Fraen slashes Monalis hard.
   Cano misses you and destroys an image.
   Iopi misses you and destroys an image.
   Aemen slashes Manny very hard.
   Virtue crushes Monalis extremely hard.
   Jojo annihilates Monalis with his slash.
   Jojo massacres Monalis with his slash.
   Luze massacres Monalis with his slash.
   Manny massacres Monalis with his cleave.
   Monalis misses Manny with her bludgeon.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Arirk arrives from the south.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Naustramus flies in from the west.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Monalis steps aside as Manny attempts a bash, stumbles, and falls flat
   on his face.
   Monalis steps aside as Luze attempts a bash, stumbles, and falls flat
   on his face.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Aemen crashes into Manny in a thundering collision, knocking him to the
   ground!
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Virtue stands up.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW> st
   Hymak misses you with his pierce.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Jenie focuses harshly on Monalis and utters the words, 'force bolt'.
   Brains splatter on you as Jenie's force bolt shatters Monalis's skull.
   You receive 0 experience.
   Monalis is dead! R.I.P.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   Charo focuses on Fraen and utters some strange words.
   Charo heals Fraen.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:Perfect] Mem:2
   Exits:ESW>
   The death cry of Monalis echoes from somewhere nearby...
   Cano stops following Monalis.
   Monalis now follows Cano.
   Cano is the new leader of Monalis's group.
   Monalis stops following Cano.
   Sa stops following Monalis.
   Sa now follows Cano.
   Aemen stops following Monalis.
   Aemen now follows Cano.
   Jojo annihilates Iopi with his slash.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:V.Good] Mem:2
   Exits:ESW>
   Virtue gets a large pile of coins from the corpse of Monalis.
   275H 167V 10273734X 1962C [Scelesta:V.Good] [Iopi:V.Good] Mem:2
   Exits:ESW>
   Jojo comes to your rescue! You're thankful, but a bit dazed.
   Jojo misses Aemen with his slash.
   Iopi slashes Jojo very hard.
   Jojo misses Aemen with his slash.
   Manny cleaves Aemen extremely hard.
   Hymak pierces YOU hard.
   Cano misses you and destroys an image.
   The images around you fade out of existance.
   Aemen slashes Manny extremely hard.
   268H 167V 10273734X 1962C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Virtue gets a black and crooked staff from the corpse of Monalis.
   Virtue gets a glowing adamantite bracelet from the corpse of Monalis.
   Virtue gets a stark white wrist guard from the corpse of Monalis.
   Virtue gets a paint splattered apron from the corpse of Monalis.
   Virtue gets a small diamond shield from the corpse of Monalis.
   Virtue gets some slimy eel skin sleeves from the corpse of Monalis.
   Virtue is zapped by gloves of wretchedness and instantly drops it.
   Virtue is zapped by boots of unholiness and instantly drops it.
   Virtue gets some slimy eel skin leggings from the corpse of Monalis.
   Virtue is zapped by a skull mask and instantly drops it.
   Virtue gets a greenstone medallion from the corpse of Monalis.
   Virtue gets a granite ring from the corpse of Monalis.
   Virtue gets a silver dwarven ring from the corpse of Monalis.
   Virtue gets a sticky strand from the corpse of Monalis.
   268H 167V 10273734X 1962C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Virtue divides 312 coins equally among the group members present.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW> c 'h p' cano
   Virtue slowly fades into existence.
   Virtue crushes Aemen extremely hard.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Fraen misses Aemen with his slash.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Naustramus gets a wand shaped like a foot from the corpse of Monalis.
   Naustramus gets a wand shaped like a foot from the corpse of Monalis.
   Naustramus gets a brown peaty potion from the corpse of Monalis.
   Naustramus gets an empty potion bottle from the corpse of Monalis.
   Naustramus gets a leather woven headband from the corpse of Monalis.
   Naustramus gets a pair of colourful spellcasting gloves from the corpse
   of Monalis.
   Naustramus gets a plain component pouch from the corpse of Monalis.
   Naustramus gets an ancient elven blade from the corpse of Monalis.
   Naustramus gets a pair of magi boots from the corpse of Monalis.
   Naustramus gets a glowing scroll of recall from the corpse of Monalis.
   Naustramus gets a glowing scroll of recall from the corpse of Monalis.
   Naustramus gets a glowing scroll of recall from the corpse of Monalis.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   You step aside as Cano tries to bash you, causing him to tumble and
   fall face down.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Monalis arrives from the south.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Monalis gets a set of magi robes from the corpse of Monalis.
   Monalis gets a set of magi robes from the corpse of Monalis.
   Monalis gets a crystal shard necklace from the corpse of Monalis.
   Monalis gets a crystal shard necklace from the corpse of Monalis.
   Monalis gets a crystal shard necklace from the corpse of Monalis.
   Monalis gets a small wooden chest from the corpse of Monalis.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Iopi stands up.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Charo focuses harshly on Aemen and utters the words, 'hold person'.
   268H 167V 10273734X 2001C [Scelesta:V.Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Jojo tries to shove you out of the way of battle.
   Fraen slashes Aemen very hard.
   Virtue crushes Aemen extremely hard.
   You miss Hymak with your claw.
   Iopi slashes Jojo extremely hard.
   Jojo misses Aemen with his slash.
   Blood flows up the fillers of Jojo's sword.
   Manny cleaves Aemen extremely hard.
   Hymak misses you with his pierce.
   Cano crushes YOU extremely hard.
   Aemen slashes Manny extremely hard.
   Hymak focuses harshly on you and utters the words, 'hold person'.
   You feel a slight chill.
   Monalis leaves south.
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Iopi crashes into Jojo in a thundering collision, knocking him to the
   ground!
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Virtue crashes into Aemen in a thundering collision, knocking her to
   the ground!
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW>
   Luze stands up.
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW> The corpse doesn't see
   m to have what you are looking for.
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW> Fraen crashes into Aem
   en in a thundering collision, knocking her to the ground!
   You stand up.
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:2
   Exits:ESW> Luze crashes into Aeme
   n in a thundering collision, knocking her to the ground!
   You utter the words, 'hold person'
   The magic fails!
   mirror
   250H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Jojo tries to shove you out of the way of battle.
   Luze massacres Aemen with his slash.
   Fraen slashes Aemen very hard.
   Virtue misses Aemen with her crush.
   Iopi massacres Jojo with his slash.
   Jojo annihilates Aemen with his slash.
   Manny massacres Aemen with his cleave.
   Cano crushes YOU very hard.
   Aemen slashes Manny extremely hard.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Hymak focuses harshly on you and utters the words, 'hold person'.
   You feel a slight chill.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Anne boggles at some nebulous concept.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Manny stands up.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Manny panics, and attempts to flee.
   Manny flies west.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Jenie focuses harshly on Aemen and utters the words, 'force bolt'.
   The sound of bones cracking echoes as Jenie's force bolt slams into
   Aemen.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Airr flies in from the west.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW> Airr flies south.
   You utter the words, 'mirror image'
   You are surrounded by 4 duplicate images.
   237H 167V 10273734X 2001C [Scelesta:Good] [Hymak:Perfect] Mem:3
   Exits:ESW>
   Jojo slams into you and pushes you out of the way of battle.
   Jojo misses Aemen with his slash.
   Jojo tries to shove Virtue out of the way of battle.
   Hymak pierces Jojo hard.
   Jojo misses Aemen with his slash.
   Aemen slashes Virtue very hard.
   Luze slashes Aemen extremely hard.
   Fraen slashes Aemen hard.
   Virtue massacres Aemen with her crush.
   Iopi slashes Jojo extremely hard.
   Cano misses you and destroys an image.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Manny flies in from the west.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Hymak focuses harshly on Jojo and utters the words, 'lightning bolt'.
   Jojo wavers under the impact of the lightning bolt sent by Hymak.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Charo focuses harshly on Cano and utters the words, 'hold person'.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Cano stands up.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Manny crashes into Aemen in a thundering collision, knocking her to the
   ground!
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   There is lightning in the sky.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Aemen steps aside as Fraen attempts a bash, stumbles, and falls flat on
   his face.
   232H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW> c 'l b'
   Naustramus focuses harshly on you and utters the words, 'magic
   missile'.
   Naustramus misses you and destroys an image.
   You stagger as a magic missile from Naustramus hits you.
   Naustramus misses you and destroys an image.
   Naustramus misses you and destroys an image.
   The images around you fade out of existance.
   221H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Virtue crashes into Aemen in a thundering collision, knocking her to
   the ground!
   221H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Cano crashes into Charo in a thundering collision, knocking him to the
   ground!
   221H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW>
   Jojo tells your group 'sweet a battle'
   221H 167V 10273734X 2001C [Scelesta:Good] [Cano:Perfect] Mem:3
   Exits:ESW> You utter the words, 'l
   ightning bolt'
   The lightning bolt hits Cano with full impact.
   221H 167V 10273734X 2001C [Scelesta:Good] [Cano:V.Good] Mem:4
   Exits:ESW>
   Jojo slams into you and pushes you out of the way of battle.
   Jojo massacres Aemen with his slash.
   Cano crushes Jojo extremely hard.
   Jojo massacres Aemen with his slash.
   Charo's blow is absorbed by Cano's armor.
   Manny massacres Aemen with his cleave.
   Aemen slashes Virtue extremely hard.
   Luze slashes Aemen extremely hard.
   Fraen misses Aemen with his slash.
   Virtue crushes Aemen extremely hard.
   Iopi massacres Jojo with his slash.
   215H 167V 10273734X 2001C Mem:4 Exits:ESW> flee
   flee
   Hymak focuses harshly on Jojo and utters the words, 'magic missile'.
   Hymak aims a magic missile at Jojo, who staggers under the blow.
   Hymak aims a magic missile at Jojo, who staggers under the blow.
   Hymak aims a magic missile at Jojo, who staggers under the blow.
   Hymak aims a magic missile at Jojo, who staggers under the blow.
   215H 167V 10273734X 2001C Mem:4 Exits:ESW> sca
   c 'l b' cano
   Naustramus focuses harshly on you and utters the words, 'lightning
   bolt'.
   YOU'RE HIT. A lightning bolt from Naustramus has reached its goal.
   175H 167V 10273734X 2001C [Scelesta:Fair] [Naustramus:Perfect] Mem:4
   Exits:ESW> Jojo comes to you
   r rescue! You're thankful, but a bit dazed.
   Jojo misses Aemen with his slash.
   Blood flows up the fillers of Jojo's sword.
   Naustramus misses Jojo with his hit.
   Jojo misses Aemen with his slash.
   Jojo misses Aemen with his slash.
   Cano crushes Jojo extremely hard.
   Charo misses Cano with his hit.
   Manny cleaves Aemen extremely hard.
   Aemen barely slashes Virtue.
   Luze slashes Aemen extremely hard.
   Fraen slashes Aemen extremely hard.
   Virtue massacres Aemen with her crush.
   Iopi massacres Jojo with his slash.
   You're not fighting, why bother fleeing?
   175H 167V 10273734X 2001C Mem:4 Exits:ESW>
   Iopi crashes into Charo in a thundering collision, knocking him to the
   ground!
   175H 167V 10273734X 2001C Mem:4 Exits:ESW> You're not fighting, why
   bother fleeing?
   175H 167V 10273734X 2001C Mem:4 Exits:ESW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   You sense a life form.
   A young adventurer newly arrived in town is looking for the tavern.
   Looking south:
   You see nothing special.
   Floyd, the barkeep, idly whistles a merry tune while polishing the bar.
   Looking west:
   You see nothing special.
   Triniti the Female Kender is standing here.
   A large pigeon is here pecking at some bread crumbs.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   175H 167V 10273734X 2001C Mem:4 Exits:ESW> You utter the words,
   'lightning bolt'
   The lightning bolt hits Cano with full impact.
   175H 167V 10273734X 2001C Mem:4 Exits:ESW> sca
   Hymak focuses harshly on Jojo and utters the words, 'lightning bolt'.
   Jojo wavers under the impact of the lightning bolt sent by Hymak.
   175H 167V 10273734X 2001C Mem:4 Exits:ESW> gt heal me
   st
   flee
   flee
   Fraen stands up.
   175H 167V 10273734X 2001C Mem:4 Exits:ESW>
   Cano heroically rescues Aemen.
   Jojo stands up.
   Naustramus focuses harshly on you and utters the words, 'lightning
   bolt'.
   YOU'RE HIT. A lightning bolt from Naustramus has reached its goal.
   Fraen crashes into Aemen in a thundering collision, knocking her to the
   ground!
   Aemen is mortally wounded, and will die soon, if not aided.
   143H 167V 10273734X 2001C [Jojo:Awful] [Naustramus:Perfect] Mem:4
   Exits:ESW>
   Jojo tries to shove Virtue out of the way of battle.
   You claw Naustramus hard.
   Virtue crushes Cano extremely hard.
   Cano crushes Virtue very hard.
   Jojo obliterates Aemen with his slash.
   You receive 0 experience.
   Aemen is dead! R.I.P.
   Charo misses Cano with his hit.
   Iopi slashes Jojo hard.
   The death cry of Aemen echoes from somewhere nearby...
   Hymak stops following Aemen.
   Iopi stops following Aemen.
   Anne stops following Aemen.
   Aemen stops following Cano.
   Jojo massacres Cano with his slash.
   143H 167V 10273734X 2001C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW>
   Luze gets a pile of coins from the corpse of Aemen.
   143H 167V 10273734X 2001C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW>
   Luze divides 80 coins equally among the group members present.
   143H 167V 10273734X 2011C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW> Luze divides 80 coins
   equally among the group members present.
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   You sense a life form.
   A young adventurer newly arrived in town is looking for the tavern.
   Looking south:
   You see nothing special.
   Floyd, the barkeep, idly whistles a merry tune while polishing the bar.
   Looking west:
   You see nothing special.
   A large pigeon is here pecking at some bread crumbs.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   143H 167V 10273734X 2021C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW> st
   Arirk gets a grim looking sword from the corpse of Aemen.
   Arirk gets a purple beaded bracelet from the corpse of Aemen.
   Arirk gets a red steel bracer from the corpse of Aemen.
   Arirk gets a ceremonial solamnic sash from the corpse of Aemen.
   Arirk gets a cloak of a chimera from the corpse of Aemen.
   Arirk gets a white steel dragonarmy shield from the corpse of Aemen.
   Arirk gets some banded mail sleeves from the corpse of Aemen.
   Arirk gets a pair of black razor-lined gloves from the corpse of Aemen.
   Arirk gets a pair of leather boots from the corpse of Aemen.
   Arirk gets some black legplates of the Lily from the corpse of Aemen.
   Arirk gets a metallic visor from the corpse of Aemen.
   Arirk gets a suit of white plate mail from the corpse of Aemen.
   Arirk gets delicate copper necklace from the corpse of Aemen.
   Arirk gets a black onyx ring from the corpse of Aemen.
   Arirk gets a small wooden chest from the corpse of Aemen.
   Arirk gets an elaborate dragon sash from the corpse of Aemen.
   Arirk gets a loaf of rye bread from the corpse of Aemen.
   Arirk gets a large first-aid kit from the corpse of Aemen.
   Arirk gets an ivory-hilted bastard sword from the corpse of Aemen.
   Arirk gets a vial of acidic juice from the corpse of Aemen.
   Arirk gets a glowing scroll of recall from the corpse of Aemen.
   Arirk gets a glowing scroll of recall from the corpse of Aemen.
   Arirk gets a small canteen from the corpse of Aemen.
   Arirk gets a blackened heart from the corpse of Aemen.
   Arirk gets a glowing scroll of recall from the corpse of Aemen.
   Arirk gets a small canteen from the corpse of Aemen.
   Arirk gets a small canteen from the corpse of Aemen.
   Arirk gets a glowing scroll of recall from the corpse of Aemen.
   Arirk gets a hooded lantern from the corpse of Aemen.
   143H 167V 10273734X 2021C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW> Hymak focuses harshly
   on Jojo and utters the words, 'lightning bolt'.
   Jojo wavers under the impact of the lightning bolt sent by Hymak.
   You tell your group 'heal me'
   143H 167V 10273734X 2021C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW>
   Luze divides 80 coins equally among the group members present.
   143H 167V 10273734X 2031C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW> flee
   You are already standing.
   143H 167V 10273734X 2031C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW>
   Manny crashes into Cano in a thundering collision, knocking him to the
   ground!
   143H 167V 10273734X 2031C [Jojo:Awful] [Naustramus:V.Good] Mem:4
   Exits:ESW> flee
   You flee head over heels.
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   A large pigeon is here pecking at some bread crumbs.
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> You're not fighting, why
   bother fleeing?
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> sca
   Benge arrives from the east.
   You are already standing.
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> Benge leaves south.
   You're not fighting, why bother fleeing?
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> You're not fighting, why
   bother fleeing?
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Manny, Sassy Mcfat Fat is standing here, fighting Cano. (flying)
   Naustramus the Male Theiwar Dwarf is standing here, fighting Jojo.
   (flying)
   . . . is followed by a hovering ball of light.
   Arirk J'Irk, The Itch That Makes You Twitch is standing here.
   Fraen de Mynd is standing here. (flying)
   Anne the Male Hill Dwarf is standing here. (flying)
   Iopi Ka'Bash is standing here, fighting Jojo. (flying)
   Hymak the Male Gnome is standing here, fighting Jojo. (flying)
   . . . has a tough exterior.
   Cano is sitting here, fighting Virtue.
   Virtue Of Takhisis, Pure Evil is standing here, fighting Cano. (flying)
   Lord Charo the Grand is sitting here, fighting Cano. (flying)
   . . . has a metallic luster.
   Jenie Einej, Genie of Doom is standing here. (flying)
   Jojo the Male Human is standing here, fighting Cano. (flying)
   Luze is standing here. (flying)
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   A sailor, just off the boat, stands here with his hands in his pockets.
   Looking south:
   You see nothing special.
   Benge the Male Wild Elf is standing here.
   A streetsweeper is here keeping Palanthas tidy.
   An alley cat is here sniffing around the garbage looking for food.
   An apprentice mage is here watching the store for his master.
   Looking west:
   You see nothing special.
   A large pigeon is here pecking at some bread crumbs.
   Looking up:
   You see nothing special.
   Looking down:
   143H 166V 10273734X 2031C Mem:4 Exits:ESW> e
   Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   The corpse of Aemen is lying here.
   A mask made of part of a skull lies here on the ground...it glows blue
   A dark pair of knee-high boots has been left here.
   A pair of granite-like gloves have been left here to collect dust.
   The corpse of Monalis is lying here.
   A delicious roasted turkey leg has been dropped here. [18]
   The corpse of Dia is lying here.
   Manny, Sassy Mcfat Fat is standing here, fighting Cano. (flying)
   Naustramus the Male Theiwar Dwarf is standing here, fighting Jojo.
   (flying)
   . . . is followed by a hovering ball of light.
   Arirk J'Irk, The Itch That Makes You Twitch is standing here.
   Fraen de Mynd is standing here. (flying)
   Anne the Male Hill Dwarf is standing here. (flying)
   Iopi Ka'Bash is standing here, fighting Jojo. (flying)
   Hymak the Male Gnome is standing here, fighting Jojo. (flying)
   . . . is followed by a hovering ball of light.
   Cano is sitting here, fighting Virtue.
   Virtue Of Takhisis, Pure Evil is standing here, fighting Cano. (flying)
   Lord Charo the Grand is sitting here, fighting Cano. (flying)
   . . . has a metallic luster.
   Jenie Einej, Genie of Doom is standing here. (flying)
   Jojo the Male Human is standing here, fighting Cano. (flying)
   Luze is standing here. (flying)
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   A sailor, just off the boat, stands here with his hands in his pockets.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW>
   Jojo tries to shove Virtue out of the way of battle.
   Manny cleaves Cano very hard.
   Jojo massacres Cano with his slash.
   Virtue crushes Cano extremely hard.
   Cano crushes Virtue very hard.
   Naustramus misses Jojo with his hit.
   Charo misses Cano with his hit.
   Iopi slashes Jojo extremely hard.
   Jojo is dead! R.I.P.
   The death cry of Jojo echoes from somewhere nearby...
   Jojo stops following Luze.
   Naustramus gets a large pile of coins from the corpse of Jojo.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW> c 'l b' naustramus
   You can't remember how to cast that spell!
   143H 165V 10273734X 2031C Mem:4 Exits:ESW>
   Cano steps aside as Virtue attempts a bash, stumbles, and falls flat on
   her face.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW>
   Naustramus flies west.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW> c 'f b' naustramus
   Manny massacres Cano with his cleave.
   Virtue massacres Cano with her crush.
   Cano crushes Virtue very hard.
   Charo misses Cano with his hit.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW> w
   Who should the spell be cast upon?
   143H 165V 10273734X 2031C Mem:4 Exits:ESW> c 'f b' naustramus
   Arirk wears an elaborate dragon sash about his waist.
   Arirk wears a black onyx ring on a finger of his right hand.
   Arirk wears delicate copper necklace around his neck.
   Arirk wears a suit of white plate mail on his body.
   Arirk wears a metallic visor on his head.
   Arirk wears some black legplates of the Lily on his legs.
   Arirk wears a pair of leather boots on his feet.
   Arirk wears a pair of black razor-lined gloves on his hands.
   Arirk wears some banded mail sleeves on his arms.
   Arirk starts using a white steel dragonarmy shield as a shield.
   Arirk wears a cloak of a chimera about his body.
   Arirk wears a red steel bracer around his right wrist.
   Arirk wears a purple beaded bracelet around his left wrist.
   Fraen misses Cano with his slash.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW>
   Jenie gets a glowing scroll of recall from the corpse of Jojo.
   143H 165V 10273734X 2031C Mem:4 Exits:ESW> Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   Naustramus the Male Theiwar Dwarf is standing here. (flying)
   . . . is followed by a hovering ball of light.
   A large pigeon is here pecking at some bread crumbs.
   143H 164V 10273734X 2031C Mem:4 Exits:ESW> You utter the words, 'force
   bolt'
   You hear bones crack as your force bolt slams into Naustramus.
   143H 164V 10273734X 2031C [Scelesta:Bad] [Naustramus:Fair] Mem:5
   Exits:ESW>
   Naustramus panics, and attempts to flee.
   Naustramus flies west.
   143H 164V 10273734X 2031C Mem:5 Exits:ESW>
   Naustramus flies in from the west.
   143H 164V 10273734X 2031C Mem:5 Exits:ESW>
   Tia tells your group 'heal it charo'
   143H 164V 10273734X 2031C Mem:5 Exits:ESW>
   Naustramus flies south.
   143H 164V 10273734X 2031C Mem:5 Exits:ESW>
   Charo flies in from the east.
   143H 164V 10273734X 2031C Mem:5 Exits:ESW> e
   Airr flies in from the east.
   143H 164V 10273734X 2031C Mem:5 Exits:ESW> Sword Street
   This block of Sword Street is in the southwestern part of the city. A
   sign hangs in front of one of the buildings to the south. Sword Street
   continues to the east and west.
   The corpse of Jojo is lying here.
   The corpse of Aemen is lying here.
   A mask made of part of a skull lies here on the ground...it glows blue
   A dark pair of knee-high boots has been left here.
   A pair of granite-like gloves have been left here to collect dust.
   The corpse of Monalis is lying here.
   A delicious roasted turkey leg has been dropped here. [18]
   The corpse of Dia is lying here.
   Manny, Sassy Mcfat Fat is sitting here. (flying)
   Arirk J'Irk, The Itch That Makes You Twitch is sitting here, fighting
   Luze.
   Fraen de Mynd is standing here. (flying)
   Anne the Male Hill Dwarf is standing here. (flying)
   Iopi Ka'Bash is standing here, fighting Virtue. (flying)
   Hymak the Male Gnome is standing here. (flying)
   . . . is followed by a hovering ball of light.
   Virtue Of Takhisis, Pure Evil is sitting here, fighting Iopi. (flying)
   Jenie Einej, Genie of Doom is standing here. (flying)
   Luze is standing here, fighting Arirk. (flying)
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   A sailor, just off the boat, stands here with his hands in his pockets.
   143H 163V 10273734X 2031C Mem:5 Exits:ESW>
   Charo flies in from the west.
   143H 163V 10273734X 2031C Mem:5 Exits:ESW>
   Charo focuses on you and utters some strange words.
   Your entire body tingles for a few seconds.
   292H 163V 10273734X 2031C Mem:5 Exits:ESW>
   Hymak pierces Iopi.
   292H 163V 10273734X 2031C Mem:5 Exits:ESW> c 'f b' iopi
   292H 163V 10273734X 2031C Mem:5 Exits:ESW> c 'f b' iopi
   Hymak misses Iopi with his pierce.
   Virtue crushes Iopi very hard.
   Luze slashes Arirk extremely hard.
   Arirk misses Luze with his hit.
   Iopi massacres Virtue with his slash.
   292H 163V 10273734X 2031C Mem:5 Exits:ESW> You utter the words, 'force
   bolt'
   You hear bones crack as your force bolt slams into Iopi.
   292H 163V 10273734X 2031C Mem:6 Exits:ESW> watch iopi
   c 'f b' iopi
   Manny stands up.
   292H 163V 10273734X 2031C Mem:6 Exits:ESW>
   Manny crashes into Iopi in a thundering collision, knocking him to the
   ground!
   292H 163V 10273734X 2031C Mem:6 Exits:ESW>
   Fraen crashes into Iopi in a thundering collision, knocking him to the
   ground!
   292H 163V 10273734X 2031C Mem:6 Exits:ESW>
   Charo focuses harshly on Iopi and utters the words, 'hold person'.
   292H 163V 10273734X 2031C Mem:6 Exits:ESW>
   Fraen slashes Iopi very hard.
   Manny massacres Iopi with his cleave.
   Hymak misses Iopi with his pierce.
   Virtue massacres Iopi with her crush.
   Luze massacres Arirk with his slash.
   Arirk misses Luze with his hit.
   Iopi massacres Virtue with his slash.
   292H 163V 10273734X 2031C Mem:6 Exits:ESW> You now watch Iopi.
   292H 163V 10273734X 2031C [**Iopi:Fair**] [**Virtue:Fair**] Mem:6
   Exits:ESW> You utter the words,
   'force bolt'
   You hear bones crack as your force bolt slams into Iopi.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Jenie focuses harshly on Iopi and utters the words, 'hold person'.
   A sailor gets boots of unholiness.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Arirk steps aside as Luze attempts a bash, stumbles, and falls flat on
   his face.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW> c 'f b' iopi
   Hymak panics, and attempts to flee.
   Hymak flies east.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Virtue stands up.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Virtue gets a broad bladed two-handed sword from the corpse of Jojo.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Arirk stands up.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Arirk panics, and attempts to flee.
   Arirk leaves south.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Charo focuses harshly on Iopi and utters the words, 'hold person'.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Hymak flies in from the east.
   292H 163V 10273734X 2031C [**Iopi:Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Fraen slashes Iopi very hard.
   Manny massacres Iopi with his cleave.
   Virtue misses Iopi with her crush.
   Iopi slashes Virtue very hard.
   292H 163V 10273734X 2031C [**Iopi:V.Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW>
   Iopi steps aside as Virtue attempts a bash, stumbles, and falls flat on
   her face.
   292H 163V 10273734X 2031C [**Iopi:V.Bad**] [**Virtue:Fair**] Mem:7
   Exits:ESW> Jenie focuses harsh
   ly on Iopi and utters the words, 'magic missile'.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Iopi.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW>
   Hymak misses Virtue with his pierce.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW> c 'f b' iopi
   Triniti arrives from the west.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW>
   Manny crashes into Hymak in a thundering collision, knocking him to the
   ground!
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW>
   Iopi steps aside as Fraen attempts a bash, stumbles, and falls flat on
   his face.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW>
   Triniti leaves south.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW> get all iopi
   Charo focuses harshly on Iopi and utters the words, 'hold person'.
   292H 163V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:8
   Exits:ESW>
   Hymak pierces Virtue very hard.
   Fraen slashes Iopi extremely hard.
   Manny massacres Iopi with his cleave.
   Virtue crushes Iopi extremely hard.
   Iopi misses Virtue with his slash.
   293H 167V 10273734X 2031C [**Iopi:Awful**] [**Virtue:Fair**] Mem:7
   Exits:ESW> Jenie focuses harsh
   ly on Iopi and utters the words, 'magic missile'.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Jenie aims a magic missile at Iopi, who staggers under the blow.
   Iopi is incapacitated and will slowly die, if not aided.
   The magic missile sent by Jenie causes Iopi to stagger and collapse in
   a
   lifeless heap.
   You receive 0 experience.
   Iopi is dead! R.I.P.
   You utter the words, 'force bolt'
   c 'f b' iopi
   293H 167V 10273734X 2031C [**Iopi:Dying**] Mem:7 Exits:ESW>
   The death cry of Iopi echoes from somewhere nearby...
   Naustramus stops following Iopi.
   You stop watching Iopi.
   293H 167V 10273734X 2031C Mem:7 Exits:ESW>
   Luze stands up.
   293H 167V 10273734X 2031C Mem:7 Exits:ESW>
   Luze gets a large pile of coins from the corpse of Iopi.
   293H 167V 10273734X 2031C Mem:7 Exits:ESW>
   Luze divides 217 coins equally among the group members present.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   A Palanthanian guard leaves west.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Luze gets a glowing scroll of recall from the corpse of Iopi.
   Luze gets a sword carved from crystal from the corpse of Iopi.
   Luze gets a jade belt from the corpse of Iopi.
   Luze gets a crimson robe of the priest from the corpse of Iopi.
   Luze gets a large iron shield from the corpse of Iopi.
   Luze gets some embroidered desert sleeves from the corpse of Iopi.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Virtue crushes Hymak extremely hard.
   Hymak misses Virtue with his pierce.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> c 'h p' hymak
   Charo gets dual crimson gauntlets of ogre power from the corpse of
   Iopi.
   Charo gets a pair of shiny black boots from the corpse of Iopi.
   Charo gets some black legplates of the Lily from the corpse of Iopi.
   Charo gets a suit of silver finished plate mail from the corpse of
   Iopi.
   Charo gets an emerald-studded leather collar from the corpse of Iopi.
   Charo gets a scroll of recall from the corpse of Iopi.
   Charo gets a scroll of recall from the corpse of Iopi.
   Charo gets a glowing scroll of recall from the corpse of Iopi.
   Charo gets a heavy bearskin cloak from the corpse of Iopi.
   Charo gets a tempered bronze longsword from the corpse of Iopi.
   Charo gets a piece of sweet bread from the corpse of Iopi.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> Virtue stands up.
   You get an oxidated blade with a deteriorated hilt from the corpse of
   Iopi.
   You get a portable keg from the corpse of Iopi.
   Pack : You can't carry that many items.
   Chest : You can't carry that many items.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> Virtue crashes into Hymak in
   a thundering collision, k
   nocking him to the ground!
   Who should the spell be cast upon?
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> You can't remember how to
   cast that spell!
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Hymak steps aside as Manny attempts a bash, stumbles, and falls flat on
   his face.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Charo focuses harshly on Hymak and utters the words, 'hold person'.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Luze crashes into Hymak in a thundering collision, knocking him to the
   ground!
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Luze massacres Hymak with his slash.
   Manny cleaves Hymak extremely hard.
   Virtue massacres Hymak with her crush.
   Hymak misses Virtue with his pierce.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> c 'f b' hymak
   You can't remember how to cast that spell!
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> sc
   You are Scelesta, a level 29 Mage.
   You are rank 3.
   You are 43 years old.
   You have 293(293) hit and 167(167) movement points.
   You are influenced by the black moon, Nuitari.
   You have scored 109726266 exp, and have 2062(22596) steel coins.
   You need 10273734 more experience to advance.
   You have died 26 horrible deaths.
   You have been connected for 1 hour(s) and 1 minute(s).
   You have been playing for 32 day(s), 22 hour(s) and 35 minute(s).
   Your equipment is currently being concealed.
   You are standing.
   You are flying.
   You are following Luze.
   You are affected by the following:
   anti-spam measures
   antimagic shell
   fly
   continual light
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Fraen stands up.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Charo focuses harshly on Hymak and utters the words, 'hold person'.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Luze massacres Hymak with his slash.
   Manny massacres Hymak with his cleave.
   Virtue crushes Hymak extremely hard.
   You receive 0 experience.
   Hymak is dead! R.I.P.
   The death cry of Hymak echoes from somewhere nearby...
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Jenie gets a pile of coins from the corpse of Hymak.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> watch hymak
   They don't seem to be here.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> c 'm m'
   Unexpected end of input:
   You must specify a character to perform that action on.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> get all corpse
   Dagger : You can't carry that many items.
   Scroll : You can't carry that many items.
   Scroll : You can't carry that many items.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Manny stands up.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> in
   You are carrying:
   a portable keg
   an oxidated blade with a deteriorated hilt
   a milky potion of see invisible..it glows blue [2]
   a glowing scroll of recall..it glows blue..it glows dimly [2]
   a large first-aid kit
   a glowing scroll of recall..it glows blue..it glows dimly [2]
   a sergeant's cape
   a dented black cudgel
   a backpack
   a red silk sash
   a solid oaken cudgel
   a club sandwich [6]
   a large first-aid kit
   a scroll with a brown ribbon..it glows blue [4]
   a scroll of recall..it glows blue [4]
   a large waterskin [2]
   a small wooden chest
   a small component pouch..it glows blue
   a bright ball of light..it glows dimly
   a dark crystal ball..it glows blue..it glows dimly
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Virtue tells your group 'loot all orpses'
   293H 167V 10273734X 2062C Mem:7 Exits:ESW>
   Fraen gets a light silver dagger from the corpse of Hymak.
   Fraen gets a glowing scroll of recall from the corpse of Hymak.
   Fraen gets a glowing scroll of recall from the corpse of Hymak.
   293H 167V 10273734X 2062C Mem:7 Exits:ESW> say fuckin loot
   say fuckin loot
   You say 'fuckin loot'
   -------------------------------
   Charo tells your group 'kill anne'
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Manny kneels down and studies the ground.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Luze tells your group 'that it then?'
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Manny kneels down and studies the ground.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Charo tells your group 'kill anne'
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Manny kneels down and studies the ground.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Fraen crashes into Anne in a thundering collision, knocking him to the
   ground!
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Jojo arrives from the south.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Virtue slowly fades into existence.
   Virtue crashes into Anne in a thundering collision, knocking him to the
   ground!
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Virtue massacres Anne with her crush.
   Fraen slashes Anne very hard.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Manny crashes into Anne in a thundering collision, knocking him to the
   ground!
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Luze crashes into Anne in a thundering collision, knocking him to the
   ground!
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Charo flies in from the east.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Jojo now follows Luze.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Luze massacres Anne with his slash.
   Manny massacres Anne with his cleave.
   Virtue massacres Anne with her crush.
   Fraen slashes Anne extremely hard.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Charo focuses harshly on Anne and utters some strange words.
   Anne withers as a ray of sunlight sent by Charo engulfs him!
   293H 167V 10273734X 2062C Mem:8 Exits:ESW> c 'hp
   Jojo says 'pass my gear plz'
   293H 167V 10273734X 2062C Mem:8 Exits:ESW> Please enclose spells in
   single quotes: '
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Jenie focuses harshly on Anne and utters the words, 'acid blast'.
   Jenie sprays acid all over Anne, who dies in extreme agony.
   You receive 0 experience.
   Anne is dead! R.I.P.
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   The death cry of Anne echoes from somewhere nearby...
   293H 167V 10273734X 2062C Mem:8 Exits:ESW> c 'm m' anne
   Who should the spell be cast upon?
   293H 167V 10273734X 2062C Mem:8 Exits:ESW>
   Jojo says 'heal me charo'
   293H 167V 10273734X 2062C Mem:8 Exits:ESW> get all corpse
   Jojo gets a hoopak of office from the corpse of Anne.
   Jojo gets a golden cap from the corpse of Anne.
   Jojo gets a gold rounded pin from the corpse of Anne.
   Jojo gets a grey leather cape from the corpse of Anne.
   Jojo gets a bright ball of light from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a hardened steel maul from the corpse of Anne.
   Jojo gets a milky potion of see invisible from the corpse of Anne.
   Jojo gets a glowing scroll of recall from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a piece of sweet bread from the corpse of Anne.
   Jojo gets a hardened steel chisel from the corpse of Anne.
   Jojo gets some hide armor from the corpse of Anne.
   Jojo gets a small wooden chest from the corpse of Anne.

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
