<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Nmemnonia RIP

   POV: Scelesta

   Log Rating: 2.3501

   Sorry Nate.

   298H 96V 28943845X 2439C Exits:NE> sca
   A ruthless indian arrives from the west.
   A ruthless indian arrives from the west.
   A ruthless indian arrives from the west.
   Alchemical Lab
   This is where all the noxious fumes are created. There are also many
   items of magic scattered about as this also serves as Anatole's store
   room.
   There is a small room to the east.
   A ruthless indian stalks about here, looking for travelers to rob.
   (invisible)
   A ruthless indian stalks about here, looking for travelers to rob.
   (invisible)
   A ruthless indian stalks about here, looking for travelers to rob.
   (invisible)
   Linus the Alchemist, is here working diligently on a new formula.
   298H 95V 28943845X 2439C Exits:EW> Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   Zim the Male Mexican is standing here. (flying) (invisible)
   . . . is followed by a hovering ball of light.
   A merchant is passing through here, on his way to the marketplace.
   Anatole the Amazing is here to teach you the ways of magic.
   A Palanthian guard stands here, watching warily for troublemakers.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   An apprentice mage is here watching the store for his master.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   298H 95V 28943845X 2439C Exits:EW> gt i'm spamming w of mages
   You tell your group 'i'm spamming w of mages'
   298H 95V 28943845X 2439C Exits:EW> do nmemnonia
   You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C Exits:EW> Who should the spell be cast upon?
   298H 95V 28943845X 2439C Exits:EW> do nmemnonia
   Zim tells your group 'ok want me to lure it?'
   298H 95V 28943845X 2439C Exits:EW> You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C Exits:EW> do nmemnonia
   Who should the spell be cast upon?
   298H 95V 28943845X 2439C Exits:EW> You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C Exits:EW> Who should the spell be cast upon?
   298H 95V 28943845X 2439C Exits:EW> do nmemnonia
   You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C Exits:EW>
   Zim flies in from the east.
   298H 95V 28943845X 2439C Exits:EW> do nmemnonia
   Who should the spell be cast upon?
   298H 95V 28943845X 2439C Exits:EW> You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C Exits:EW> Who should the spell be cast upon?
   298H 95V 28943845X 2439C Exits:EW>
   Zim flies west.
   298H 95V 28943845X 2439C Exits:EW> gt sure
   You tell your group 'sure'
   298H 95V 28943845X 2439C Exits:EW> sca
   e
   Looking north:
   You see nothing special.
   Looking east:
   You see nothing special.
   A merchant is passing through here, on his way to the marketplace.
   Anatole the Amazing is here to teach you the ways of magic.
   A Palanthian guard stands here, watching warily for troublemakers.
   Looking south:
   You see nothing special.
   Looking west:
   You see nothing special.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   An apprentice mage is here watching the store for his master.
   Looking up:
   You see nothing special.
   Looking down:
   You see nothing special.
   298H 95V 28943845X 2439C Exits:EW>
   Nmemnonia tries to backstab you, but she misses and destroys your
   image.
   Nmemnonia slowly fades into existence.
   Nmemnonia comes out of hiding.
   298H 95V 28943845X 2439C [Scelesta:Perfect] [Nmemnonia:Perfect]
   Exits:EW> You can't do that while
   fighting.
   298H 95V 28943845X 2439C [Scelesta:Perfect] [Nmemnonia:Perfect]
   Exits:EW> gt
   do nmemnonia
   What do you wish to tell your group?
   298H 95V 28943845X 2439C [Scelesta:Perfect] [Nmemnonia:Perfect]
   Exits:EW> A ruthless indian slowl
   y fades into existence.
   A ruthless indian crashes into Nmemnonia in a thundering collision,
   knocking her to the ground!
   A ruthless indian slowly fades into existence.
   Nmemnonia steps aside as a ruthless indian attempts a bash, stumbles,
   and falls flat on his face.
   A ruthless indian slowly fades into existence.
   Nmemnonia steps aside as a ruthless indian attempts a bash, stumbles,
   and falls flat on his face.
   You issue the order 'bas nmemnonia'.
   298H 95V 28943845X 2439C [Scelesta:Perfect] [Nmemnonia:V.Good]
   Exits:EW> You utter the words, 'ho
   ld person'
   298H 95V 28943845X 2439C [Scelesta:Perfect] [Nmemnonia:V.Good] Mem:2
   Exits:EW>
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   Nmemnonia massacres YOU with her pierce.
   Nmemnonia slashes YOU extremely hard.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:2
   Exits:EW> do nmemnonia
   Zim flies in from the west.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:2
   Exits:EW> You issue the order '
   bas nmemnonia'.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:2
   Exits:EW>
   Zim focuses harshly on Nmemnonia and utters the words, 'hold person'.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:2
   Exits:EW> You utter the words,
   'hold person'
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:3
   Exits:EW> o all.ogre st
   do nmemnonia
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian crushes Nmemnonia very hard.
   Nmemnonia misses you and destroys an image.
   Nmemnonia misses you and destroys an image.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:3
   Exits:EW>
   A merchant arrives from the east.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:3
   Exits:EW>
   Zim focuses harshly on Nmemnonia and utters the words, 'hold person'.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:3
   Exits:EW> A ruthless indian sta
   nds up.
   A ruthless indian stands up.
   You issue the order 'st'.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:V.Good] Mem:3
   Exits:EW> Nmemnonia steps aside
   as a ruthless indian attempts a bash, stumbles, and falls flat on his
   face.
   A ruthless indian crashes into Nmemnonia in a thundering collision,
   knocking her to the ground!
   A ruthless indian crashes into Nmemnonia in a thundering collision,
   knocking her to the ground!
   You issue the order 'bas nmemnonia'.
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:Good] Mem:3
   Exits:EW> You utter the words, 'h
   old person'
   229H 95V 28943845X 2439C [Scelesta:Good] [Nmemnonia:Good] Mem:4
   Exits:EW>
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   Nmemnonia pierces YOU extremely hard.
   Nmemnonia slashes YOU extremely hard.
   192H 95V 28943845X 2439C [Scelesta:Fair] [Nmemnonia:Good] Mem:4
   Exits:EW> flee
   flee
   Zim focuses harshly on Nmemnonia and utters the words, 'hold person'.
   192H 95V 28943845X 2439C [Scelesta:Fair] [Nmemnonia:Good] Mem:4
   Exits:EW> You flee head over heel
   s.
   Anatole's Amazing Artifacts
   This building smells awful. Probably from all the noxious fumes from
   the lab in the next room. But then again, everybody knows magicians
   stink.
   The counter is actually a glass case that displays several magical
   trinkets. The only exits are back north to Sword Street, and a small
   archway leading east.
   A Palanthanian guard is here serving and protecting the citizens of
   Palanthas.
   An apprentice mage is here watching the store for his master.
   192H 94V 28943845X 2439C Mem:4 Exits:NE> You're not fighting, why
   bother fleeing?
   192H 94V 28943845X 2439C Mem:4 Exits:NE>
   A Palanthanian guard leaves north.
   192H 94V 28943845X 2439C Mem:4 Exits:NE> e
   Alchemical Lab
   This is where all the noxious fumes are created. There are also many
   items of magic scattered about as this also serves as Anatole's store
   room.
   There is a small room to the east.
   A merchant is passing through here, on his way to the marketplace.
   Zim the Male Mexican is standing here. (flying) (invisible)
   . . . is followed by a hovering ball of light.
   Nmemnonia Cold Demonica is sitting here, fighting a ruthless indian.
   (flying)
   A ruthless indian is sitting here, fighting Nmemnonia.
   A ruthless indian is standing here, fighting Nmemnonia.
   A ruthless indian is standing here, fighting Nmemnonia.
   Linus the Alchemist, is here working diligently on a new formula.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> A ruthless indian crashes into
   Nmemnonia in a thundering
   collision, knocking her to the ground!
   Nmemnonia steps aside as a ruthless indian attempts a bash, stumbles,
   and falls flat on his face.
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Nmemnonia pierces a ruthless indian extremely hard.
   Nmemnonia slashes a ruthless indian extremely hard.
   A ruthless indian crushes Nmemnonia.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre st
   A ruthless indian stands up.
   You issue the order 'st'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   Nmemnonia steps aside as a ruthless indian attempts a bash, stumbles,
   and falls flat on his face.
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Nmemnonia pierces a ruthless indian extremely hard.
   A ruthless indian is incapacitated and will slowly die, if not aided.
   Nmemnonia massacres a ruthless indian with her slash.
   A ruthless indian is dead! R.I.P.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian misses Nmemnonia with his crush.
   The death cry of a ruthless indian echoes from somewhere nearby...
   A ruthless indian stops following you.
   A ruthless indian slowly fades into nothingness.
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Zim focuses harshly on Nmemnonia and utters the words, 'lightning
   bolt'.
   Nmemnonia wavers under the impact of the lightning bolt sent by Zim.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre st
   o all.ogre bas
   You issue the order 'st'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   A merchant leaves west.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   o all.ogre bas
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Nmemnonia pierces a ruthless indian extremely hard.
   Nmemnonia slashes a ruthless indian extremely hard.
   A ruthless indian misses Nmemnonia with his crush.
   A ruthless indian crushes Nmemnonia very hard.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre st
   A ruthless indian stands up.
   You issue the order 'st'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> o all.ogre bas
   Zim focuses harshly on Nmemnonia and utters the words, 'lightning
   bolt'.
   Nmemnonia wavers under the impact of the lightning bolt sent by Zim.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> A ruthless indian crashes into
   Nmemnonia in a thundering
   collision, knocking her to the ground!
   You issue the order 'bas'.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> c 'h p' nmemnonia
   You utter the words, 'hold person'
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Nmemnonia massacres a ruthless indian with her pierce.
   Nmemnonia massacres a ruthless indian with her slash.
   A ruthless indian crushes Nmemnonia very hard.
   A ruthless indian crushes Nmemnonia very hard.
   192H 93V 28943845X 2439C Mem:4 Exits:EW>
   Zim focuses harshly on Nmemnonia and utters the words, 'lightning
   bolt'.
   Nmemnonia wavers under the impact of the lightning bolt sent by Zim.
   192H 93V 28943845X 2439C Mem:4 Exits:EW> c 'f b' nmemnonia
   watch ogre
   You utter the words, 'force bolt'
   You hear bones crack as your force bolt slams into Nmemnonia.
   192H 93V 28943845X 2439C Mem:5 Exits:EW>
   Nmemnonia massacres a ruthless indian with her pierce.
   A ruthless indian is incapacitated and will slowly die, if not aided.
   Nmemnonia annihilates a ruthless indian with her slash.
   A ruthless indian is dead! R.I.P.
   A ruthless indian barely crushes Nmemnonia.
   The death cry of a ruthless indian echoes from somewhere nearby...
   You hear the Indian's neck snap as he falls to the ground with a dull
   thud.
   A ruthless indian stops following you.
   A ruthless indian slowly fades into nothingness.
   192H 93V 28943845X 2439C Mem:5 Exits:EW> o all.ogre bas
   o all.ogre bas
   Cona flies in from the west.
   Zim focuses harshly on Nmemnonia and utters the words, 'lightning
   bolt'.
   Nmemnonia wavers under the impact of the lightning bolt sent by Zim.
   192H 93V 28943845X 2439C Mem:5 Exits:EW>
   Cona flies east.
   192H 93V 28943845X 2439C Mem:5 Exits:EW> o all.ogre st
   Nmemnonia massacres a ruthless indian with her pierce.
   Nmemnonia slashes a ruthless indian extremely hard.
   A ruthless indian misses Nmemnonia with his crush.
   You now watch a ruthless indian.
   Nmemnonia stands up.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW> A ru
   thless indian crashes into Nmemnonia in a thundering collision,
   knocking her to the ground!
   You issue the order 'bas'.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW> You
   issue the order 'bas'.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW> You
   issue the order 'st'.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW>
   Zim gets a small pile of coins from the corpse of a ruthless indian.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW>
   Zim focuses harshly on Nmemnonia and utters the words, 'force bolt'.
   The sound of bones cracking echoes as Zim's force bolt slams into
   Nmemnonia.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW> o al
   l.ogre bas nmemnonia
   c 'f b' nmemnonia
   You issue the order 'bas nmemnonia'.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Awful**] Mem:4 Exits:EW> You
   utter the words, 'force bolt'
   Your force bolt shatters Nmemnonia's skull into lifeless goo.
   You receive 0 experience.
   Nmemnonia is dead! R.I.P.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**]
   [**Nmemnonia:Dying**] Mem:6 Exits:EW>
   The death cry of Nmemnonia echoes from somewhere nearby...
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**] Mem:6 Exits:EW>
   A merchant arrives from the west.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**] Mem:6 Exits:EW>
   get all corpse
   Zim gets a large pile of coins from the corpse of Nmemnonia.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**] Mem:6 Exits:EW>
   Zim is zapped by a poinard and instantly drops it.
   Zim gets a wickedly barbed short sword from the corpse of Nmemnonia.
   Zim gets a spiked ice bracelet from the corpse of Nmemnonia.
   Zim gets a mithril bracelet from the corpse of Nmemnonia.
   Zim gets a ruby inlaid scabbard from the corpse of Nmemnonia.
   Zim gets an impossibly dark shroud from the corpse of Nmemnonia.
   Zim gets a pair of black suede gloves from the corpse of Nmemnonia.
   Zim gets some greasy footpads from the corpse of Nmemnonia.
   Zim gets a black mask of silver from the corpse of Nmemnonia.
   Zim gets a dark red thieving plate from the corpse of Nmemnonia.
   Zim gets a black leather choker from the corpse of Nmemnonia.
   Zim gets a silver dwarven ring from the corpse of Nmemnonia.
   Zim gets a carved ivory ring from the corpse of Nmemnonia.
   Zim gets an entire loaf of bread from the corpse of Nmemnonia.
   Zim gets a thick aqua charm from the corpse of Nmemnonia.
   Zim gets a large first-aid kit from the corpse of Nmemnonia.
   Zim gets an orange potion from the corpse of Nmemnonia.
   Zim gets a purple robe with silver runes from the corpse of Nmemnonia.
   Zim gets a wrist lantern from the corpse of Nmemnonia.
   Zim gets a wrist lantern from the corpse of Nmemnonia.
   Zim gets a wrist lantern from the corpse of Nmemnonia.
   Zim gets a blue potion of remove poison from the corpse of Nmemnonia.
   Zim gets a blue potion of remove poison from the corpse of Nmemnonia.
   211H 136V 28943845X 2439C [**a ruthless indian:Fair**] Mem:6 Exits:EW>

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
