<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Wild Ambush

   POV: Breaker

   Log Rating: 2.8571

   Ain't nothin' better than the 1hp recall...

   288H 111V 14187061X 1049C [**Dowjo:Good**] Mem:2 Exits:(N)E(S)>
   A high priestess of Takhisis focuses harshly on Dowjo and utters the
   words, 'gjibarh'.
   Dowjo withers as a ray of sunlight sent by a high priestess of Takhisis
   engulfs him!
   Dravin misses a high priestess of Takhisis with his crush.
   Rirach cleaves a high priestess of Takhisis very hard.
   Rirach cleaves a high priestess of Takhisis hard.
   Kalderen massacres a high priestess of Takhisis with his slash.
   Saunt misses a high priestess of Takhisis with his cleave.
   Dowjo massacres a high priestess of Takhisis with his slash.
   Dowjo slashes a high priestess of Takhisis extremely hard.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   Kalderen strikes at a high priestess of Takhisis, but misses
   completely.
   288H 111V 14187061X 1049C [**Dowjo:Fair**] Mem:2 Exits:(N)E(S)>
   Uther flies in from the east.
   Quierra flies in from the east.
   Grouch flies in from the east.
   Alucard flies in from the east.
   Isto flies in from the east.
   Leif flies in from the east.
   Frotch flies in from the east.
   288H 111V 14187061X 1049C [**Dowjo:Fair**] Mem:2 Exits:(N)E(S)>
   Isto focuses harshly on Dravin and utters some strange words.
   Isto slowly fades into existence.
   Isto comes out of hiding.
   The sound of bones cracking echoes as Isto's force bolt slams into
   Dravin.
   Dravin misses a high priestess of Takhisis with his crush.
   Rirach misses a high priestess of Takhisis with his cleave.
   Rirach misses a high priestess of Takhisis with his cleave.
   Kalderen slashes a high priestess of Takhisis extremely hard.
   Saunt cleaves a high priestess of Takhisis extremely hard.
   Dowjo slashes a high priestess of Takhisis extremely hard.
   Dowjo slashes a high priestess of Takhisis extremely hard.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   Uther slowly fades into existence.
   You are sent sprawling as Uther crashes into you.
   st
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   You stop watching Dowjo.
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Leila appears to be dancing around the room.
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Grouch focuses harshly on you and utters some strange words.
   Kalderen attempts to strike at a high priestess of Takhisis with his
   sword.
   Kalderen slashes a high priestess of Takhisis very hard.
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Frotch slowly fades into existence.
   Frotch crashes into Dravin in a thundering collision, knocking him to
   the ground!
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Alucard focuses harshly on you and utters the words, 'hold person'.
   265H 111V 14187061X 1049C [Breaker:Good] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Promina slowly fades into existence.
   Promina comes out of hiding.
   Promina annihilates YOU with her shoot.
   228H 111V 14187061X 1049C [Breaker:Fair] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   A high priestess of Takhisis focuses harshly on you and utters the
   words, 'hold person'.
   228H 111V 14187061X 1049C [Breaker:Fair] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Krandar tells your group 'tick in 10'
   228H 111V 14187061X 1049C [Breaker:Fair] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Rirach charges into a high priestess of Takhisis, but she manages to
   stay standing.
   228H 111V 14187061X 1049C [Breaker:Fair] [Uther:V.Good] Mem:5
   Exits:(N)E(S)>
   Dowjo slams into you and pushes you out of the way of battle.
   Dowjo slashes Uther hard.
   Promina massacres Dowjo with her shoot.
   Promina massacres Dowjo with her shoot.
   Dowjo massacres Uther with his slash.
   Dowjo slashes Uther extremely hard.
   Frotch massacres Dravin with her cleave.
   Uther annihilates YOU with his slash.
   Uther annihilates YOU with his slash.
   You smite Uther very hard.
   Dravin crushes a high priestess of Takhisis hard.
   Rirach cleaves a high priestess of Takhisis extremely hard.
   Rirach cleaves a high priestess of Takhisis hard.
   Kalderen massacres a high priestess of Takhisis with his slash.
   Saunt misses a high priestess of Takhisis with his cleave.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   Isto focuses harshly on Dravin and utters some strange words.
   Isto slowly fades into existence.
   Isto comes out of hiding.
   The sound of bones cracking echoes as Isto's force bolt slams into
   Dravin.
   125H 111V 14187061X 1049C [Breaker:V.Bad] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Uther crashes into Dravin in a thundering collision, knocking him to
   the ground!
   Dravin is stunned, but will likely regain consciousness again.
   125H 111V 14187061X 1049C [Breaker:V.Bad] [Uther:Good] Mem:5
   Exits:(N)E(S)> 'wtf
   Grouch flies east.
   125H 111V 14187061X 1049C [Breaker:V.Bad] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Krandar sinks gently to the ground.
   Krandar stops using a condor feather.
   Krandar grabs a glowing scroll of recall.
   Krandar recites a glowing scroll of recall.
   Krandar disappears.
   125H 111V 14187061X 1049C [Breaker:V.Bad] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Alucard focuses harshly on you and utters some strange words.
   Alucard slowly fades into existence.
   You feel ribs shatter as Alucard's force bolt slams into you.
   You wish your wounds would stop BLEEDING so much!
   60H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Saunt gets a scroll from his belt.
   60H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Leila slowly fades into existence.
   A twisted look of pain appears on Dravin's face as he suddenly
   discovers Leila's dagger in his back.
   Dravin is dead! R.I.P.
   get coins corpseexa corpseLeif slowly fades into existence.
   Leif slashes YOU extremely hard.
   You wish your wounds would stop BLEEDING so much!
   44H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)> st
   The death cry of Dravin echoes from somewhere nearby...
   Dravin stops following you.
   44H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)> flee
   Dowjo gets a very large pile of coins from the corpse of Dravin.
   44H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)>
   Saunt sinks gently to the ground.
   Saunt stops using a small down feather.
   Saunt grabs a glowing scroll of recall.
   Saunt recites a glowing scroll of recall.
   Saunt disappears.
   44H 111V 14187061X 1049C [Breaker:Awful] [Uther:Good] Mem:5
   Exits:(N)E(S)> A high priestess of Takhisis focuses harshly on Dowjo
   and utters the words, 'aiquunsoh judifgz'.
   Dowjo comes to your rescue! You're thankful, but a bit dazed.
   Uther annihilates Dowjo with his slash.
   Uther annihilates Dowjo with his slash.
   Dowjo slashes Uther very hard.
   Leif massacres YOU with his slash.
   You wish your wounds would stop BLEEDING so much!
   Leif massacres YOU with his slash.
   You wish your wounds would stop BLEEDING so much!
   Promina massacres Dowjo with her shoot.
   Promina massacres Dowjo with her shoot.
   Rirach cleaves a high priestess of Takhisis very hard.
   Rirach cleaves a high priestess of Takhisis hard.
   Kalderen slashes a high priestess of Takhisis extremely hard.
   A high priestess of Takhisis annihilates Dowjo with her hit.
   You stand up.
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)>
   Quierra gets a sturdy maul from the corpse of Dravin.
   Quierra gets a black priest's robe from the corpse of Dravin.
   Quierra gets a diamond shield from the corpse of Dravin.
   Quierra gets a small golden amulet from the corpse of Dravin.
   Quierra gets a black velvet cloak from the corpse of Dravin.
   Quierra gets a small white ring from the corpse of Dravin.
   Quierra gets a large waterskin from the corpse of Dravin.
   Quierra gets a silver amulet from the corpse of Dravin.
   Quierra gets a piece of sweet bread from the corpse of Dravin.
   Quierra gets a piece of sweet bread from the corpse of Dravin.
   Quierra gets a piece of sweet bread from the corpse of Dravin.
   Quierra gets a glowing scroll of recall from the corpse of Dravin.
   Quierra gets a blank scroll from the corpse of Dravin.
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)> You say 'wtf'
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)> The corpse doesn't seem to have what you are looking
   for.
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)>
   Promina stops fighting her opponent and turns to you instead.
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)> It's a pretty ghastly sight! Searching through the
   remains, you find:
   corpse (here) :
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)> fleeYou are already standing.
   1H 111V 14187061X 1049C [Breaker:Awful] [Leif:V.Good] Mem:5
   Exits:(N)E(S)> fleeYou flee head over heels.
   In the Prison
   Grouch the Living Legend is standing here. (flying) (invisible)
   1H 110V 14187061X 1049C Mem:5 Exits:(N)E(S)W> You're not fighting, why
   bother fleeing?
   1H 110V 14187061X 1049C Mem:5 Exits:(N)E(S)W> e
   Uther flies in from the west.
   1H 110V 14187061X 1049C Mem:5 Exits:(N)E(S)W> eYou're not fighting, why
   bother fleeing?
   1H 110V 14187061X 1049C Mem:5 Exits:(N)E(S)W> In the Prison
   1H 109V 14187061X 1049C Mem:5 Exits:(N)E(S)W> A Large Cavern
   1H 108V 14187061X 1049C Mem:5 Exits:E(S)WU> recite recallYou grab a
   glowing scroll of recall.
   You recite a glowing scroll of recall which dissolves.
   The Reception
   A wooden bulletin board with the heading 'Wanted' is posted on the
   wall.
   A note written on a small paper is here.
   A strip of black cloth lies here.
   A black key with deep grooves on the handle is sitting here.
   The manager of Traveler's Lodge stands here ready to sign you in.
   A tall and strong bouncer, hired to protect the lodge's customers,
   stands here.
   1H 108V 14187061X 1049C Mem:5 Exits:N>
   Krandar tells your group 'wtf?'
   16H 116V 14187061X 1049C Mem:4 Exits:N>
   Dowjo tells your group 'haha ambush'

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
