<VeWtiFuL> yea but now i started a garden center out of my driveway

   Login
   Username: __________
   Password: __________
             Login
   [1]Forgot your password?
   [2]Register for a Login
   Mud Logs
   [3]Recent Logs
   [4]Older Logs
   [5]Newer Logs
   [6]Top Rated Logs
   [7]Most Viewed Logs
   [8]Upload A Log
   [9]Log Collections
   [10]Log Quicklist
   Mud Links
   [11]Arcticmud Blog!
   [12]Xanitha's Mud Log Page
   [13]RGB Mud Log Page
   [14]Lasse's Logs (not current)
   [15]Oligo's Logs (not current)
   [16]Arctic Mud Forums
   [17]Arctic Mud Homepage
   [18]Vote for Arctic
   on Top Mud Sites

   What is the worst change this wipe?

   (*) hp gain randomness
   ( ) +heal items
   ( ) every high level zone bugged
   ( ) road shortening
   ( ) rolling system
   ( ) nosummon items
   ( ) all of the above
   Vote Results

   [19]Submit a Poll
   [20]List Previous Polls

   Leif RIP

   POV: Scelesta

   Log Rating: 1.4000

   BEWRAE THE TESSTOOOOOOOOOOOOOOO (to come)

   199H 45V 2498191X 1377C Mem:2 Exits:NES> e
   c 'h p' carolina
   Fira flies in from the west.
   Emai flies in from the west.
   The Eastern Edge of the Training Grounds
   The quarters of a lieutenant of the dragonarmy lie east of here,
   entered through a thick wooden door. Spreading out in every other
   direction
   are the grounds upon which fledgeling soldiers in the dragonarmy hone
   their
   skills until they are powerful enough to do battle with the good forces
   of
   Ansalon. Debris covers a good area of the floor, sheared off pieces of
   armor and weapons mostly. Above your head the ceiling is spotted and
   dirty
   with blood stains, as are the walls enclosing the facility.
   Emai the Male Human is standing here. (flying) (invisible)
   . . . has a tough exterior.
   Fira Dawn, Crimson Angel is standing here. (flying) (invisible)
   Carolina, the Blue-Blooded Massacre is standing here, fighting a
   brutish sergeant. (flying)
   A brutish sergeant is standing here, fighting Carolina.
   Leif Fall, Autumn Massacre is standing here.
   199H 44V 2498191X 1377C Mem:2 Exits:N(E)SW> You utter the words, 'hold
   person'
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   Fira focuses harshly on Carolina and utters the words, 'hold person'.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   Emai focuses harshly on Carolina and utters the words, 'hold person'.
   Carolina freezes in place.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   A brutish sergeant hits Carolina very hard.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW> c 'h p' leif
   You can't remember how to cast that spell!
   Fira focuses harshly on Carolina and utters the words, 'force bolt'.
   Fira slowly fades into existence.
   The sound of bones cracking echoes as Fira's force bolt slams into
   Carolina.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   A brutish sergeant crashes into Carolina in a thundering collision,
   knocking him to the ground!
   Emai focuses harshly on Carolina and utters the words, 'lightning
   bolt'.
   Emai slowly fades into existence.
   Carolina wavers under the impact of the lightning bolt sent by Emai.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   A brutish sergeant massacres Carolina with his hit.
   Carolina massacres a brutish sergeant with his slash.
   Carolina slashes a brutish sergeant extremely hard.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW> c 'l b' carolina
   You utter the words, 'lightning bolt'
   The lightning bolt hits Carolina with full impact.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   Fira focuses harshly on Carolina and utters the words, 'force bolt'.
   The sound of bones cracking echoes as Fira's force bolt slams into
   Carolina.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW>
   Emai focuses harshly on Carolina and utters the words, 'lightning
   bolt'.
   Emai slowly fades into existence.
   Carolina wavers under the impact of the lightning bolt sent by Emai.
   199H 44V 2498191X 1377C Mem:3 Exits:N(E)SW> close door
   Leif massacres YOU with his crush.
   177H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:3
   Exits:N(E)SW> c 'l b' carolina
   Leif crushes YOU extremely hard.
   You miss Leif with your smite.
   A brutish sergeant misses Carolina with his hit.
   Carolina massacres a brutish sergeant with his slash.
   Carolina slashes a brutish sergeant extremely hard.
   161H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:3
   Exits:N(E)SW> It's already closed!
   161H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:3
   Exits:N(E)SW> You utter the words, 'li
   ghtning bolt'
   The lightning bolt hits Carolina with full impact.
   161H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW>
   Fira focuses harshly on Carolina and utters the words, 'force bolt'.
   The sound of bones cracking echoes as Fira's force bolt slams into
   Carolina.
   Carolina stands up.
   161H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW>
   Emai focuses harshly on Carolina and utters the words, 'hold person'.
   Carolina freezes in place.
   161H 44V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW> gt frag leif it's vbad
   gt frag leif it's vbad
   c 'l b' carolina
   Leif misses you with his crush.
   A brutish sergeant hits Carolina extremely hard.
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW>
   Carolina stops using a slick blade.
   Carolina grabs a glowing scroll of recall.
   Carolina recites a glowing scroll of recall.
   Carolina disappears.
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW> You tell your group 'fra
   g leif it's vbad'
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW>
   You tell your group 'fra
   g leif it's vbad'
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW> Who should the spell be
   cast upon?
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW>
   A brutish sergeant crashes into Leif in a thundering collision,
   knocking him to the ground!
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW> c 'f b'
   Fira says 'hahaha'
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:4
   Exits:N(E)SW> You utter the words, 'fo
   rce bolt'
   You hear bones crack as your force bolt slams into Leif.
   176H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:5
   Exits:N(E)SW>
   A brutish sergeant massacres Leif with his hit.
   Leif crushes YOU extremely hard.
   161H 65V 2498191X 1377C [Scelesta:Good] [Leif:V.Bad] Mem:5
   Exits:N(E)SW> c 'f b'
   Emai focuses harshly on Leif and utters the words, 'lightning bolt'.
   Emai slowly fades into existence.
   Leif wavers under the impact of the lightning bolt sent by Emai.
   161H 65V 2498191X 1377C [Scelesta:Good] [Leif:Awful] Mem:5
   Exits:N(E)SW>
   Fira focuses harshly on Leif and utters the words, 'lightning bolt'.
   Leif wavers under the impact of the lightning bolt sent by Fira.
   161H 65V 2498191X 1377C [Scelesta:Good] [Leif:Awful] Mem:5
   Exits:N(E)SW> You utter the words, 'fo
   rce bolt'
   Your force bolt shatters Leif's skull into lifeless goo.
   You receive 0 experience.
   Leif is dead! R.I.P.
   161H 65V 2498191X 1377C [Leif:Dying] Mem:6 Exits:N(E)SW>
   The death cry of Leif echoes from somewhere nearby...
   Carolina stops following Leif.
   161H 65V 2498191X 1377C Mem:6 Exits:N(E)SW> get all corpse
   Fira gets a giant's maul from the corpse of Leif.
   Fira gets a jewelled black belt from the corpse of Leif.
   Fira gets the grey robes of the Thorn from the corpse of Leif.
   Fira gets a pair of midnight blue bracers from the corpse of Leif.
   Fira gets a pair of silver dwarven gauntlets from the corpse of Leif.
   Fira gets a pair of white boots from the corpse of Leif.
   Fira gets a set of platinum leg plates from the corpse of Leif.
   Fira gets a blue dragonmask from the corpse of Leif.
   Fira is zapped by a suit of mithril solamnic plate and instantly drops
   it.
   A suit of mithril solamnic plate hits the floor and immediately becomes
   lost in a field of litter
   .
   Fira is zapped by a platinum necklace and instantly drops it.
   A platinum necklace hits the floor and immediately becomes lost in a
   field of litter.
   Fira gets an officer's insignia from the corpse of Leif.
   Fira gets a malachite ring from the corpse of Leif.
   Fira gets a very large pile of coins from the corpse of Leif.
   Fira gets a bent iron key from the corpse of Leif.
   Fira gets a cryptic note from the corpse of Leif.
   Fira gets a black granite shield from the corpse of Leif.
   Fira is zapped by an ancient solamnic ring and instantly drops it.
   An ancient solamnic ring hits the floor and immediately becomes lost in
   a field of litter.
   Fira gets a dented black cudgel from the corpse of Leif.
   Fira gets a set of keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   Fira gets a ring of cell keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   Fira gets a ring of cell keys from the corpse of Leif.
   Fira gets a ring of cell keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   Fira gets a loop of jailer's keys from the corpse of Leif.
   Fira gets a ring of cell keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   Fira gets a chain of keys from the corpse of Leif.
   res
   Fira gets a loop of jailer's keys from the corpse of Leif.
   161H 65V 2498191X 1377C Mem:6 Exits:N(E)SW>
   Emai gets a bright ball of light from the corpse of Leif.
   Emai gets a dark sack from the corpse of Leif.
   161H 65V 2498191X 1377C Mem:6 Exits:N(E)SW> The corpse doesn't seem to
   have what you are looking
   for.
   161H 65V 2498191X 1377C Mem:6 Exits:N(E)SW> You rest your tired bones
   but stay aloft.
   161H 65V 2498191X 1377C Mem:3 Exits:N(E)SW> gt ok
   You tell your group 'ok'
   161H 65V 2498191X 1377C Mem:3 Exits:N(E)SW> get all
   You get the corpse of Leif.
   161H 65V 2498191X 1377C Mem:3 Exits:N(E)SW>

        Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
                          -5  -4  -3  -2  -1  0   1   2   3   4   5
              Vote

   Hated It


                                                                  Loved It

References

   1. file:///index.php?option=forgot
   2. file:///index.php?option=register
   3. file:///index.php?option=recentlogs
   4. file:///index.php?option=recentlogs&lognbr=10
   5. file:///index.php?option=recentlogs&lognbr=0
   6. file:///index.php?option=toplogs
   7. file:///index.php?option=mostviewedlogs
   8. file:///index.php?option=uploadlog
   9. file:///index.php?option=collections
  10. file:///index.php?option=quicklist
  11. http://arcticmud.blogspot.com/
  12. http://mudlogs.foghaven.net/
  13. http://pollux.ldz.lv/~punk/upload/index.php
  14. http://tirannon.tky.hut.fi/arctic/
  15. http://normstorm.com/template/m-news.html
  16. http://mud.arctic.org/forum/
  17. http://mud.arctic.org/
  18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
  19. file:///index.php?option=poll&action=new
  20. file:///index.php?option=poll&action=listpolls
