<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Blaah paniced again.

POV: Blaah

Log Rating: -1.6667

272H 106V 15153991X 6621C Mem:3 Exits:NESW> s
Vingaard Avenue South
Dilger the Male Hylar Dwarf is standing here. (flying)
Bigus, Bringing Back the Biff is standing here. (flying)
Morbius the Male Hylar Dwarf is standing here. (flying)
A tired traveller is looking around for the town's inn.
272H 105V 15153991X 6621C Mem:3 Exits:NESW> cast 'hol m' Morbius
You utter the words, 'hold monster'
The magic fails!
272H 105V 15153991X 6621C Mem:4 Exits:NESW>
Androctonus focuses harshly on Morbius and utters the words, 'hold
person'.
272H 105V 15153991X 6621C Mem:4 Exits:NESW>
Morbius focuses harshly on you and utters some strange words.
Morbius misses you and destroys an image.
272H 105V 15153991X 6621C [Blaah:Perfect] [Morbius:Perfect] Mem:4
Exits:NESW>
Dilger tries to bash you, but he passes right through your image.
272H 105V 15153991X 6621C [Blaah:Perfect] [Morbius:Perfect] Mem:4
Exits:NESW>
Dilger slashes YOU extremely hard.
Morbius smites YOU very hard.
You miss Morbius with your crush.
Androctonus focuses harshly on Morbius and utters the words, 'hold
person'.
Morbius freezes in place.
240H 105V 15153991X 6621C [Blaah:Good] [Morbius:Perfect] Mem:4
Exits:NESW> moan
You start to moan.
240H 105V 15153991X 6621C [Blaah:Good] [Morbius:Perfect] Mem:4
Exits:NESW>
Dilger slashes YOU extremely hard.
You crush Morbius very hard.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:V.Good] Mem:4
Exits:NESW>
Androctonus focuses harshly on Morbius and utters the words, 'lightning
bolt'.
Morbius wavers under the impact of the lightning bolt sent by
Androctonus.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Good] Mem:4 Exits:NESW>
cast 'l b' morbius
You utter the words, 'lightning bolt'
The lightning bolt hits Morbius with full impact.
Some spiritual boots in use by Morbius is destroyed.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Fair] Mem:4 Exits:NESW>
cast 'l b' morbius
Dilger stands up.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Fair] Mem:4 Exits:NESW>
You step aside as Dilger tries to bash you, causing him to tumble and
fall face down.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Fair] Mem:4 Exits:NESW>
Dilger misses you with his slash.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Fair] Mem:4 Exits:NESW>
Bigus flies south.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Fair] Mem:4 Exits:NESW>
Androctonus focuses harshly on Morbius and utters the words, 'lightning
bolt'.
Morbius wavers under the impact of the lightning bolt sent by
Androctonus.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:Bad] Mem:4 Exits:NESW>
You utter the words, 'lightning bolt'
The lightning bolt hits Morbius with full impact.
222H 105V 15153991X 6621C [Blaah:Good] [Morbius:V.Bad] Mem:5
Exits:NESW> cast 'l b' morbius
Dilger slashes YOU very hard.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:V.Bad] Mem:5
Exits:NESW>
Androctonus focuses harshly on Morbius and utters the words, 'lightning
bolt'.
Morbius wavers under the impact of the lightning bolt sent by
Androctonus.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:Awful] Mem:5
Exits:NESW> You utter the words, 'lightning bolt'
The lightning bolt hits Morbius with full impact.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:Awful] Mem:5
Exits:NESW> cast 'l b' morbius
Dilger stands up.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:Awful] Mem:5
Exits:NESW>
Dilger unsuccessfully tries to save Morbius.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:Awful] Mem:5
Exits:NESW>
Dilger misses you and destroys an image.
The images around you fade out of existance.
209H 105V 15153991X 6621C [Blaah:Good] [Morbius:Awful] Mem:5
Exits:NESW>
Androctonus focuses harshly on Morbius and utters the words, 'lightning
bolt'.
Morbius receives the full blast of a lightning bolt from Androctonus
... and is no more.
You receive 0 experience.
get all.coins corpse
exam corpse
Morbius is dead! R.I.P.
209H 105V 15153991X 6621C [Morbius:Dying] Mem:5 Exits:NESW>
The death cry of Morbius echoes from somewhere nearby...
Bigus stops following Morbius.
Dilger stops following Morbius.
You direct your attention to Dilger.
209H 105V 15153991X 6621C [Blaah:Good] [Dilger:Perfect] Mem:5
Exits:NESW> Who should the spell be cast upon?
209H 105V 15153991X 6621C [Blaah:Good] [Dilger:Perfect] Mem:5
Exits:NESW>
Dilger slashes YOU extremely hard.
Dilger hugs himself gleefully for no apparent reason.
194H 105V 15153991X 6621C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> You get a pile of coins from the corpse of Morbius.
There were 28 coins.
194H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> get all corpse
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a spiritual hammer..it glows blue..it glows dimly
a grey cloth cloak
a dark shield..it glows blue..it hums softly
some spiritual vambraces..it glows blue..it glows dimly
some spiritual gauntlets..it glows blue..it glows dimly
some black legplates of the Lily..it glows blue
a spiritual helmet..it glows blue..it glows dimly
some spiritual plate mail..it glows blue..it glows dimly
a portable keg
a grey stone
a scroll of recall..it glows blue [2]
a bright ball of light..it glows dimly
an ergothian long sword
a piece of sweet bread..it glows blue [5]
a bronze shield
194H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> You are zapped by a spiritual hammer and instantly drop it.
A spiritual hammer disintegrates.
You get a grey cloth cloak from the corpse of Morbius.
You get a dark shield from the corpse of Morbius.
You are zapped by some spiritual vambraces and instantly drop it.
Some spiritual vambraces disintegrates.
You are zapped by some spiritual gauntlets and instantly drop it.
Some spiritual gauntlets disintegrates.
You get some black legplates of the Lily from the corpse of Morbius.
You are zapped by a spiritual helmet and instantly drop it.
A spiritual helmet disintegrates.
You are zapped by some spiritual plate mail and instantly drop it.
Some spiritual plate mail disintegrates.
You get a portable keg from the corpse of Morbius.
You get a grey stone from the corpse of Morbius.
You get a scroll of recall from the corpse of Morbius.
You get a scroll of recall from the corpse of Morbius.
You get a bright ball of light from the corpse of Morbius.
You get an ergothian long sword from the corpse of Morbius.
You get a piece of sweet bread from the corpse of Morbius.
You get a piece of sweet bread from the corpse of Morbius.
You get a piece of sweet bread from the corpse of Morbius.
You get a piece of sweet bread from the corpse of Morbius.
You get a piece of sweet bread from the corpse of Morbius.
You get a bronze shield from the corpse of Morbius.
194H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> get all corpse
The corpse doesn't seem to have what you are looking for.
194H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> sta
You are sent sprawling as Dilger crashes into you.
178H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> cast 'hol m'
You miss Dilger with your crush.
Dilger massacres YOU with his slash.
157H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW>
You miss Dilger with your crush.
Dilger slashes YOU extremely hard.
140H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> recite recall me
gt TICK IN 10
You stand up.
140H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:5
Exits:NESW> You utter the words, 'hold monster'
Dilger freezes in place.
140H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:6
Exits:NESW>
Bigus flies in from the south.
140H 105V 15153991X 6649C [Blaah:Fair] [Dilger:Perfect] Mem:6
Exits:NESW>
Androctonus focuses harshly on Dilger and utters the words, 'acid
blast'.
Dilger is caught in some of Androctonus's acid!
140H 105V 15153991X 6649C [Blaah:Fair] [Dilger:V.Good] Mem:6
Exits:NESW> You grab a scroll of recall.
You recite a scroll of recall which dissolves.
Rampart Way
A swarthy mercenary patrols the streets of Haven, looking for signs of
trouble.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
