<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Imperial RIP

POV: Fira

Log Rating: -1.2500

death near que kul

278H 95V 15164216X 292C [**Vinoa:Perfect**] Mem:2 Exits:NS> nA bozak
hatchling arrives from the south.
A bozak hatchling flies in from the south.
A bozak hatchling flies in from the south.
A bozak hatchling kneels down and studies the ground.
A bozak hatchling points at Breoni.
A bozak hatchling says 'There they are!'
Vinoa flies in from the south.
A Worn Path
The aroma of a cook fire is getting much stronger and you can barely
contain yourself as your taste buds dream of what might be cooking. A
small
cloud of dust floats off the road as your feet pound the hard earth,
and
your legs are covered with the dust of the path. It seems to the west
you
can see a small trail leading deeper into the grasses of the mighty
plains.
Vinoa Dusk, Regal Emperor of the Knights is standing here. (flying)
A young bozak stands here, learning to become a killer. (flying)
A young bozak stands here, learning to become a killer. (flying)
A young bozak stands here, learning to become a killer.
Pean the Male Human is standing here. (flying)
Breoni, The Iron Fist of Empire is standing here. (flying)
Owie the Male Gnome is standing here. (flying)
. . . is outlined with a dim aura.
278H 93V 15164216X 292C [**Vinoa:Perfect**] Mem:2 Exits:NSW>
Vinoa crashes into Breoni in a thundering collision, knocking him to
the ground!
278H 93V 15164216X 292C [**Vinoa:Perfect**] [**Breoni:V.Good**] Mem:2
Exits:NSW> order all.bozak bash breoniA bozak hatchling crashes into
Breoni in a thundering collision, knocking him to the ground!
A bozak hatchling crashes into Breoni in a thundering collision,
knocking him to the ground!
You issue the order 'bash breoni'.
278H 93V 15164216X 292C [**Vinoa:Perfect**] [**Breoni:V.Good**] Mem:2
Exits:NSW> c 'hold person' breoni
A bozak hatchling misses Breoni with his claw.
A bozak hatchling misses Breoni with his claw.
Vinoa massacres Breoni with her pierce.
Breoni massacres Vinoa with his slash.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Breoni:V.Good**] Mem:2
Exits:NSW> You utter the words, 'hold person'
Breoni freezes in place.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Breoni:V.Good**] Mem:3
Exits:NSW> order all.bozak st
A bozak hatchling claws Breoni hard.
A bozak hatchling claws Breoni hard.
Vinoa pierces Breoni very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Breoni:Good**] Mem:3
Exits:NSW> order all.bozak bash owieYou issue the order 'st'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Breoni:Good**] Mem:3
Exits:NSW>
Owie stops using a petrified heart.
Owie grabs a glowing scroll of recall.
Owie recites a glowing scroll of recall.
Breoni disappears.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:3 Exits:NSW> A bozak
hatchling crashes into Owie in a thundering collision, knocking him to
the ground!
You issue the order 'bash owie'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:3 Exits:NSW> c 'hold
person' owieYou utter the words, 'hold person'
Owie freezes in place.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:3 Exits:NSW>
Vinoa crashes into Owie in a thundering collision, knocking him to the
ground!
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:V.Good**] Mem:3
Exits:NSW> order all.bozak st
Vinoa pierces Owie extremely hard.
A bozak hatchling claws Owie hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Good**] Mem:3
Exits:NSW>
Pean slashes a bozak hatchling very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Good**] Mem:3
Exits:NSW> order all.bozak bash owieYou issue the order 'st'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Good**] Mem:3
Exits:NSW> A bozak hatchling crashes into Owie in a thundering
collision, knocking him to the ground!
A bozak hatchling crashes into Owie in a thundering collision, knocking
him to the ground!
You issue the order 'bash owie'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Good**] Mem:3
Exits:NSW> c 'hold person' peanYou utter the words, 'hold person'
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Good**] Mem:4
Exits:NSW>
A bozak hatchling claws Owie very hard.
A bozak hatchling claws Owie hard.
Pean slashes a bozak hatchling very hard.
Vinoa massacres Owie with her pierce.
A bozak hatchling claws Owie very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Fair**] Mem:4
Exits:NSW> order all.bozak storder all.bozak bash owieYou issue the
order 'st'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Fair**] Mem:4
Exits:NSW> A bozak hatchling crashes into Owie in a thundering
collision, knocking him to the ground!
You issue the order 'bash owie'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Fair**] Mem:4
Exits:NSW> order all.bozak bash owieA bozak hatchling claws Owie hard.
A bozak hatchling claws Owie very hard.
Pean slashes a bozak hatchling extremely hard.
Vinoa pierces Owie extremely hard.
A bozak hatchling claws Owie very hard.
You issue the order 'bash owie'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Bad**] Mem:4
Exits:NSW> c 'lightning bolt' owieYou utter the words, 'lightning bolt'
The lightning bolt hits Owie with full impact.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:V.Bad**] Mem:4
Exits:NSW>
Vinoa looks at Pean.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:V.Bad**] Mem:4
Exits:NSW>
A bozak hatchling claws Owie extremely hard.
A bozak hatchling claws Owie extremely hard.
Pean slashes a bozak hatchling extremely hard.
Vinoa pierces Owie extremely hard.
A bozak hatchling claws Owie very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Awful**] Mem:4
Exits:NSW>
Vinoa crashes into Pean in a thundering collision, knocking him to the
ground!
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Awful**] Mem:4
Exits:NSW> order all.bozak stYou issue the order 'st'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Awful**] Mem:4
Exits:NSW> order all.bozak bash peanPean steps aside as a bozak
hatchling attempts a bash, stumbles, and falls flat on his face.
A bozak hatchling crashes into Pean in a thundering collision, knocking
him to the ground!
You issue the order 'bash pean'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Owie:Awful**] Mem:4
Exits:NSW>
A bozak hatchling claws Owie very hard.
A bozak hatchling claws Owie very hard.
Pean slashes a bozak hatchling extremely hard.
Vinoa pierces Owie extremely hard.
You receive 0 experience.
Owie is dead! R.I.P.
The death cry of Owie echoes from somewhere nearby...
Breoni stops following Owie.
Pean stops following Owie.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:4 Exits:NSW> c
'lightning bolt' owieWho should the spell be cast upon?
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:4 Exits:NSW> c
'lightning bolt' peanYou utter the words, 'lightning bolt'
The lightning bolt hits Pean with full impact.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:5 Exits:NSW>
A bozak hatchling misses Pean with his claw.
Pean slashes a bozak hatchling very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:5 Exits:NSW>
Vinoa gets a very large pile of coins from the corpse of Owie.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:5 Exits:NSW>
Vinoa gets a hammer of the Rose from the corpse of Owie.
Vinoa gets a bronze bracelet set with clear stones from the corpse of
Owie.
Vinoa gets a draconian girth from the corpse of Owie.
Vinoa gets a furry white cloak from the corpse of Owie.
Vinoa gets a pair of chitinous vambraces from the corpse of Owie.
278H 93V 15164216X 292C [**Vinoa:V.Good**] Mem:5 Exits:NSW> c 'hold
person' pean
Pean steps aside as Vinoa attempts a bash, stumbles, and falls flat on
her face.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> You utter the words, 'hold person'
Pean freezes in place.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> order all.bozak st
Vinoa massacres Pean with her pierce.
A bozak hatchling claws Pean very hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> order all.bozak bash peanget all corpseA bozak hatchling
stands up.
You issue the order 'st'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> A bozak hatchling crashes into Pean in a thundering
collision, knocking him to the ground!
A bozak hatchling crashes into Pean in a thundering collision, knocking
him to the ground!
A bozak hatchling crashes into Pean in a thundering collision, knocking
him to the ground!
You issue the order 'bash pean'.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> You get a pair of dwarven boots from the corpse of Owie.
You get a pair of Solamnic greaves from the corpse of Owie.
You get a dark green feathered cap from the corpse of Owie.
You get a dark purple burial shroud from the corpse of Owie.
You get an enchanted rat bone charm from the corpse of Owie.
You get a ring of the dweomer from the corpse of Owie.
You get a petrified heart from the corpse of Owie.
You get a piece of sweet bread from the corpse of Owie.
You get a piece of sweet bread from the corpse of Owie.
You get a crescent moon medallion from the corpse of Owie.
You get a field scythe from the corpse of Owie.
You get a glowing yellow stone from the corpse of Owie.
You get a plainsman longbow from the corpse of Owie.
Backpack : You can't carry that much weight.
You get a thick hide apron from the corpse of Owie.
You get a chipped machete from the corpse of Owie.
You get a falconer's gauntlet from the corpse of Owie.
Blade : You can't carry that many items.
Hammer : You can't carry that many items.
Vest : You can't carry that many items.
Pouch : You can't carry that many items.
Scroll : You can't carry that many items.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW>
A bozak hatchling claws Pean hard.
A bozak hatchling bruises Pean with his claw.
Vinoa pierces Pean extremely hard.
A bozak hatchling barely claws Pean.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW>
Vinoa stands up.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Fair**] Mem:5
Exits:NSW> c 'force bolt' peanYou utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Pean.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Bad**] Mem:6
Exits:NSW>
Vinoa tells your group 'nice eq'
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Bad**] Mem:6
Exits:NSW> c 'force bolt' pean
A bozak hatchling claws Pean very hard.
A bozak hatchling claws Pean.
Vinoa pierces Pean extremely hard.
A bozak hatchling claws Pean extremely hard.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:V.Bad**] Mem:6
Exits:NSW>
Vinoa crashes into Pean in a thundering collision, knocking him to the
ground!
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:V.Bad**] Mem:6
Exits:NSW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Pean.
278H 93V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Awful**] Mem:7
Exits:NSW> order all.bozak storder all.bozak bash
A bozak hatchling claws Pean extremely hard.
A bozak hatchling claws Pean hard.
Vinoa pierces Pean extremely hard.
A bozak hatchling claws Pean very hard.
Pean is incapacitated and will slowly die, if not aided.
Pean lies immobile on the ground, suffering...
Pean is mortally wounded, and will die soon, if not aided.
278H 126V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Dying**] Mem:6
Exits:NSW> You issue the order 'st'.
278H 126V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Dying**] Mem:6
Exits:NSW> A bozak hatchling crashes into Pean in a devastating bash,
killing him mercilessly.
You receive 0 experience.
Pean is dead! R.I.P.
You issue the order 'bash'.
278H 126V 15164216X 292C [**Vinoa:V.Good**] [**Pean:Dying**] Mem:6
Exits:NSW>
The death cry of Pean echoes from somewhere nearby...
278H 126V 15164216X 292C [**Vinoa:V.Good**] Mem:6 Exits:NSW> lA Worn
Path
The aroma of a cook fire is getting much stronger and you can barely
contain yourself as your taste buds dream of what might be cooking. A
small
cloud of dust floats off the road as your feet pound the hard earth,
and
your legs are covered with the dust of the path. It seems to the west
you
can see a small trail leading deeper into the grasses of the mighty
plains.
The corpse of Pean is lying here.
The corpse of Owie is lying here.
Vinoa Dusk, Regal Emperor of the Knights is standing here. (flying)
A young bozak stands here, learning to become a killer. (flying)
A young bozak stands here, learning to become a killer. (flying)
A young bozak stands here, learning to become a killer.
278H 126V 15164216X 292C [**Vinoa:V.Good**] Mem:6 Exits:NSW> get all
corpseChest : You can't carry that many items.
Sword : You can't carry that many items.
Shield : You can't carry that many items.
Breastplate : You can't carry that many items.
Crystal : You can't carry that many items.
Ring : You can't carry that many items.
Bread : You can't carry that many items.
Bread : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Bread : You can't carry that many items.
Kit : You can't carry that many items.
Scroll : You can't carry that many items.
Platter : You can't carry that many items.
Waterskin : You can't carry that many items.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
