<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Taking out the trash.

POV: Ruth

Log Rating: 1.2000

A little cleaner. Turt dies trying to be sneaky. Sarah and Aneyo try
poof tactics, but pay the price

Matrim smirks.
395H 20V 2174048X 2636C Mem:3> t aneyo come
You tell Aneyo 'come'
395H 20V 2174048X 2636C Mem:3>
Matrim says 'should we kill the guards now?'
395H 20V 2174048X 2636C Mem:3> t aneyo bring it bitch
You tell Aneyo 'bring it bitch'
395H 20V 2174048X 2636C Mem:3> gt nah
You tell your group 'nah'
395H 20V 2174048X 2636C Mem:3>
Sarah appears before you in a puff of smoke.
An insane cityguard tries to sweep Sarah's legs, but misses badly.
An insane cityguard tries to kick Sarah but misses and destroys an
image.
An insane cityguard tries to kick Sarah but misses and destroys an
image.
Sarah steps aside as an insane cityguard attempts a bash, stumbles, and
falls flat on his face.
395H 20V 2174048X 2636C Mem:3>
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
Sarah bludgeons an insane cityguard extremely hard.
395H 20V 2174048X 2636C Mem:3>
Sarah bludgeons an insane cityguard extremely hard.
395H 20V 2174048X 2636C Mem:3>
Aneyo tells you 'wehre?'
395H 20V 2174048X 2636C Mem:3>
Matrim slowly fades into existence.
Matrim comes out of hiding.
Matrim misses Sarah with his pierce.
395H 20V 2174048X 2636C Mem:3> k sarah
You miss Sarah and destroy an image instead.
395H 20V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Perfect]
Mem:3>
An insane cityguard delivers a vicious kick to Sarah's face. Blood
flies as her head snaps back.
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard misses Sarah with his hit.
You miss Sarah with your stab.
Matrim misses Sarah with his pierce.
Matrim pierces Sarah extremely hard.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
395H 42V 2174048X 2636C [an insane cityguard:Good] [Sarah:V.Good]
Mem:3> aven head
Sarah grabs a glowing scroll of recall.
Sarah recites a glowing scroll of recall.
Sarah grabs a glowing scroll of recall.
Sarah recites a glowing scroll of recall.
395H 42V 2174048X 2636C [an insane cityguard:Good] [Sarah:V.Good]
Mem:3>
An insane cityguard crashes into Sarah in a thundering collision,
knocking her to the ground!
395H 42V 2174048X 2636C [an insane cityguard:Good] [Sarah:V.Good]
Mem:3> You mess up the targetting and focus on the torso instead.
You focus your purity on Sarah's body!
395H 42V 2174048X 2636C [an insane cityguard:Good] [Sarah:V.Good]
Mem:3>
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard misses Sarah with his hit.
You stab Sarah extremely hard.
Matrim massacres Sarah with his pierce.
Matrim massacres Sarah with his pierce.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
Sarah bludgeons an insane cityguard very hard.
395H 42V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Fair] Mem:3>
An insane cityguard tries to sweep Sarah's legs, but misses badly.
395H 42V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Fair] Mem:3>
An insane cityguard stands up.
395H 42V 2174048X 2636C [an insane cityguard:Good] [Sarah:V.G
395H 42V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Fair] Mem:3>
str
An insane cityguard spins and tries to kick Sarah, but Sarah dodges out
of the way.
395H 42V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Fair] Mem:3>
Matrim attempts to unbalance Sarah, but she quickly avoids him.
395H 42V 2174048X 2636C [an insane cityguard:Fair] [Sarah:Fair] Mem:3>
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard barely hits Sarah.
You stab Sarah extremely hard.
Matrim massacres Sarah with his pierce.
Matrim massacres Sarah with his pierce.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
Sarah bludgeons an insane cityguard hard.
You attempt to strike at Sarah with your partisan.
You miss Sarah with your stab.
395H 42V 2174048X 2636C [an insane cityguard:Bad] [Sarah:Bad] Mem:3>
avenleg
An insane cityguard tries to sweep Sarah's legs, but misses badly.
Matrim attempts to unbalance Sarah, but she quickly avoids him.
395H 42V 2174048X 2636C [an insane cityguard:Bad] [Sarah:Bad] Mem:3>
aven leg
An insane cityguard tries to sweep Sarah's legs, but misses badly.
395H 42V 2174048X 2636C [an insane cityguard:Bad] [Sarah:Bad] Mem:3>
An insane cityguard spins and tries to kick Sarah, but Sarah dodges out
of the way.
An insane cityguard staggers about confused!
395H 42V 2174048X 2636C [an insane cityguard:Bad] [Sarah:Bad] Mem:3>
An insane cityguard spins and tries to kick Sarah, but Sarah dodges out
of the way.
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard hits Sarah hard.
You miss Sarah with your stab.
Matrim massacres Sarah with his pierce.
Matrim massacres Sarah with his pierce.
An insane cityguard hits Sarah.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
Sarah bludgeons an insane cityguard very hard.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3> Give your self a chance to recover.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3> Give your self a chance to recover.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3>
An insane cityguard tries to sweep Sarah's legs, but misses badly.
Sarah stands up.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3> str
You strike at Sarah, but miss her completely.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3>
Matrim attempts to unbalance Sarah, but she quickly avoids him.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3>395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3>
Sarah utters some strange words.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:V.Bad]
Mem:3>
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard staggers about confused!
An insane cityguard misses Sarah with his hit.
You miss Sarah with your stab.
Matrim misses Sarah with his pierce.
Matrim pierces Sarah extremely hard.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
An insane cityguard misses Sarah with his hit.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3> str
An insane cityguard tries to sweep Sarah's legs, but misses badly.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3>
An insane cityguard delivers a vicious kick to Sarah's face. Blood
flies as her head snaps back.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3>
An insane cityguard delivers a vicious kick to Sarah's face. Blood
flies as her head snaps back.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3> You strike at Sarah, but miss her completely.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3> str
Matrim attempts to unbalance Sarah, but she quickly avoids him.
395H 42V 2174048X 2636C [an insane cityguard:V.Bad] [Sarah:Awful]
Mem:3>
An insane cityguard staggers about confused! An insane cityguard
staggers about confused!
An insane cityguard misses Sarah with his hit.
You stab Sarah hard.
Matrim massacres Sarah with his pierce.
Matrim pierces Sarah extremely hard.
Sarah is mortally wounded, and will die soon, if not aided.
An insane cityguard hits Sarah hard.
You receive 0 experience.
Sarah is dead! R.I.P.
The death cry of Sarah echoes from somewhere nearby...
395H 42V 2174048X 2636C Mem:3>
An insane cityguard tries to sweep Matrim's legs, but misses badly.
395H 42V 2174048X 2636C Mem:3> gac
An insane cityguard tries to sweep Matrim's legs, but misses badly.
395H 42V 2174048X 2636C Mem:3> You couldn't find what you were looking
for.
395H 42V 2174048X 2636C Mem:3> Matrim gets a very large pile of coins
from the corpse of Sarah.
You get an ornately carved staff from the corpse of Sarah.
You get a runed bracelet from the corpse of Sarah.
You get a plain component pouch from the corpse of Sarah.
You get a thick silver robe from the corpse of Sarah.
You get a purple silk dress from the corpse of Sarah.
You get a small quartz ring from the corpse of Sarah.
You get a steel chainmail shirt from the corpse of Sarah.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
An insane cityguard staggers about confused!
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
Apple : You can't carry that much weight.
You get a grimy bone carved die from the corpse of Sarah.
Sack : You can't carry that many items.
Canteen : You can't carry that many items.
Robe : You can't carry that many items.
Waterskin : You can't carry that many items.
Waterskin : You can't carry that many items.
Crystal : You can't carry that many items.
Crystal : You can't carry that many items.
Dagger : You can't carry that many items.
Beads : You can't carry that many items.
Crystal : You can't carry that many items.
395H 42V 2174048X 2636C Mem:3>
Matrim steps aside as an insane cityguard attempts a bash, stumbles,
and falls flat on his face.
Matrim gets a shiny red apple from the corpse of Sarah.
Matrim gets a shiny red apple from the corpse of Sarah.
Matrim gets a shiny red apple from the corpse of Sarah.
Matrim gets a shiny red apple from the corpse of Sarah.
Matrim gets a shiny red apple from the corpse of Sarah.
Matrim gets a shoulder sack from the corpse of Sarah.
Matrim gets a small canteen from the corpse of Sarah.
Matrim gets a long grey robe from the corpse of Sarah.
Matrim gets a waterskin from the corpse of Sarah.
Matrim gets a waterskin from the corpse of Sarah.
Matrim gets a crystal shard necklace from the corpse of Sarah.
Matrim gets a crystal shard necklace from the corpse of Sarah.
Matrim gets a blue hilted dagger from the corpse of Sarah.
Matrim gets a string of illusionist's beads from the corpse of Sarah.
Matrim gets a crystal shard necklace from the corpse of Sarah.
395H 64V 2172880X 2636C Mem:2>
A glowing portal opens in front of you, and Aneyo steps from it.
395H 64V 2172880X 2636C Mem:2>
Matrim slowly fades into existence.
Matrim comes out of hiding.
Matrim gives his fang a quick thrust and twist, as he strikes Aneyo in
the back with it.
395H 64V 2172880X 2636C Mem:2> k aneyo
You stab Aneyo extremely hard.
395H 64V 2172880X 2636C [Matrim:Perfect] [Aneyo:V.Bad] Mem:2>
You stab Aneyo extremely hard.
Matrim massacres Aneyo with his pierce.
Matrim pierces Aneyo extremely hard.
Aneyo misses Matrim with her drain.
Their opponent, making them recoil momentarily in horror.
395H 64V 2172880X 2636C [Matrim:Perfect] [Aneyo:Awful] Mem:2>
Aneyo focuses harshly on Matrim and utters some strange words.
395H 64V 2172880X 2636C [Matrim:Perfect] [Aneyo:Awful] Mem:2>
A pech stops following Aneyo. You stab Aneyo very hard.
Aneyo is stunned, but will likely regain consciousness again.
Matrim obliterates Aneyo with his pierce.
You receive 0 experience. Aneyo is dead! R.I.P.
The death cry of Aneyo echoes from somewhere nearby...
395H 64V 2172880X 2636C Mem:2>
Matrim gets a large pile of coins from the corpse of Aneyo.
395H 64V 2172880X 2636C Mem:2> gac
Tome : You can't carry that many items.
Rod : You can't carry that many items.
Robe : You can't carry that many items.
Shield : You can't carry that many items.
Charm : You can't carry that many items.
Necklace : You can't carry that many items.
Pear : You can't carry that many items.
Pear : You can't carry that many items.
Sinew : You can't carry that many items.
395H 64V 2172880X 2636C Mem:2> o horse get all corpse
a white pegasus gets a rotted academic tome from the corpse of Aneyo.
a white pegasus gets the rod of terror from the corpse of Aneyo.
A white pegasus is zapped by a black witch's robe and instantly drops
it.
a white pegasus gets a leather shield with metal straps from the corpse
of Aneyo.
a white pegasus gets a lucky bone charm from the corpse of Aneyo.
a white pegasus gets a necklace made of finger bones from the corpse of
Aneyo.
a white pegasus gets a golden pear from the corpse of Aneyo.
a white pegasus gets a golden pear from the corpse of Aneyo.
a white pegasus gets cured ape sinew from the corpse of Aneyo. 95H 130V
2172880X 2636C >
** ****** ****
** *** ***** **
** ** * *** *
* ** ** * * * **
* ** * * * *
* * ** * * *
* * ** * * ****** *
* * * ** *** * * *
* * * ********** *** *
***** * * * * *
* * *
* * * *
* * ** *
* ** * *
* * *
* * **
** ****
*** * * ****
********** ** * ** * *********
_____ ___ ___ __ __
| ___/ _ / _ | / |
| |_ | | | | | | | |/| |
| _|| |_| | |_| | | | |
|_| ___/ ___/|_| |_|
The mud has crashed. Please try again later.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
