#[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

Login
Username: __________
Password: __________
Login
[4]Forgot your password?
[5]Register for a Login
Mud Logs
[6]Recent Logs
[7]Older Logs
[8]Newer Logs
[9]Top Rated Logs
[10]Most Viewed Logs
[11]Upload A Log
[12]Log Collections
[13]Log Quicklist
Mud Links
[14]Vote for Arctic
on Top Mud Sites
[15]Vote for Arctic
on Mud Connect
[16]ArcticMud Blog
[17]RGB Mud Log Page
[18]Xanitha's Mud Log Page (not current)
[19]Oligo's Logs (not current)
[20]Arctic Mud Forums
[21]Arctic Mud Homepage

Which zone do you hate the MOST?

(*) Silvanesti
( ) Deepmines
( ) Caverns of Thorbardin
( ) Dun Mir
( ) Mithas
( ) Ravenshadow
( ) Castle Uth Wistan
Vote Results

[22]Submit a Poll
[23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

Trash fight
[26]View Comments (4)

POV: Namtara

Log Rating: 0.0000

They were all trash, but a fights a fight i guess

324H 182V 3791216X 65.00% 4957C Exits:ESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Whosh, There it is is standing here. (flying)
Togachee the Male Hill Dwarf is standing here. (flying)
Barlon the Male Half Elf is standing here. (flying)
Efisio the Male Hill Dwarf is standing here.
Viddic, Dancing Master, Killing for the Win is standing here.
Looking south:
You see nothing special.
An apprentice mage is here watching the store for his master.
Looking west:
You see nothing special.
Paiko the Male Minotaur is standing here. (flying) (invisible)
<VA> Jonny Boy, Way Cooler Than Rafo is standing here. (flying)
(invisible)
<VA> Yovin the Male Goblin is standing here. (flying) (invisible)
<VA> Alva the Female Silvanesti is standing here. (flying) (invisible)
. . . focusing intently.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
324H 182V 3791216X 65.00% 4957C Exits:ESW> w
A troll arrives from the east.
A young adventurer arrives from the east.
A young adventurer arrives from the east.
A young adventurer arrives from the east.
Intersection: Sword Street and Southwestern Avenue
A young adventurer newly arrived in town is looking for the tavern.
A young adventurer newly arrived in town is looking for the tavern.
A young adventurer newly arrived in town is looking for the tavern.
A troll stands here grinning broadly.
Paiko the Male Minotaur is standing here. (flying) (invisible)
<VA> Jonny Boy, Way Cooler Than Rafo is standing here. (flying)
(invisible)
<VA> Yovin the Male Goblin is standing here. (flying) (invisible)
<VA> Alva the Female Silvanesti is standing here. (flying) (invisible)
. . . focusing intently.
324H 181V 3791216X 65.00% 4957C Exits:NESW> #TICK+10
ee;
Alva utters some strange words.
A bright light flashes and Alva begins to shine from within.
324H 181V 3791216X 65.00% 4957C Exits:NESW> ee;o troll bash
Viddic arrives from the east.
Efisio arrives from the east.
Barlon flies in from the east.
Togachee flies in from the east.
Whosh flies in from the east.
324H 181V 3791216X 65.00% 4957C Exits:NESW> ee;o troll bash
You step aside as Viddic tries to bash you, causing him to tumble and
fall face down.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Perfect]
Exits:NESW>
You step aside as Barlon tries to bash you, causing him to tumble and
fall face down.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Perfect]
Exits:NESW>
Barlon misses you with his slash.
Viddic misses you with his slash.
You hit Viddic.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:V.Good]
Exits:NESW>
Yovin takes AIM at Viddic.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:V.Good]
Exits:NESW>
Yovin annihilates Viddic with a plunk.
Yovin slowly fades into existence.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:V.Good]
Exits:NESW>
Paiko slowly fades into existence.
Paiko crashes into Viddic in a thundering collision, knocking him to
the ground!
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Good] Exits:NESW>
j wh
A Palanthian guard arrives from the west.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Good] Exits:NESW>
j whosh
Whosh steps aside as a young
adventurer attempts a bash, stumbles, and falls flat on his face.
A young adventurer crashes into Whosh in a thundering collision,
knocking him to the ground!
Whosh steps aside as a young adventurer attempts a bash, stumbles, and
falls flat on his face.
You issue the order 'bash whosh'.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Good] Exits:NESW>
Yovin misses Viddic with his shot.
Yovin comes out of hiding.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Good] Exits:NESW>
Jonny slowly fades into existence.
Jonny massacres Whosh with his slash.
324H 181V 3791216X 65.00% 4957C [Me:Perfect] [Viddic:Good] Exits:NESW>
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Jonny massacres Whosh with his slash.
A young adventurer hits Whosh very hard.
A young adventurer misses Whosh with his hit.
A young adventurer misses Whosh with his hit.
Whosh misses a young adventurer with his hit.
Paiko massacres Viddic with his drain.
Barlon slashes YOU very hard.
Viddic barely slashes YOU.
You miss Viddic with your hit.
308H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Good] Exits:NESW> h
viddic
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
308H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Good] Exits:NESW>
Viddic steps aside as a troll
attempts a bash, stumbles, and falls flat on its face.
308H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Good] Exits:NESW> c
'power'
Barlon stands up.
308H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Good] Exits:NESW> c
'power'
Your casting is disrupted by
the fighting!
308H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Good] Mem:2
Exits:NESW>
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
You are sent sprawling as Barlon crashes into you.
297H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Fair] Mem:2
Exits:NESW> !
Jonny focuses his purity on Whosh's leg!
Jonny forces Whosh to the ground.
297H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Fair] Mem:2
Exits:NESW>
Togachee utters some strange words.
The air swirls and a funnel cloud forms.
297H 181V 3791216X 65.00% 4957C [Me:V.Good] [Viddic:Fair] Mem:2
Exits:NESW>
A small whirlwind crashes into Paiko, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
A small whirlwind crashes into Alva, pummeling her entire body.
Alva slowly fades into existence.
Alva smites Togachee hard.
Togachee misses Paiko with his hit.
A troll misses Viddic with its slash.
Jonny massacres Whosh with his slash.
A young adventurer hits Whosh hard.
A young adventurer hits Whosh hard.
A young adventurer misses Whosh with his hit.
Whosh misses a young adventurer with his hit.
Paiko annihilates Viddic with his drain.
Barlon slashes YOU very hard.
Viddic slashes YOU hard.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW>
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW>
Paiko crashes into Viddic in a thundering collision, knocking him to
the ground!
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW>
Alva utters some strange words.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW>
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW> st
c 'p
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin annihilates Whosh with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin annihilates Togachee with a plunk.
Yovin massacres Barlon with a plunk.
Jonny attempts to strike at Whosh with his halberd.
Jonny misses Whosh with his slash.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW> c 'pow
Togachee focuses harshly on Paiko and utters some strange words.
Flesh burns as Togachee enshrouds Paiko in a cloak of flames.
274H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:Fair] Mem:2
Exits:NESW> c 'power'
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into you, pummeling your entire body.
A small whirlwind crashes into Jonny, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
A small whirlwind crashes into Alva, pummeling her entire body.
Jonny deftly steps in front of Yovin, pushing into the frey.
Jonny heroically rescues Yovin.
A Palanthian guard hits Jonny hard.
A Palanthian guard hits Jonny extremely hard.
Jonny massacres a Palanthian guard with his slash.
A troll slashes Viddic extremely hard.
A troll massacres Viddic with its slash.
A young adventurer hits Whosh extremely hard.
A young adventurer hits Whosh extremely hard.
A young adventurer hits Whosh very hard.
Whosh misses a young adventurer with his hit.
Paiko annihilates Viddic with his drain.
Barlon misses you with his slash.
Viddic misses you with his slash.
You miss Viddic with your hit.
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW> c 'power'
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin annihilates Whosh with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW>
Jonny steps aside as a Palanthian guard attempts a bash, stumbles, and
falls flat on his face.
Alva utters the words, 'gust of wind'.
A sudden wind rushes by you.
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW>
A troll stands up.
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin annihilates Whosh with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW> You can't do this
sitting!
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW> You stand up.
246H 181V 3791216X 65.00% 4957C [Me:Good] [Viddic:V.Bad] Mem:2
Exits:NESW>
You are sent sprawling as Barlon crashes into you.
235H 181V 3791216X 65.00% 4957C [Me:Fair] [Viddic:V.Bad] Mem:2
Exits:NESW>
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Whosh with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into Paiko, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
The surging winds seem to be absorbed by the twirling funel cloud.
A Palanthian guard hits Jonny extremely hard.
Jonny blocks a Palanthian guard's blow with a quick raise of his
shield.
Jonny massacres a Palanthian guard with his slash.
Togachee misses Paiko with his hit.
A troll massacres Viddic with its slash.
A young adventurer hits Whosh extremely hard.
A young adventurer hits Whosh extremely hard.
Whosh is mortally wounded, and will die soon, if not aided.
A young adventurer's powerful hit makes Whosh double over in pain.
A young adventurer annihilates Whosh with his hit.
Whosh is dead! R.I.P.
Paiko annihilates Viddic with his drain.
Barlon slashes YOU hard.
Viddic misses you with his slash.
The death cry of Whosh echoes from somewhere nearby...
Whosh stops following Viddic.
Togachee utters some strange words.
The air swirls and a funnel cloud forms.
225H 181V 3791216X 65.00% 4957C [Me:Fair] [Viddic:V.Bad] Mem:2
Exits:NESW>
Yovin gets a very large pile of coins from the corpse of Whosh.
225H 181V 3791216X 65.00% 4957C [Me:Fair] [Viddic:V.Bad] Mem:2
Exits:NESW>
Yovin divides 2100 coins equally among the group members present.
225H 181V 3791216X 65.00% 5377C [Me:Fair] [Viddic:V.Bad] Mem:2
Exits:NESW> s
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
Yovin massacres Efisio with a plunk.
225H 181V 3791216X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> st
Jonny yells and leaps into the fray.
You fight with much greater power.
225H 181V 3791216X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> c 'po
A pigeon arrives from the north.
A Palanthian guard stands up.
With a grin a troll lands a punch on Viddic.
Alva utters some strange words.
Alva heals Alva.
225H 181V 3791216X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> c 'power'
Yovin massacres Viddic with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a pigeon with a plunk.
You receive 3 experience.
A pigeon is dead! R.I.P.
Yovin massacres a Palanthian guard with a plunk.
Yovin annihilates Togachee with a plunk.
Yovin massacres Barlon with a plunk.
The death cry of a pigeon echoes from somewhere nearby...
225H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> c 'power'
Yovin gets a small pile of coins from the corpse of a pigeon.
225H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> c 'power'
A Palanthian guard gives Jonny a solid punch in the face.
Yovin deftly ducks out of the way of the attack.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into Paiko, pummeling his entire body.
Jonny deftly steps in front of Yovin, pushing into the frey.
Jonny heroically rescues Yovin.
Efisio misses Jonny with his hit.
Jonny slashes Efisio extremely hard.
A young adventurer hits Togachee hard.
A Palanthian guard hits Jonny extremely hard.
A Palanthian guard misses Jonny with his hit.
A troll massacres Viddic with its slash.
Paiko annihilates Viddic with his drain.
Barlon slashes YOU very hard.
Viddic slashes YOU.
You miss Viddic with your hit.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
Togachee utters some strange words.
The air swirls and a funnel cloud forms.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
A troll gives Viddic a solid punch in the face.
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
Yovin annihilates Efisio with a plunk.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
Your clanmate Xuna has entered the game.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
Viddic stands up.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
You step aside as Viddic tries to bash you, causing him to tumble and
fall face down.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW>
Yovin misses Viddic with his shot.
Yovin slowly fades into existence.
Yovin comes out of hiding.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
Yovin annihilates Efisio with a plunk.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Viddic:Awful] Mem:2
Exits:NESW> Yovin massacres Viddic
with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
You receive 0 experience.
Viddic is dead! R.I.P.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Togachee with a plunk.
Yovin massacres Barlon with a plunk.
Yovin massacres Efisio with a plunk.
Yovin slowly fades into existence.
Yovin comes out of hiding.
The death cry of Viddic echoes from somewhere nearby...
Efisio stops following Viddic.
Viddic now follows Efisio.
Efisio is the new leader of Viddic's group.
Viddic stops following Efisio.
Barlon stops following Viddic.
Barlon now follows Efisio.
Togachee stops following Viddic.
Togachee now follows Efisio.
You direct your attention to Barlon.
You can't do this sitting!
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Barlon:V.Bad] Mem:2
Exits:NESW> You stand up.
207H 181V 3791213X 65.00% 5377C [Me:Fair] [Barlon:V.Bad] Mem:2
Exits:NESW> A small whirlwind crashes
into you, pummeling your entire body.
A small whirlwind crashes into Yovin, pummeling his entire body.
A small whirlwind crashes into Alva, pummeling her entire body.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A young adventurer attempts to scream, but no sound is produced as he
is caught
up in a tornado and torn to shreds.
A young adventurer is dead! R.I.P.
A small whirlwind crashes into you, pummeling your entire body.
That Really did HURT!
A small whirlwind crashes into Jonny, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
The violent funnel dissipates.
A young adventurer misses Togachee with his hit.
Paiko annihilates Togachee with his drain.
You receive 0 experience.
Togachee is dead! R.I.P.
Efisio misses Jonny with his hit.
Jonny massacres Efisio with his slash.
A Palanthian guard hits Jonny extremely hard.
A Palanthian guard misses Jonny with his hit.
Barlon slashes YOU.
The death cry of Togachee echoes from somewhere nearby...
Togachee stops following Efisio.
The death cry of a young adventurer echoes from somewhere nearby...
A young adventurer stops following you.
You get a small pile of coins from the corpse of a young adventurer.
There were 4 coins.
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW> You step aside as Barlon
tries to bash you, causing him to tumble and fall face down.
It's a pretty ghastly sight! Searching through the remains, you find:
corpse (here) :
a bronze shield
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW> You utter the words,
'power word stun'
A Palanthian guard is stunned!
Barlon is stunned momentarily, recovering quickly.
Efisio is stunned momentarily, recovering quickly.
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW>
Xuna tells your clan 'what up'
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW>
Jonny gets a bronze shield from the corpse of a young adventurer.
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW> c
Jonny attempts to strike at Efisio with his halberd.
Jonny slashes Efisio extremely hard.
81H 181V 3791213X 65.00% 5381C [Me:V.Bad] [Barlon:V.Bad] Mem:2
Exits:NESW> c 'm
Alva focuses on you and utters some strange words.
Your entire body tingles for a few seconds.
321H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> c 'mal'
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into a troll, pummeling its entire body.
A small whirlwind crashes into Paiko, pummeling his entire body.
A small whirlwind crashes into Jonny, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
Yovin deftly ducks out of the way of the attack.
Efisio misses Jonny with his hit.
Jonny massacres Efisio with his slash.
Barlon slashes YOU hard.
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> The corpse doesn't seem
to have what you are looking for.
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> It's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> The corpse doesn't seem
to have what you are looking for.
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> It's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> You'll have to split
more than that, tightwad.
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:2
Exits:NESW> Your casting is
disrupted by the fighting!
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:3
Exits:NESW>
Jonny attempts to strike at Efisio with his halberd.
Jonny slashes Efisio extremely hard.
314H 181V 3791213X 65.00% 5381C [Me:V.Good] [Barlon:V.Bad] Mem:3
Exits:NESW> !
You utter the words,
'malevolent tentacles'
You conjure a writhing mass of inky black tentacles!
A Palanthian guard screams in pain as inky black tentacles constrict
him.
Barlon screams in pain as inky black tentacles constrict him.
Efisio screams in pain as inky black tentacles constrict him.
314H 181V 3790512X 65.00% 5381C [Me:V.Good] [Barlon:Awful] Mem:3
Exits:NESW>
Alva utters some strange words.
314H 181V 3790512X 65.00% 5381C [Me:V.Good] [Barlon:Awful] Mem:3
Exits:NESW>
Yovin takes AIM at Efisio.
314H 181V 3790512X 65.00% 5381C [Me:V.Good] [Barlon:Awful] Mem:3
Exits:NESW>
Yovin massacres Efisio with a plunk.
Yovin slowly fades into existence.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Barlon with a plunk.
Yovin annihilates Efisio with a plunk.
Yovin massacres a young adventurer with a plunk.
314H 181V 3790512X 65.00% 5381C [Me:V.Good] [Barlon:Awful] Mem:3
Exits:NESW>
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into a young adventurer, pummeling his entire
body.
A small whirlwind crashes into a troll, pummeling its entire body.
A small whirlwind crashes into Paiko, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
A small whirlwind crashes into Alva, pummeling her entire body.
A young adventurer attempts to scream, but no sound is produced as he
is caught
up in a tornado and torn to shreds.
A young adventurer is dead! R.I.P.
A small whirlwind crashes into you, pummeling your entire body.
That Really did HURT!
Yovin deftly ducks out of the way of the attack.
A small whirlwind crashes into Alva, pummeling her entire body.
A Palanthian guard screams in pain as inky black tentacles constrict
him.
Efisio misses Jonny with his hit.
Jonny massacres Efisio with his slash.
Barlon slashes YOU hard.
The death cry of a young adventurer echoes from somewhere nearby...
A young adventurer stops following you.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
Barlon steps aside as Paiko attempts a bash, stumbles, and falls flat
on his face.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
Yovin annihilates Efisio with a plunk.
Yovin massacres a Palanthian guard with a plunk.
Yovin massacres Barlon with a plunk.
Yovin massacres Efisio with a plunk.
You receive 0 experience.
Efisio is dead! R.I.P.
Yovin massacres a young adventurer with a plunk.
The death cry of Efisio echoes from somewhere nearby...
Barlon stops following Efisio.
Barlon stands up.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
Barlon says 'hehe'
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
You step aside as Barlon tries to bash you, causing him to tumble and
fall face down.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
Jonny attempts to strike at a Palanthian guard with his halberd.
Jonny massacres a Palanthian guard with his slash.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW> sayThe corpse doesn't seem
to have what you are looking for.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW> say It's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :
a magical potato..it glows blue [17]
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW> say DIE
Viddic arrives from the east.
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW> say DIE
You step aside as Viddic
tries to bash you, causing him to tumble and fall face down.
You say 'DIE'
236H 181V 3790512X 65.00% 5381C [Me:Fair] [Barlon:Awful] Mem:3
Exits:NESW>
A small whirlwind crashes into a Palanthian guard, pummeling his entire
body.
A small whirlwind crashes into a troll, pummeling its entire body.
A small whirlwind crashes into you, pummeling your entire body.
That Really did HURT!
A small whirlwind crashes into Paiko, pummeling his entire body.
A small whirlwind crashes into Jonny, pummeling his entire body.
Yovin deftly ducks out of the way of the attack.
The violent funnel dissipates.
Viddic misses you with his hit.
Jonny annihilates a Palanthian guard with his slash.
A young adventurer hits Yovin.
Paiko annihilates Barlon with his drain.
You miss Barlon with your hit.
Barlon slashes YOU very hard.
136H 181V 3790512X 65.00% 5381C [Me:Bad] [Barlon:Awful] Mem:3
Exits:NESW> #TICK-10
lb
You utter the words,
'lightning bolt'
Your lightning bolt shatters Barlon to pieces.
You receive 0 experience.
Barlon is dead! R.I.P.
136H 181V 3790512X 65.00% 5381C [Me:Bad] [Barlon:Dying] Mem:3
Exits:NESW>
The death cry of Barlon echoes from somewhere nearby...
You direct your attention to Viddic.
136H 181V 3790512X 65.00% 5381C [Me:Bad] [Viddic:Awful] Mem:3
Exits:NESW>
Yovin gets a pile of coins from the corpse of Barlon.
136H 181V 3790512X 65.00% 5381C [Me:Bad] [Viddic:Awful] Mem:3
Exits:NESW>
Yovin divides 15 coins equally among the group members present.
136H 181V 3790512X 65.00% 5384C [Me:Bad] [Viddic:Awful] Mem:3
Exits:NESW>
Alva focuses on you and utters some strange words.
Your entire body tingles for a few seconds.
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW> lb
Yovin flies in from the east.
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW>
The violent funnel dissipates.
You miss Viddic with your hit.
Viddic misses you with his hit.
Jonny massacres a Palanthian guard with his slash.
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW>
Alec tells you 'deal?'
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW> The corpse doesn't seem
to have what you are looking for.
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW> It's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :
a longsword
a bronze shield
323H 181V 3790512X 65.00% 5384C [Me:V.Good] [Viddic:Awful] Mem:3
Exits:NESW> Jonny attempts to
strike at a Palanthian guard with his halberd.
Jonny massacres a Palanthian guard with his slash.
You utter the words, 'lightning bolt'
Your lightning bolt shatters Viddic to pieces.
You receive 0 experience.
Viddic is dead! R.I.P.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. http://arctic.elay.org/rss.xml
2. http://www.topmudsites.com/vote-just.html
3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
4. file:///index.php?option=forgot
5. file:///index.php?option=register
6. file:///index.php?option=recentlogs
7. file:///index.php?option=recentlogs&lognbr=10
8. file:///index.php?option=recentlogs&lognbr=0
9. file:///index.php?option=toplogs
10. file:///index.php?option=mostviewedlogs
11. file:///index.php?option=uploadlog
12. file:///index.php?option=collections
13. file:///index.php?option=quicklist
14. http://www.topmudsites.com/vote-just.html
15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
16. http://arcticmud.blogspot.com/
17. http://pollux.ldz.lv/~punk/upload/index.php
18. http://mudlogs.foghaven.net/
19. http://normstorm.com/template/m-news.html
20. http://mud.arctic.org/forum/
21. http://mud.arctic.org/
22. file:///index.php?option=poll&action=new
23. file:///index.php?option=poll&action=listpolls
24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
25. http://twitter.com/arcticelayorg
26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2757.html?option=forums&action=displaythread&threadid=2757
