<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

We won this one

POV: Veovis

Log Rating: -1.1667

(John): First fight we lost because we faced some bad odds. I just
wanted to fight anyhow. This fight we smoked em hard!

579H 176V 9566930X 500C Exits:EW>
Crispen flies west.
You follow Crispen west.
A fearsome blue dragon arrives from the east.
Lafour flies in from the east.
Ryala flies in from the east.
A gargoyle flies in from the east.
A gargoyle kneels down and studies the ground.
A gargoyle points at Sharpe.
A gargoyle says 'There they are!'
Enubis flies in from the east.
Feroz flies in from the east.
Crossing the Plains
Winding its way across the windy and fertile Solamnic plains, the
highway stretches far to the west and to the east. Merchants slowly
make
their way across the plains supplying the cities of Solamnia with goods
from the other corners of the world. Endless plains surround the
highway,
almost engulfing it with wheat, corn, other tall plants and weeds. The
wind
brings a light chill to the air and the smell of fire.
<BSP> Feroz, The Fierce is standing here. (flying) (invisible) (red
aura)
<BSP> Enubis the Male Minotaur is standing here. (flying) (invisible)
A gargoyle is standing here.
<BSP> Ryala Avianus is standing here. (flying) (invisible) (white aura)
<BSP> Lafour, The Dodgeball Master is standing here. (flying)
(invisible) (red
aura)
A feaoo;kill lorkersome blue dragon is standing here, paying you no
attention. (invisible)
(red aura)
<BSP> Crispen Ash, Burning Flames of the Blood Sea is standing here.
(flying)
(invisible) (red aura)
. . . is enveloped in flames.
<Apoc> Lorke the Male Theiwar Dwarf is standing here. (flying) (red
aura)
. . . is outlined with a dim aura.
<SLRD> Sharpe, Golden Sunchild is standing here. (flying) (red aura)
. . . has a metallic luster.
579H 174V 9566930X 500C Exits:EW> oo;kill lorke
Crispen flies west.
You follow Crispen west.
A fearsome blue dragon arrives from the east.
Lafour flies in from the east.
Ryala flies in from the east.
A gargoyle flies in from the east.
Enubis flies in from the east.
Feroz flies in from the east.
Crossing the Plains
The worn cobblestones that make up this portion of the main highway
out
of Port o'Call stretches to the north and to the east here. The
unmolested
plains of strong sinewy moor grass that are native to this part of
Ansalon
surround the road here. Several detachments of Solamnic Knights patrol
this
portion of the highway protecting the steady flow of travelers and
merchant
caravans.
<BSP> Feroz, The Fierce is standing here. (flying) (invisible) (red
aura)
<BSP> Enubis the Male Minotaur is standing here. (flying) (invisible)
A gargoyle is standing here.
<BSP> Ryala Avianus is standing here. (flying) (invisible) (white aura)
<BSP> Lafour, The Dodgeball Master is standing here. (flying)
(invisible) (red
aura)
A fearsome blue dragon is standing here, paying you no attention.
(invisible)
(red aura)
<BSP> Crispen Ash, Burning Flames of the Blood Sea is standing here.
(flying)
(invisible) (red aura)
. . . is surrounded by 4 duplicate images.
579H 172V 9566930X 500C Exits:EW> oo;kill lorke
Attempting to defy gravity, Ryala begins to flap her arms near Ryala.
Ryala appears rejuvenated.
579H 172V 9566930X 500C Exits:EW> oo;kill lorke
Sharpe flies in from the east.
Lorke flies in from the east.
579H 172V 9566930X 500C Exits:EW> oo;kill lorke
Sharpe flies west.
Lorke flies west.
579H 172V 9566930X 500C Exits:EW> oo;kill lorke
579H 172V 9566930X 500C Exits:EW> They aren't here.
579H 172V 9566930X 500C Exits:EW>
Aslim flies in from the east.
Eloc flies in from the east.
Kralum flies in from the east.
579H 172V 9566930X 500C Exits:EW>
Eloc crashes into Enubis in a thundering collision, knocking him to the
ground!
579H 172V 9566930X 500C Exits:EW>
Aslim flies west.
Kralum flies west.
579H 172V 9566930X 500C Exits:EW>
lo
579H 172V 9566930X 500C Exits:EW> looo
Sharpe flies in from the west.
Lorke flies in from the west.
579H 172V 9566930X 500C Exits:EW> loooo
Huh?!
579H 172V 9566930X 500C Exits:EW> oo
A fearsome blue dragon swoops at Eloc.
A fearsome blue dragon slowly fades into existence.
579H 172V 9566930X 500C Exits:EW>
Crispen gives a gargoyle an order.
A gargoyle delivers a quick snap kick to Sharpe. Sharpe staggers and
tries to
recover.
579H 172V 9566930X 500C Exits:EW>
Aslim flies in from the west.
Kralum flies in from the west.
579H 172V 9566930X 500C Exits:EW>
Lafour slowly fades into existence.
Lafour crashes into Sharpe in a thundering collision, knocking him to
the
ground!
579H 172V 9566930X 500C Exits:EW>
Sharpe falls back as Lafour crushes him on the head.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc.
Enubis wavers under Eloc's mighty slash!
Eloc annihilates Enubis with his slash.
Enubis slowly fades into existence.
Enubis massacres Eloc with his cleave.
579H 172V 9566930X 500C Exits:EW> kill lor
Crispen utters some strange words.
Crispen conjures a writhing mass of inky black tentacles!
Crispen slowly fades into existence.
Kralum screams in pain as inky black tentacles constrict him.
Aslim ducks out of the way of Crispen's attack.
Lorke screams in pain as inky black tentacles constrict him.
Sharpe screams in pain as inky black tentacles constrict him.
Eloc screams in pain as inky black tentacles constrict him.
Aslim suddenly lunges forward, slamming his skull into Enubis's face
with a
sickening crunch.
579H 172V 9566930X 500C Exits:EW> kill lorke
Feroz flies east.
579H 172V 9566930X 500C Exits:EW> kill lorke
You stab Lorke very hard.
579H 172V 9566930X 500C [Crispen:Perfect] [Lorke:V.Good] Exits:EW>
Ryala slowly fades into existence.
Ryala whips Lorke hard.
579H 172V 9566930X 500C [Crispen:Perfect] [Lorke:V.Good] Exits:EW>
Feroz flies in from the east.
579H 172V 9566930X 500C [Crispen:Perfect] [Lorke:V.Good] Exits:EW> g
Ryala whips Lorke hard.
Ryala cleaves Lorke hard.
You stab Lorke very hard.
You slash Lorke hard.
Aslim massacres Enubis with his cleave.
Aslim massacres Enubis with his pierce.
Lorke misses Crispen and destroys an image instead.
Crispen misses Kralum with his bludgeon.
Kralum crushes Crispen extremely hard.
Kralum is burned, as he swings at Crispen.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc very hard.
Eloc massacres Enubis with his slash.
Enubis massacres Eloc with his cleave.
579H 172V 9566930X 500C [Crispen:V.Good] [Lorke:Good] Exits:EW> ga
Lorke panics, and attempts to flee.
Lorke flies east.
579H 172V 9566930X 500C Exits:EW>
Feroz slowly fades into existence.
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
579H 172V 9566930X 500C Exits:EW> gaze
Crispen utters some strange words.
Crispen conjures a writhing mass of inky black tentacles!
Kralum screams in pain as inky black tentacles constrict him.
Aslim screams in pain as inky black tentacles constrict him.
Sharpe screams in pain as inky black tentacles constrict him.
Eloc screams in pain as inky black tentacles constrict him.
579H 172V 9566930X 500C Exits:EW>
Aslim growls.
579H 172V 9566930X 500C Exits:EW> k
Enubis stands up.
579H 172V 9566930X 500C Exits:EW> kill You couldn't find what you were
looking for.
579H 172V 9566930X 500C Exits:EW> kill sharpe
You hit the tentacles constricting Sharpe instead!
579H 172V 9566930X 500C Exits:EW>
Ryala whips Kralum extremely hard.
579H 172V 9566930X 500C Exits:EW>
Eloc stands up.
Sharpe attempts to break free of the black tentacles, but fails!
579H 172V 9566930X 500C Exits:EW>
Sharpe screams in pain as inky black tentacles constrict him.
Ryala whips Kralum very hard.
Ryala cleaves Kralum very hard.
Feroz slashes Sharpe very hard.
Aslim's mightly cleave almost cuts Enubis in two.
Aslim obliterates Enubis with his cleave.
Aslim massacres Enubis with his pierce.
Kralum massacres Crispen with his crush.
Kralum is burned, as he swings at Crispen.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe very hard.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon claws Eloc hard.
Eloc massacres Enubis with his slash.
Enubis cleaves Eloc hard.
Sharpe steps aside as Lafour attempts a bash, stumbles, and falls flat
on his
face.
Sharpe attempts to break free of the black tentacles, but fails!
579H 172V 9566930X 500C Exits:EW>
Enubis crashes into Eloc in a thundering collision, knocking him to the
ground!
579H 172V 9566930X 500C Exits:EW>
Sharpe attempts to break free of the black tentacles, but fails!
579H 172V 9566930X 500C Exits:EW>
A gargoyle delivers a vicious kick to Sharpe's face. Blood flies as his
head
snaps back.
579H 172V 9566930X 500C Exits:EW> st
Kralum tries to bash Crispen, but he passes right through his image and
falls.
579H 172V 9566930X 500C Exits:EW> kil
Crispen utters some strange words.
Crispen conjures a writhing mass of inky black tentacles!
Kralum screams in pain as inky black tentacles constrict him.
Aslim screams in pain as inky black tentacles constrict him.
Sharpe screams in pain as inky black tentacles constrict him.
Eloc screams in pain as inky black tentacles constrict him.
579H 172V 9566930X 500C Exits:EW> kill lorkeYou are already standing.
579H 172V 9566930X 500C Exits:EW> kill lorke
Aslim screams in pain as inky black tentacles
constrict him.
Ryala massacres Kralum with her whip.
Ryala cleaves Kralum very hard.
Feroz slashes Sharpe extremely hard.
Kralum misses Crispen and destroys an image instead.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon misses Eloc with his claw.
Eloc massacres Enubis with his slash.
Enubis massacres Eloc with his cleave.
They aren't here.
579H 172V 9566930X 500C Exits:EW>
Feroz looks at Aslim.
579H 172V 9566930X 500C Exits:EW> kil
Lorke flies in from the east.
A gargoyle delivers a vicious kick to Sharpe's face. Blood flies as his
head
snaps back.
579H 172V 9566930X 500C Exits:EW> kill
Lorke focuses on Sharpe and utters some strange words.
Lorke heals Sharpe.
579H 172V 9566930X 500C Exits:EW> kill eloc
You massacre Eloc with your stab.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Good] Exits:EW> ga
Feroz stands up.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Good] Exits:EW> gaze
Crispen focuses on Feroz and utters some strange words.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Good] Exits:EW> gaze
Aslim screams in pain as inky black tentacles constrict him.
You stab Eloc extremely hard.
You slash Eloc very hard.
Ryala massacres Kralum with her whip.
Ryala cleaves Kralum extremely hard.
Feroz slashes Sharpe extremely hard.
Kralum misses Crispen and destroys an image instead.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe extremely hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc hard.
Eloc slashes Enubis extremely hard.
Enubis massacres Eloc with his cleave.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Fair] Exits:EW>
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Fair] Exits:EW>
Lafour stands up.
Eloc stands up.
579H 172V 9566930X 500C [Enubis:Bad] [Eloc:Fair] Exits:EW>
Sharpe steps aside as Lafour attempts a bash, stumbles, and falls flat
on his
face.
Enubis panics, and attempts to flee.
Enubis flies east.
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
Lorke flies west.
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
A fearsome blue dragon steps aside as Eloc attempts a bash, stumbles,
and falls
flat on his face.
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW> You gaze at
Eloc with all the evilness you can muster.
Kralum stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
Aslim attempts to break free of the black tentacles, but fails!
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
Crispen focuses on Lafour and utters some strange words.
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
Aslim attempts to break free of the black tentacles, but fails!
579H 172V 9566930X 500C [a fearsome blue dragon:Perfect] [Eloc:Fair]
Exits:EW>
Eloc slashes a fearsome blue dragon extremely hard.
You massacre Eloc with your stab.
You slash Eloc hard.
Ryala whips Kralum extremely hard.
Ryala cleaves Kralum very hard.
Feroz misses Sharpe with his slash.
Feroz misses Sharpe with his slash.
Kralum crushes Crispen extremely hard.
Kralum is burned, as he swings at Crispen.
Lafour crushes Sharpe hard.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc extremely hard.
A fearsome blue dragon misses Eloc with his claw.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
Feroz stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
A gargoyle spins and tries to kick Sharpe, but Sharpe dodges out of the
way.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
Enubis flies in from the east.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW> dra
Kralum crashes into Enubis in a thundering collision, knocking him to
the
ground!
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
Crispen utters some strange words.
Crispen is surrounded by 4 duplicate images.
579H 172V 9566930X 500C [a fearsome blue dragon:V.Good] [Eloc:Fair]
Exits:EW>
Enubis cleaves Kralum extremely hard.
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You slash Eloc very hard.
Ryala whips Kralum extremely hard.
Ryala cleaves Kralum extremely hard.
Feroz misses Sharpe with his slash.
Kralum misses Crispen and destroys an image instead.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe very hard.
Sharpe hits a gargoyle.
A fearsome blue dragon claws Eloc very hard.
A fearsome blue dragon claws Eloc very hard.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW> impa
Lafour stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW> impair
Lafour crashes into Sharpe in a thundering collision, knocking him to
the
ground!
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW> impair
Eloc stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW>
Enubis steps aside as Eloc attempts a bash, stumbles, and falls flat on
his
face.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW>
Feroz tells your group 'TIK IN 10'
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW>
A gargoyle delivers a quick snap kick to Sharpe. Sharpe staggers and
tries to
recover.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW> After lightning
fast strikes from your rapier, Eloc is wheeling to regain his balance.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW>
Feroz stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Fair]
Exits:EW> o
Enubis cleaves Kralum extremely hard.
Eloc massacres a fearsome blue dragon with his slash.
You massacre Eloc with your stab.
You slash Eloc extremely hard.
Ryala whips Kralum hard.
Ryala cleaves Kralum very hard.
Feroz misses Sharpe with his slash.
Feroz slashes Sharpe extremely hard.
Crispen bludgeons Kralum very hard.
Kralum massacres Crispen with his crush.
Kralum is burned, as he swings at Crispen.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe extremely hard.
A gargoyle slashes Sharpe very hard.
Sharpe hits a gargoyle.
A fearsome blue dragon massacres Eloc with his claw.
Crispen focuses on Enubis and utters some strange words.
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW> order dragon
Ryala swoops at Kralum.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW> order dragon
Lorke flies in from the west.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW> order dragon
Lorke focuses on Sharpe and utters some strange words.
Lorke heals Sharpe.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW>
Enubis stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW> order dragon
Enubis crashes into Kralum in a thundering collision, knocking him to
the
ground!
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW> order dragon swoop
579H 172V 9566930X 500C [a fearsome blue dragon:Good] [Eloc:Bad]
Exits:EW>
Enubis cleaves Kralum extremely hard.
Enubis massacres Kralum with his cleave.
A fearsome blue dragon wavers under Eloc's mighty slash!
Eloc annihilates a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You slash Eloc extremely hard.
Ryala whips Kralum extremely hard.
Ryala cleaves Kralum hard.
Feroz slashes Sharpe very hard.
Feroz slashes Sharpe extremely hard.
Kralum misses Crispen and destroys an image instead.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe extremely hard.
A gargoyle slashes Sharpe very hard.
Sharpe hits a gargoyle.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon claws Eloc extremely hard.
579H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW>
Feroz stands up.
579H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW>
Crispen focuses on you and utters some strange words.
You suddenly feel FAST!
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW>
A gargoyle delivers a vicious kick to Sharpe's face. Blood flies as his
head
snaps back.
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW>
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW>
Sharpe stands up.
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW> drain
Lafour crashes into Sharpe in a thundering collision, knocking him to
the
ground!
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Bad]
Exits:EW> drain
Lorke focuses on Eloc and utters some strange words.
Lorke heals Eloc.
567H 172V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> Eloc spasms as
you place your hand on his chest and drain his life-force.
Eloc shivers and begins to grow extremely pale.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Eloc stands up.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Kralum steps aside as Enubis attempts a bash, stumbles, and falls flat
on his
face.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Enubis massacres Kralum with his cleave.
Enubis misses Kralum with his cleave.
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You slash Eloc.
You stab Eloc very hard.
Ryala massacres Kralum with her whip.
Ryala cleaves Kralum extremely hard.
Feroz slashes Sharpe very hard.
Feroz misses Sharpe with his slash.
Kralum misses Crispen and destroys an image instead.
Lafour crushes Sharpe hard.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe extremely hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc hard.
Your eyes tingle as a sense of darkness returns to you.
Aslim screams in pain as inky black tentacles constrict him.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Eloc stops using a clear sphere.
Eloc grabs a moist blue-green scroll.
Eloc recites a moist blue-green scroll.
Eloc heals Eloc.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Crispen focuses harshly on Kralum and utters some strange words.
Kralum wavers under the impact of the lightning bolt sent by Crispen.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Ryala stands up.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Lafour crashes into Lorke in a thundering collision, knocking him to
the ground!
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> gaze
A gargoyle delivers a vicious kick to Sharpe's face. Blood flies as his
head
snaps back.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> gaze sharp
You return to your normal fighting style.
Lorke crushes Lafour very hard.
Enubis cleaves Kralum extremely hard.
Enubis misses Kralum with his cleave.
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc very hard.
You slash Eloc hard.
Ryala massacres Kralum with her whip.
Ryala massacres Kralum with her cleave.
Feroz slashes Sharpe hard.
Feroz slashes Sharpe very hard.
Kralum massacres Crispen with his crush.
Kralum is burned, as he swings at Crispen.
Lafour crushes Sharpe hard.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe very hard.
A gargoyle slashes Sharpe very hard.
Sharpe misses a gargoyle with his hit.
A fearsome blue dragon claws Eloc.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> gaze sharpe
You gaze at
Sharpe with all the evilness you can muster.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Crispen focuses harshly on Kralum and utters some strange words.
Kralum receives the full blast of a lightning bolt from Crispen ... and
is no
more.
You receive 0 experience.
Kralum is dead! R.I.P.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
The death cry of Kralum echoes from somewhere nearby...
Kralum stops following Aslim.
Feroz stands up.
Ryala gets a very large pile of coins from the corpse of Kralum.
567H 183V 9566930X 500C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Sharpe steps aside as Feroz attempts a bash, stumbles, and falls flat
on his
face.
Ryala divides 8772 coins equally among the group members present.
567H 183V 9566930X 1962C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Lafour crashes into Sharpe in a thundering collision, knocking him to
the
ground!
567H 183V 9566930X 1962C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Ryala whips Sharpe very hard.
567H 183V 9566930X 1962C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> get all cor
Enubis stands up.
567H 183V 9566930X 1962C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW> get all corps
Enubis gets a mace of destruction from the corpse of Kralum.
Enubis gets a runed brass wristguard from the corpse of Kralum.
Enubis gets a blacksmith's spiked wrist guard from the corpse of
Kralum.
Enubis gets a scorched pyromancer's robe from the corpse of Kralum.
Enubis gets a granite shield from the corpse of Kralum.
Enubis gets a pair of red dragonscale vambraces from the corpse of
Kralum.
Enubis gets a pair of ice cold gauntlets from the corpse of Kralum.
Enubis gets a pair of black soldier boots from the corpse of Kralum.
Enubis gets some studded leather leggings from the corpse of Kralum.
Enubis gets a bighorn sheep skull from the corpse of Kralum.
Enubis gets a suit of charred black battle armor from the corpse of
Kralum.
Enubis gets an officer's insignia from the corpse of Kralum.
Enubis gets a snakeskin cape from the corpse of Kralum.
Enubis gets a dragon bone ring from the corpse of Kralum.
Enubis gets a serpentine ring from the corpse of Kralum.
Enubis gets a small wooden chest from the corpse of Kralum.
Enubis gets an ebony shield from the corpse of Kralum.
Enubis gets a glowing scroll of recall from the corpse of Kralum.
Enubis gets a glowing scroll of recall from the corpse of Kralum.
567H 183V 9566930X 1962C [a fearsome blue dragon:Fair] [Eloc:V.Good]
Exits:EW>
Ryala whips Sharpe very hard.
Ryala cleaves Sharpe extremely hard.
get all corpseLorke crushes Lafour extremely hard.
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You slash Eloc very hard.
You stab Eloc very hard.
Feroz slashes Sharpe extremely hard.
Feroz slashes Sharpe extremely hard.
Lafour crushes Sharpe hard.
Lafour crushes Sharpe hard.
A gargoyle claws Sharpe extremely hard.
A gargoyle slashes Sharpe very hard.
Sharpe is stunned, but will likely regain consciousness again.
A fearsome blue dragon claws Eloc.
A fearsome blue dragon bruises Eloc with his claw.
567H 183V 9566930X 1962C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW> get all corpse
You get some dark
metallic sleeves from the corpse of Kralum.
You get some spiked black gauntlets of the Lily from the corpse of
Kralum.
You get a pair of fine metal boots from the corpse of Kralum.
You get a pair of steel legplates inlaid with ebony from the corpse of
Kralum.
You get a small wooden chest from the corpse of Kralum.
You get a glowing scroll of recall from the corpse of Kralum.
You get a granite sphere from the corpse of Kralum.
You get a black sword belt from the corpse of Kralum.
You get a jeweled long sword from the corpse of Kralum.
You get a milky potion of see invisible from the corpse of Kralum.
You get a milky potion of see invisible from the corpse of Kralum.
You get an elaborate dragon robe from the corpse of Kralum.
Skull : You can't carry that much weight.
567H 183V 9566930X 1962C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Sharpe dies, after a gargoyle's devastating kick caves in his chest and
lungs.
You receive 0 experience.
Sharpe is dead! R.I.P.
The death cry of Sharpe echoes from somewhere nearby...
Sharpe sinks gently to the ground.
Sharpe's golden aura fades away.
Sharpe stops following Aslim.
Lorke stops following Sharpe.
Lorke now follows Aslim.
The demon Marilith stops following Sharpe.
567H 183V 9566930X 1962C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Crispen gets a large pile of coins from the corpse of Sharpe.
Eloc crashes into Lafour in a thundering collision, knocking him to the
ground!
567H 183V 9566930X 1962C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Crispen gets a gnome skull from the corpse of Kralum.
567H 183V 9566930X 1962C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Crispen divides 288 coins equally among the group members present.
567H 183V 9566930X 2010C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Lorke stands up.
567H 183V 9566930X 2010C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Crispen gets a furry white cloak from the corpse of Sharpe.
Crispen gets a pair of clear crystal gauntlets from the corpse of
Sharpe.
Crispen gets a pair of tanned leather pants from the corpse of Sharpe.
Crispen gets a furry white cloak from the corpse of Sharpe.
Crispen gets an ivy necklace from the corpse of Sharpe.
Crispen gets a shimmering silver cape from the corpse of Sharpe.
Crispen gets a carved stone seal from the corpse of Sharpe.
Crispen gets a glowing scroll of recall from the corpse of Sharpe.
Crispen gets a glowing scroll of recall from the corpse of Sharpe.
Crispen gets a putrid potion from the corpse of Sharpe.
Crispen gets a putrid potion from the corpse of Sharpe.
Crispen gets a putrid potion from the corpse of Sharpe.
Crispen gets a putrid potion from the corpse of Sharpe.
Crispen gets a vial of sparkling pink liquid from the corpse of Sharpe.
Crispen gets a bright ball of light from the corpse of Sharpe.
Crispen gets an impossibly dark shroud from the corpse of Sharpe.
Crispen gets a glowing scroll of recall from the corpse of Sharpe.
Crispen gets a scroll of recall from the corpse of Sharpe.
Crispen gets a small canteen from the corpse of Sharpe.
Crispen gets a yellow potion from the corpse of Sharpe.
Crispen gets a small wooden chest from the corpse of Sharpe.
567H 183V 9566930X 2010C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Ryala misses Eloc with her whip.
567H 183V 9566930X 2010C [a fearsome blue dragon:Bad] [Eloc:Good]
Exits:EW>
Ryala whips Eloc extremely hard.
Ryala cleaves Eloc very hard.
Lorke gracefully steps aside as Lafour attacks!
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You barely slash Eloc.
You stab Eloc hard.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon claws Eloc hard.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW>
Lorke panics, and attempts to flee.
Lorke flies west.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW>
Aslim steps aside as Enubis attempts a bash, stumbles, and falls flat
on his
face.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW>
Crispen focuses harshly on Aslim and utters some strange words.
Aslim wavers under the impact of the lightning bolt sent by Crispen.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW>
Lafour stands up.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW> g
Lafour crashes into Aslim in a thundering collision, knocking him to
the ground!
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW> gaze
You weakly gaze
at Eloc.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Good]
Exits:EW> impa
Aslim screams in pain as inky black tentacles constrict him.
Lafour hits the tentacles constricting Aslim instead!
Lafour crushes Aslim extremely hard.
Enubis massacres Aslim with his cleave.
Enubis cleaves Aslim extremely hard.
Aslim massacres Enubis with his cleave.
Aslim misses Enubis with his pierce.
Ryala whips Eloc very hard.
Ryala cleaves Eloc.
Eloc massacres a fearsome blue dragon with his slash.
You stab Eloc extremely hard.
You miss Eloc with your slash.
You stab Eloc hard.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon misses Eloc with his claw.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Fair]
Exits:EW> impair
Enubis stands up.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Fair]
Exits:EW> After lightning
fast strikes from your rapier, Eloc is wheeling to regain his balance.
567H 183V 9566930X 2010C [a fearsome blue dragon:V.Bad] [Eloc:Fair]
Exits:EW> ord
Lafour crushes Aslim extremely hard.
Lafour crushes Aslim extremely hard.
Enubis cleaves Aslim extremely hard.
Enubis cleaves Aslim extremely hard.
Aslim massacres Enubis with his cleave.
Aslim massacres Enubis with his pierce.
Ryala whips Eloc very hard.
Ryala cleaves Eloc hard.
Eloc massacres a fearsome blue dragon with his slash.
You miss Eloc with your stab.
You miss Eloc with your slash.
A fearsome blue dragon misses Eloc with his claw.
A fearsome blue dragon claws Eloc hard.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW> order d
Feroz stands up.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW> order dragon
Crispen focuses harshly on Aslim and utters some strange words.
Aslim wavers under the impact of the lightning bolt sent by Crispen.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW> order dragon swoo
Aslim stops using a dagger with a scrimshawed ivory hilt.
Aslim grabs a glowing scroll of recall.
Aslim recites a glowing scroll of recall.
Aslim disappears.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW> order dragon swoop
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Eloc grabs a glowing scroll of recall.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Ryala whips Eloc.
Ryala misses Eloc with her cleave.
Eloc massacres a fearsome blue dragon with his slash.
You massacre Eloc with your stab.
You miss Eloc with your slash.
You massacre Eloc with your stab.
A fearsome blue dragon claws Eloc very hard.
A fearsome blue dragon misses Eloc with his claw.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Feroz slashes Eloc.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Lafour crashes into Eloc in a thundering collision, knocking him to the
ground!
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Eloc steps aside as Enubis attempts a bash, stumbles, and falls flat on
his
face.
567H 183V 9566930X 2010C [a fearsome blue dragon:Awful] [Eloc:Fair]
Exits:EW>
Enubis massacres Eloc with his cleave.
Enubis massacres Eloc with his cleave.
Lafour crushes Eloc hard.
Lafour crushes Eloc very hard.
Feroz misses Eloc with his slash.
Feroz slashes Eloc extremely hard.
Ryala massacres Eloc with her whip.
Ryala cleaves Eloc extremely hard.
Eloc massacres a fearsome blue dragon with his slash.
A fearsome blue dragon is incapacitated and will slowly die, if not
aided.
You massacre Eloc with your stab.
You miss Eloc with your slash.
You miss Eloc with your stab.
567H 183V 9566930X 2010C [a fearsome blue dragon:Dying] [Eloc:V.Bad]
Exits:EW>
Crispen focuses harshly on Eloc and utters some strange words.
Eloc wavers under the impact of the lightning bolt sent by Crispen.
567H 183V 9566930X 2010C [a fearsome blue dragon:Dying] [Eloc:V.Bad]
Exits:EW> impair
Enubis stands up.
567H 183V 9566930X 2010C [a fearsome blue dragon:Dying] [Eloc:V.Bad]
Exits:EW> You have the
advantage already, press on!
567H 183V 9566930X 2010C [a fearsome blue dragon:Dying] [Eloc:V.Bad]
Exits:EW>
Enubis crashes into Eloc in a thundering collision, knocking him to the
ground!
567H 183V 9566930X 2010C [a fearsome blue dragon:Dying] [Eloc:V.Bad]
Exits:EW>
Enubis massacres Eloc with his cleave.
Enubis massacres Eloc with his cleave.
Lafour crushes Eloc hard.
Feroz misses Eloc with his slash.
Feroz misses Eloc with his slash.
Ryala tangles Eloc's feet with her bullwhip.
Ryala massacres Eloc with her whip.
Ryala cleaves Eloc extremely hard.
Eloc annihilates a fearsome blue dragon with his slash.
A fearsome blue dragon is dead! R.I.P.
You massacre Eloc with your stab.
You slash Eloc very hard.
You massacre Eloc with your stab.
The death cry of a fearsome blue dragon echoes from somewhere nearby...
A fearsome blue dragon stops following you.
A fearsome blue dragon transcends this world and enters another plane.
567H 183V 9566930X 2010C [Veovis:Perfect] [Eloc:Awful] Exits:EW> l
Crossing the Plains
The worn cobblestones that make up this portion of the main highway
out
of Port o'Call stretches to the north and to the east here. The
unmolested
plains of strong sinewy moor grass that are native to this part of
Ansalon
surround the road here. Several detachments of Solamnic Knights patrol
this
portion of the highway protecting the steady flow of travelers and
merchant
caravans.
The corpse of a fearsome blue dragon is lying here.
The corpse of Sharpe is lying here.
The corpse of Kralum is lying here.
<BSP> Enubis the Male Minotaur is standing here, fighting Eloc.
(flying)
<BSP> Feroz, The Fierce is standing here, fighting Eloc. (flying) (red
aura)
<Apoc> Eloc Tricity, Devouring Magician of Krynn is sitting here,
fighting YOU.
(flying)
A gargoyle is standing here.
<BSP> Ryala Avianus is standing here, fighting Eloc. (flying) (white
aura)
<BSP> Lafour, The Dodgeball Master is standing here, fighting Eloc.
(flying)
(red aura)
<BSP> Crispen Ash, Burning Flames of the Blood Sea is standing here.
(flying)
(red aura)
. . . is enveloped in flames.
567H 183V 9566930X 2010C [Veovis:Perfect] [Eloc:Awful] Exits:EW> get
You return to your normal fighting style.
Your eyes tingle as a sense of darkness returns to you.
Eloc massacres YOU with his slash.
Enubis cleaves Eloc extremely hard.
You receive 0 experience.
Eloc is dead! R.I.P.
The death cry of Eloc echoes from somewhere nearby...
Crispen gets a large pile of coins from the corpse of Eloc.
Lafour gets a glowing scroll of recall from the corpse of Eloc.
Lafour is zapped by a crystalline sword and instantly drops it.
Lafour is zapped by a crimson glass bracelet and instantly drops it.
Lafour gets a black bracelet of the Lily from the corpse of Eloc.
Lafour gets a gold belt from the corpse of Eloc.
Lafour gets a shimmering blue dragon scale cloak from the corpse of
Eloc.
Lafour gets a shield of the Black Lily from the corpse of Eloc.
Lafour gets a pair of spun mithril sleeves from the corpse of Eloc.
Lafour gets a pair of spiked sterling gauntlets from the corpse of
Eloc.
Lafour gets thin golden dragonscale legplates from the corpse of Eloc.
Lafour gets a green dragonscale helm from the corpse of Eloc.
Lafour gets a suit of charred black battle armor from the corpse of
Eloc.
Lafour gets a black neckguard of the Lily from the corpse of Eloc.
Lafour gets a black neckguard of the Lily from the corpse of Eloc.
Lafour gets a rune etched mithril ring from the corpse of Eloc.
Lafour gets a golden ring covered in feces from the corpse of Eloc.
Lafour gets a clear sphere from the corpget se of Eloc.
Lafour gets a glowing scroll of recall from the corpse of Eloc.
Lafour gets a glowing scroll of recall from the corpse of Eloc.
Lafour gets a glowing scroll of recall from the corpse of Eloc.
Lafour gets a glowing scroll of recall from the corpse of Eloc.
Lafour gets a putrid potion from the corpse of Eloc.
Lafour gets a putrid potion from the corpse of Eloc.
Lafour gets a putrid potion from the corpse of Eloc.
Lafour gets a putrid potion from the corpse of Eloc.
Lafour gets a cracked ruby from the corpse of Eloc.
Lafour gets a putrid potion from the corpse of Eloc.
Lafour gets a large hide waterskin from the corpse of Eloc.
Lafour gets a milky potion of see invisible from the corpse of Eloc.
Lafour gets a milky potion of see invisible from the corpse of Eloc.
Lafour gets a shoulder sack from the corpse of Eloc.
Feroz gets a small wooden chest from the corpse of Eloc.
539H 183V 9566930X 2010C Exits:EW> ge
Crispen divides 192 coins equally among the group members present.
539H 183V 9566930X 2042C Exits:EW> get brac
Ryala is zapped by a crimson glass bracelet and instantly drops it.
Ryala gets a crystalline sword.
Ryala gets the corpse of Eloc.
539H 183V 9566930X 2042C Exits:EW> get brace
Crispen says 'fuckig nice'
539H 183V 9566930X 2042C Exits:EW> get bracelet
You are zapped by a crimson glass bracelet and
instantly drop it.
539H 183V 9566930X 2042C Exits:EW> in
You are carrying:
an elaborate dragon robe
a milky potion of see invisible [2]
a jeweled long sword..it hums softly
a black sword belt
a granite sphere
a glowing scroll of recall..it glows dimly
a small wooden chest
a pair of steel legplates inlaid with ebony..it glows dimly
a pair of fine metal boots
some spiked black gauntlets of the Lily
some dark metallic sleeves
a putrid potion [3]
a milky potion of see invisible
a small wooden chest
a gnome skull
a leg of lamb
539H 183V 9566930X 2042C Exits:EW>
Lafour is zapped by a crimson glass bracelet and instantly drops it.
539H 183V 9566930X 2042C Exits:EW>
Feroz is zapped by a crimson glass bracelet and instantly drops it.
539H 183V 9566930X 2042C Exits:EW>
Feroz flies east.
539H 183V 9566930X 2042C Exits:EW>
Crispen says 'loot them bitches'

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
