#[1]RSS

PK Log Site for ArcticMUD, the Best MUD and Best Free Online Dragonlance Game
Available!
[2]Vote for Arctic on Top Mud Sites
[3]Vote for Arctic on Mud Connect

Login
Username: __________
Password: __________
Login
[4]Forgot your password?
[5]Register for a Login
Mud Logs
[6]Recent Logs
[7]Older Logs
[8]Newer Logs
[9]Top Rated Logs
[10]Most Viewed Logs
[11]Upload A Log
[12]Log Collections
[13]Log Quicklist
Mud Links
[14]Vote for Arctic
on Top Mud Sites
[15]Vote for Arctic
on Mud Connect
[16]ArcticMud Blog
[17]RGB Mud Log Page
[18]Xanitha's Mud Log Page (not current)
[19]Oligo's Logs (not current)
[20]Arctic Mud Forums
[21]Arctic Mud Homepage

Which zone do you hate the MOST?

(*) Silvanesti
( ) Deepmines
( ) Caverns of Thorbardin
( ) Dun Mir
( ) Mithas
( ) Ravenshadow
( ) Castle Uth Wistan
Vote Results

[22]Submit a Poll
[23]List Previous Polls

New [24]RSS feed! and Twitter [25]updates on new logs.

Tourny Fight 1
[26]View Comments (0)

POV: Belvedere

Log Rating: 0.3333

VA dominates

480H 156V 1X 22.02% 96C Mem:2 Exits:NW> You utter the words, 'gate'
You wave your hand, and the demon Marilith appears!
The demon Marilith starts following you.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> give shield demon
Your clanmate Alva has left the game.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> o demon wear shiYou give a
sapphire shield to the demon Marilith.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> o demon wear shield
The demon Marilith starts using a sapphire shield as a
shield.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> i
You are carrying:
a small bag of white stones [3]
a pure white bracer..it glows dimly
a platinum gilt claymore..it glows blue
a nine sectional staff..it glows blue
a small wooden chest
a dagger [4]
a glowing scroll of recall..it glows blue..it glows dimly [3]
a stone-bladed hatchet
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> give staff demon
You give a nine sectional staff to the demon Marilith.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> o demon wield staff
The demon Marilith spins a nine sectional staff about. Best
move away so you don't get smacked.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> #al j o demon bash sylvice
#Ok. {j} aliases {o demon bash sylvice}.
sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
480H 158V 1X 22.02% 96C Mem:2 Exits:NW> w
The demon Marilith arrives from the east.
Moonglum flies in from the east.
Vayn arrives from the east.
Vez the fearsome blue dragon arrives from the east.
Jonny arrives from the east.
Mavlad the bronze dragon arrives from the east.
The Arena of Champions
Mavlad the bronze dragon is standing here, awaiting a rider.
<VA> Jonny the Male Human is standing here. (flying)
A fearsome blue dragon, Vez, is standing here, ignoring you.
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
The Demon Marilith is here, writhing its snake-like tail.
480H 156V 1X 22.02% 96C Mem:2 Exits:NEW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
480H 156V 1X 22.02% 96C Mem:2 Exits:NEW> w
The demon Marilith arrives from the east.
Moonglum flies in from the east.
Vayn arrives from the east.
Vez the fearsome blue dragon arrives from the east.
Jonny arrives from the east.
Mavlad the bronze dragon arrives from the east.
The Arena of Champions
Mavlad the bronze dragon is standing here, awaiting a rider.
<VA> Jonny the Male Human is standing here. (flying)
A fearsome blue dragon, Vez, is standing here, ignoring you.
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
The Demon Marilith is here, writhing its snake-like tail.
480H 154V 1X 22.02% 96C Mem:2 Exits:NE> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
480H 154V 1X 22.02% 96C Mem:2 Exits:NE> n
The demon Marilith arrives from the south.
Moonglum flies in from the south.
Vayn arrives from the south.
Vez the fearsome blue dragon arrives from the south.
Jonny arrives from the south.
Mavlad the bronze dragon arrives from the south.
The Arena of Champions
Mavlad the bronze dragon is standing here, awaiting a rider.
<VA> Jonny the Male Human is standing here. (flying)
A fearsome blue dragon, Vez, is standing here, ignoring you.
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
The Demon Marilith is here, writhing its snake-like tail.
480H 152V 1X 22.02% 96C Mem:2 Exits:NES> sca
Looking north:
You see nothing special.
<Rngd> Alec, Trained in Archaeology is standing here. (flying)
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here.
(flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
480H 152V 1X 22.02% 96C Mem:2 Exits:NES> n
The demon Marilith arrives from the south.
Moonglum flies in from the south.
Vayn arrives from the south.
Vez the fearsome blue dragon arrives from the south.
Jonny arrives from the south.
Mavlad the bronze dragon arrives from the south.
The Arena of Champions
Mavlad the bronze dragon is standing here, awaiting a rider.
<VA> Jonny the Male Human is standing here. (flying)
A fearsome blue dragon, Vez, is standing here, ignoring you.
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
The Demon Marilith is here, writhing its snake-like tail.
<Rngd> Alec, Trained in Archaeology is standing here. (flying)
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here.
(flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
480H 150V 1X 22.02% 96C Mem:2 Exits:ES> j
The demon Marilith crashes into Sylvice in a thundering
collision, knocking him to the ground!
480H 150V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn massacres Sylvice with his slash.
Vayn's sword turns the deepest black!
Sylvice's life is drained by a sword!
480H 150V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny massacres Sylvice with his slash.
480H 150V 1X 22.02% 96C Mem:2 Exits:ES>
Sokrates slashes the demon Marilith extremely hard.
480H 150V 1X 22.02% 96C Mem:2 Exits:ES> c '
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
480H 150V 1X 22.02% 96C Mem:2 Exits:ES> c '
Moonglum massacres Sokrates with his slash.
Sokrates slashes the demon Marilith extremely hard.
Sokrates slashes the demon Marilith very hard.
Jonny massacres Sylvice with his slash.
Vayn massacres Sylvice with his slash.
Vayn massacres Sylvice with his stab.
The demon Marilith bludgeons Sylvice hard.
Sylvice drains the demon Marilith very hard.
480H 150V 1X 22.02% 96C Mem:2 Exits:ES> c 'sunr'
You utter the words, 'sunray'
Your hands send forth blinding rays of sunlight!
Alec withers as a ray of sunlight engulfs him!
Sylvice withers as a ray of sunlight engulfs him!
Sokrates withers as a ray of sunlight engulfs him!
You destroy Scaramanga's mirror images.
Scaramanga withers as a ray of sunlight engulfs him!
480H 150V 1X 22.02% 96C [Me:Perfect] [Alec:V.Good] Mem:2 Exits:ES>
Scaramanga utters some strange words.
Mavlad the bronze dragon is stunned momentarily, recovering quickly.
Vayn is stunned momentarily, recovering quickly.
Moonglum is stunned momentarily, recovering quickly.
The demon Marilith is stunned!
Alec utters some strange words.
Alec is surrounded by swirling shadows.
480H 150V 1X 22.02% 96C [Me:Perfect] [Alec:V.Good] Mem:2 Exits:ES> !
Vayn attacks Sylvice with lightning fast series of attacks that leaves
him defenseless.
Jonny focuses his purity on Sylvice's head!
480H 150V 1X 22.02% 96C [Me:Perfect] [Alec:V.Good] Mem:2 Exits:ES>
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Jonny blocks Alec's blow with a quick raise of his shield.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Scaramanga misses Jonny with his hit.
Mavlad the bronze dragon misses Scaramanga with his hit.
Moonglum slashes Sokrates extremely hard.
The demon Marilith wavers under Sokrates's mighty slash!
Sokrates massacres the demon Marilith with his slash.
Sokrates slashes the demon Marilith extremely hard.
Vayn massacres Sylvice with his slash.
Vayn massacres Sylvice with his stab.
Sylvice drains the demon Marilith very hard.
480H 150V 1X 22.02% 96C Mem:2 Exits:ES> You utter the words, 'sunray'
Your hands send forth blinding rays of sunlight!
Alec withers as a ray of sunlight engulfs him!
Sylvice withers as a ray of sunlight engulfs him!
Sokrates withers as a ray of sunlight engulfs him!
Scaramanga withers as a ray of sunlight engulfs him!
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Good] Mem:3
Exits:ES>
Scaramanga utters some strange words.
Mavlad the bronze dragon is stunned!
Vez the fearsome blue dragon is stunned momentarily, recovering
quickly.
The demon Marilith is stunned momentarily, recovering quickly.
You fall down, your ears ringing.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Good] Mem:3
Exits:ES> !
Alec utters some strange words.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Good] Mem:3
Exits:ES> !
Vez the fearsome blue dragon claws Scaramanga.
Vez the fearsome blue dragon is burned, as he swings at Scaramanga.
Vez the fearsome blue dragon claws Scaramanga hard.
Vez the fearsome blue dragon is burned, as he swings at Scaramanga.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Moonglum massacres Sokrates with his slash.
Sokrates massacres the demon Marilith with his slash.
Sokrates slashes the demon Marilith extremely hard.
Vayn massacres Sylvice with his slash.
Vayn massacres Sylvice with his stab.
Sylvice drains the demon Marilith extremely hard.
Their opponent, making them recoil momentarily in horror.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt STU
Sokrates steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt STUNYou are completely
disoriented.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt STUNNED
You tell your group
'STUNNED'
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Jonny attempts to strike at Alec with his halberd.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
480H 150V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Scaramanga utters some strange words.
Scaramanga conjures a writhing mass of inky black tentacles!
Mavlad the bronze dragon appears to grow stronger.
Mavlad the bronze dragon narrowly escapes the gruesome black tentacles!
Jonny screams in pain as inky black tentacles constrict him.
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
Vayn appears to grow stronger.
Vayn narrowly escapes the gruesome black tentacles!
Moonglum screams in pain as inky black tentacles constrict him.
The demon Marilith screams in pain as inky black tentacles constrict
it.
You scream in pain as inky black tentacles constrict you.
457H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Alec focuses on Sylvice and utters some strange words.
Sylvice's wounds begin to heal.
457H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt
Sylvice stands up.
457H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay
You scream in pain as inky black tentacles constrict you.
Mavlad the bronze dragon screams in pain as inky black tentacles
constrict him.
The demon Marilith screams in pain as inky black tentacles constrict
it.
Vez the fearsome blue dragon claws Scaramanga hard.
Vez the fearsome blue dragon is burned, as he swings at Scaramanga.
Vez the fearsome blue dragon misses Scaramanga with his claw.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Moonglum misses Sokrates with his slash.
Sokrates hits the tentacles constricting the demon Marilith instead!
Sokrates slashes the demon Marilith extremely hard.
The demon Marilith has been defeated.
There is a flash of light and then the demon Marilith is gone.
Vayn massacres Sylvice with his slash.
Vayn stabs Sylvice extremely hard.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive til
Sylvice panics, and attempts to flee.
Sylvice leaves east.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive till w
Sokrates stands up.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive till we ge
Sylvice arrives from the east.
Scaramanga is hit by Vez the fearsome blue dragon's lightning breath.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive till we get b
Sokrates attacks Moonglum with lightning fast series of attacks that
leaves him defenseless.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive till we get back
Jonny attempts to strike at Alec with his halberd.
Jonny slashes Alec extremely hard.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> gt stay alive till we get back up
Vayn massacres Sokrates with his slash.
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> You tell your group
'stay alive till we get back up'
447H 150V 1X 22.02% 96C [Me:V.Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> g
Scaramanga utters some strange words.
Scaramanga conjures a writhing mass of inky black tentacles!
Mavlad the bronze dragon appears to grow stronger.
Mavlad the bronze dragon narrowly escapes the gruesome black tentacles!
Jonny screams in pain as inky black tentacles constrict him.
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
Vayn appears to grow stronger.
Vayn narrowly escapes the gruesome black tentacles!
Moonglum screams in pain as inky black tentacles constrict him.
You scream in pain as inky black tentacles constrict you.
421H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> grou
Alec focuses on Sylvice and utters some strange words.
Sylvice's wounds begin to heal.
421H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> grou
You are completely
disoriented.
421H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
You scream in pain as inky black tentacles constrict you.
Mavlad the bronze dragon screams in pain as inky black tentacles
constrict him.
Moonglum screams in pain as inky black tentacles constrict him.
Vayn misses Sokrates with his slash.
Vayn stabs Sokrates extremely hard.
Sokrates hits the tentacles constricting Moonglum instead!
Sokrates massacres Moonglum with his slash.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Sylvice utters the words, 'heal'.
Sylvice heals Sylvice.
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES> st;hea
Sokrates utters some strange words.
Matai the fearsome blue dragon suddenly appears!
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Fair] Mem:3
Exits:ES>
Jonny attempts to strike at Alec with his halberd.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Bad] Mem:3
Exits:ES>
Sokrates gives Matai the fearsome blue dragon an order.
Matai the fearsome blue dragon massacres Moonglum with his claw.
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Bad] Mem:3
Exits:ES>
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
415H 150V 1X 22.02% 96C [Me:Good] [Jonny:V.Good] [Alec:Bad] Mem:3
Exits:ES>
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
You scream in pain as inky black tentacles constrict you.
The tentacles constricting you weaken and drop away.
Mavlad the bronze dragon screams in pain as inky black tentacles
constrict him.
Matai the fearsome blue dragon claws Moonglum extremely hard.
Matai the fearsome blue dragon claws Moonglum extremely hard.
Vayn annihilates Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn massacres Sokrates with his stab.
Alec misses Jonny with his cleave.
Alec wavers under Jonny's mighty slash!
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Scaramanga misses Jonny with his hit.
Moonglum slashes Sokrates extremely hard.
Moonglum stands up.
Alec utters some strange words.
411H 150V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Scaramanga utters some strange words.
Scaramanga conjures a writhing mass of inky black tentacles!
Mavlad the bronze dragon appears to grow stronger.
Mavlad the bronze dragon narrowly escapes the gruesome black tentacles!
Jonny screams in pain as inky black tentacles constrict him.
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
Vayn appears to grow stronger.
Vayn narrowly escapes the gruesome black tentacles!
Moonglum screams in pain as inky black tentacles constrict him.
You scream in pain as inky black tentacles constrict you.
383H 150V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Moonglum attempts to break free of the black tentacles, but fails!
383H 150V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Moonglum attempts to break free of the black tentacles, but fails!
383H 150V 1X 22.02% 96C [Me:Good] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Sylvice utters the words, 'sunray'.
Sylvice's hands send forth blinding rays of sunlight!
Mavlad the bronze dragon withers as a ray of sunlight sent by Sylvice
engulfs him!
Mavlad the bronze dragon seems to be blinded!
Jonny withers as a ray of sunlight sent by Sylvice engulfs him!
Vez the fearsome blue dragon withers as a ray of sunlight sent by
Sylvice engulfs him!
Vayn withers as a ray of sunlight sent by Sylvice engulfs him!
Moonglum withers as a ray of sunlight sent by Sylvice engulfs him!
You wither as a ray of sunlight engulfs you!
You feel a slight chill.
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> st
Moonglum attempts to break free of the black tentacles, but fails!
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> st
You are completely
disoriented.
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> g
Moonglum attempts to break free of the black tentacles, but fails!
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> grou
You are completely
disoriented.
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Sokrates attacks Moonglum with lightning fast series of attacks that
leaves him defenseless.
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Moonglum attempts to break free of the black tentacles, but fails!
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
Vez the fearsome blue dragon attempts to break free of the black
tentacles, but fails!
Moonglum attempts to break free of the black tentacles, but fails!
353H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> st;
Vez the fearsome blue dragon screams in pain as inky black tentacles
constrict him.
You scream in pain as inky black tentacles constrict you.
Mavlad the bronze dragon screams in pain as inky black tentacles
constrict him.
Moonglum screams in pain as inky black tentacles constrict him.
Sylvice drains Mavlad the bronze dragon extremely hard.
Matai the fearsome blue dragon claws Moonglum hard.
Matai the fearsome blue dragon claws Moonglum extremely hard.
Vayn massacres Sokrates with his slash.
Vayn misses Sokrates with his stab.
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum very hard.
Vez the fearsome blue dragon's blow is absorbed by Scaramanga's armor.
Vez the fearsome blue dragon is burned, as he swings at Scaramanga.
Vez the fearsome blue dragon misses Scaramanga with his claw.
Jonny slashes Alec extremely hard.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Moonglum slashes Sokrates extremely hard.
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> st;heal
Jonny focuses his purity on Alec's leg!
Jonny focuses on Alec's legs, but is thwarted.
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Bad] Mem:3
Exits:ES> st;heal me
Alec utters the words, 'cure critical'.
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:Good] Mem:3
Exits:ES> st;heal m
Sylvice focuses on Alec and utters the words, 'heal'.
Sylvice heals Alec.
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:V.Good] Mem:3
Exits:ES> grou
You are completely
disoriented.
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:V.Good] Mem:3
Exits:ES> g
Moonglum tells your group 'tented'
344H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Good] [Alec:V.Good] Mem:3
Exits:ES> grou
Scaramanga utters some strange words.
Matai the fearsome blue dragon stops fighting Moonglum.
Sylvice stops fighting Mavlad the bronze dragon.
Mavlad the bronze dragon stops fighting Scaramanga.
Jonny stops fighting Alec.
Vez the fearsome blue dragon stops fighting Scaramanga.
Vayn stops fighting Sokrates.
Moonglum stops fighting Sokrates.
You stop fighting Alec.
Alec stops fighting Jonny.
Sokrates stops fighting Moonglum.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> grou
You are completely disoriented.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt kick me
You tell your group 'kick me'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn tells your group 'tick in 10'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt now
You tell your group 'now'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Scaramanga leaves south.
Sokrates leaves south.
Matai the fearsome blue dragon flies south.
Sylvice leaves south.
Alec leaves south.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Scaramanga arrives from the south.
Sokrates arrives from the south.
Matai the fearsome blue dragon flies in from the south.
Sylvice arrives from the south.
Alec arrives from the south.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn massacres Alec with his slash.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Alec massacres Vayn with his cleave.
Vayn massacres Alec with his slash.
Vayn massacres Alec with his stab.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> !
You tell your group 'now'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Sokrates slashes Moonglum very hard.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Sylvice focuses on Sokrates and utters the words, 'cure critical'.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> !
You tell your group 'now'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Alec utters some strange words.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt kick me
Scaramanga focuses harshly on Vayn and utters some strange words.
Vayn wavers under the impact of the lightning bolt sent by Scaramanga.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt kick me
You tell your group 'kick me'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> !
Jonny slashes Sylvice extremely hard.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny thrusts the point of his halberd into Sylvice, deeply wounding
him.
Jonny slashes Sylvice very hard.
Sylvice drains Jonny very hard.
Their opponent, making them recoil momentarily in horror.
Sokrates slashes Moonglum very hard.
Sokrates misses Moonglum with his slash.
Moonglum massacres Sokrates with his slash.
Vayn massacres Alec with his slash.
Vayn massacres Alec with his stab.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn attacks Alec with lightning fast series of attacks that leaves him
defenseless.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt strike me
You tell your group 'strike me'
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> st
The tentacles constricting you make that impossible!
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> sc
Scaramanga focuses harshly on Vayn and utters some strange words.
Vayn wavers under the impact of the lightning bolt sent by Scaramanga.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> sc
You are Mr. Belvedere, A Gentleman's Gentleman, a level 30
Cleric.
You are an Elder in Vague Ambition.
You are rank 19. You have completed 22.02% of your next rank.
You are 77 years old.
You have 344(480) hit and 150(158) movement points.
Your behaviour has been Evil.
The warmth of good envelops your soul.
You have scored 89999999 exp, and have 96(27997) steel coins.
You need 1 more experience to advance.
You have died 11 horrible deaths.
You have been connected for 37 minute(s).
You have been playing for 9 day(s), 21 hour(s) and 31 minute(s).
Your equipment is currently being concealed.
You could comfortably carry more.
You are sitting.
You are flying.
You are guarded by Jonny.
You are affected by the following:
malevolent tentacles
fly
sacred ward
protection from good
heroism
steelskin
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gr
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested sitting Y N N N Y 0 3
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 1
Jonny good rested fighting Y N N N Y 0 1
344H 150V 1X 22.02% 96C Mem:3 Exits:ES> gt
Jonny slashes Sylvice very hard.
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum hard.
Moonglum slashes Sokrates extremely hard.
Alec massacres Vayn with his cleave.
Vayn annihilates Alec with his slash.
Vayn massacres Alec with his stab.
You scream in pain as inky black tentacles constrict you.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES> gt STR
Vayn gives Vez the fearsome blue dragon an order.
Vez the fearsome blue dragon claws Alec very hard.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES> gt STRIKE ME
You tell your group 'STRIKE ME'
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny deftly steps in front of the attack on you.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Alec focuses harshly on Vayn and utters some strange words.
The flesh of Vayn begins to decay!
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny deftly steps in front of the attack on you.
Moonglum spins and tries to kick Jonny, but Jonny dodges out of the
way.
Scaramanga focuses harshly on Vayn and utters some strange words.
Vayn wavers under the impact of the lightning bolt sent by Scaramanga.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn screams as blood pours from his wounds.
Vez the fearsome blue dragon claws Alec.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
Vez the fearsome blue dragon claws Alec hard.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
Jonny massacres Sylvice with his slash.
Sylvice misses Jonny with his drain.
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum massacres Sokrates with his slash.
Vayn massacres Alec with his slash.
Vayn massacres Alec with his stab.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Sokrates stands up.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Sokrates heroically rescues Alec.
342H 158V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny attempts to strike at you with his halberd.
The tentacles constricting you weaken and drop away.
Jonny slashes YOU extremely hard.
323H 158V 1X 22.02% 96C [Me:Fair] [Sylvice:V.Good] [Jonny:Good] Mem:3
Exits:ES>
Sokrates spasms as Vayn places his hand on Sokrates's chest.
Sokrates shivers and begins to grow extremely pale.
323H 158V 1X 22.02% 96C [Me:Fair] [Sylvice:V.Good] [Jonny:Good] Mem:3
Exits:ES> st
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
323H 158V 1X 22.02% 96C [Me:Fair] [Sylvice:V.Good] [Jonny:Good] Mem:3
Exits:ES> st
You stand up.
323H 158V 1X 22.02% 96C [Me:Fair] [Sylvice:V.Good] [Jonny:Good] Mem:3
Exits:ES> fle
Scaramanga focuses harshly on Vayn and utters some strange words.
The sound of bones cracking echoes as Scaramanga's force bolt slams
into Vayn.
323H 158V 1X 22.02% 96C [Me:Fair] [Sylvice:V.Good] [Jonny:Good] Mem:3
Exits:ES> fle
You flee head over
heels.
The Arena of Champions
323H 156V 1X 22.02% 96C Mem:3 Exits:ESW> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested standing Y N N N Y 0 3
Moonglum bad rested fighting Y N N N N 0 0
Vayn fair rested fighting Y N N N N 0 1
Jonny good rested fighting Y N N N N 0 1
323H 156V 1X 22.02% 96C Mem:3 Exits:ESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
<Rngd> Alec, Trained in Archaeology is standing here, fighting Vayn.
(flying)
. . . enveloped in shadows.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Jonny.
(flying)
. . . has a metallic luster.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is sitting here,
fighting Vayn. (flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
Mavlad the bronze dragon is sitting here.
<VA> Jonny the Male Human is standing here, fighting Sylvice. (flying)
Vez the fearsome blue dragon is standing here, fighting Alec.
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
323H 156V 1X 22.02% 96C Mem:3 Exits:ESW> w;heal moonglum
The Arena of Champions
<Rngd> Alec, Trained in Archaeology is standing here, fighting Vayn.
(flying)
. . . enveloped in shadows.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Jonny.
(flying)
. . . has a metallic luster.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is sitting here,
fighting Vayn. (flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
Mavlad the bronze dragon is sitting here.
<VA> Jonny the Male Human is standing here, fighting Sylvice. (flying)
Vez the fearsome blue dragon is standing here, fighting Alec.
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny attempts to strike at Sylvice with his halberd.
Jonny slashes Sylvice very hard.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> You utter the words, 'heal'
You heal Moonglum.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn gazes at Sokrates with a look of evilness.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Alec utters some strange words.
Alec's wounds begin to heal.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Sylvice utters the words, 'qjq fit'.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> s
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> sca
Scaramanga focuses harshly on Vayn and utters some strange words.
The sound of bones cracking echoes as Scaramanga's force bolt slams
into Vayn.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Vayn screams as blood pours from his wounds.
Vayn annihilates Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Sokrates slashes Vayn hard.
Sokrates slashes Vayn extremely hard.
Vez the fearsome blue dragon claws Alec very hard.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
Jonny brings his halberd down with a mighty cleave, crushing Sylvice.
Jonny slashes Sylvice very hard.
Sylvice drains Jonny extremely hard.
Moonglum massacres Sokrates with his slash.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Jonny yells and leaps into the fray.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Sylvice focuses on Alec and utters the words, 'cure critical'.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested standing Y N N N Y 0 3
Moonglum v.good rested fighting Y N N N Y 0 0
Vayn v.bad rested fighting Y N N N Y 0 1
Jonny good rested fighting Y N N N Y 0 1
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Sokrates stands up.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES>
Sokrates attacks Vayn with lightning fast series of attacks that leaves
him defenseless.
323H 154V 1X 22.02% 96C Mem:3 Exits:ES> heal vayn
You utter the words, 'heal'
You heal Vayn.
323H 154V 1X 22.02% 96C Mem:4 Exits:ES>
Alec massacres Vayn with his cleave.
Vayn misses Sokrates with his slash.
Vayn misses Sokrates with his stab.
Sokrates misses Vayn with his slash.
Sokrates slashes Vayn extremely hard.
Vez the fearsome blue dragon claws Alec hard.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
Vez the fearsome blue dragon claws Alec.
Vez the fearsome blue dragon gasps in pain as he swings through the
shadows surrounding Alec.
Jonny massacres Sylvice with his slash.
Moonglum slashes Sokrates extremely hard.
Scaramanga focuses harshly on Vayn and utters some strange words.
The sound of bones cracking echoes as Scaramanga's force bolt slams
into Vayn.
323H 154V 1X 22.02% 96C Mem:4 Exits:ES>
Alec avoids Vez the fearsome blue dragon's lightning breath.
323H 154V 1X 22.02% 96C Mem:4 Exits:ES>
Jonny attempts to strike at Sylvice with his halberd.
Jonny slashes Sylvice extremely hard.
323H 154V 1X 22.02% 96C Mem:4 Exits:ES>
Sokrates heroically rescues Alec.
323H 154V 1X 22.02% 96C Mem:4 Exits:ES> cc me
You utter the words, 'cure critical'
Large open gashes on your body stop bleeding and heal.
413H 154V 1X 22.02% 96C Mem:4 Exits:ES>
Moonglum kicks you in the face, breaking teeth and bone. Blood flies as
your head is rocked back.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES>
Vez the fearsome blue dragon misses Sokrates with his claw.
Vez the fearsome blue dragon claws Sokrates.
Sokrates slashes Vez the fearsome blue dragon extremely hard.
Sokrates slashes Vez the fearsome blue dragon very hard.
Alec massacres Vayn with his cleave.
Vayn misses Sokrates with his slash.
Vayn misses Sokrates with his stab.
Vayn massacres Sokrates with his slash.
Jonny slashes Sylvice very hard.
Sylvice drains Jonny very hard.
Moonglum slashes Sokrates extremely hard.
Vayn focuses harshly on Sokrates and utters the words, 'soul leech'.
Sokrates shudders with agony as pain lashes and clamps down on his
soul.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Bad] [Moonglum:V.Good]
Mem:4 Exits:ES>
Sylvice focuses on Sokrates and utters the words, 'cure critical'.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES>
Scaramanga focuses harshly on you and utters the words, 'silence'.
You feel a slight chill.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES> fle
Jonny focuses his purity on Sylvice's head!
Jonny focuses on Sylvice's head, but is thwarted.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES>
Alec stands up.
Sokrates gives Matai the fearsome blue dragon an order.
Matai the fearsome blue dragon claws Vez the fearsome blue dragon very
hard.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES>
Sokrates attacks Vez the fearsome blue dragon with lightning fast
series of attacks that leaves him
defenseless.
386H 154V 1X 22.02% 96C [Me:Good] [Sokrates:Fair] [Moonglum:V.Good]
Mem:4 Exits:ES> You flee head
over heels.
The Arena of Champions
386H 152V 1X 22.02% 96C Mem:4 Exits:NES> sca
Looking north:
You see nothing special.
<Rngd> Alec, Trained in Archaeology is standing here, fighting Vayn.
(flying)
. . . enveloped in shadows.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Jonny.
(flying)
. . . has a metallic luster.
Matai the fearsome blue dragon is standing here, fighting someone who
has already left.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is sitting here,
fighting someone who has already
left. (flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
Mavlad the bronze dragon is sitting here.
<VA> Jonny the Male Human is standing here, fighting Sylvice. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
386H 152V 1X 22.02% 96C Mem:4 Exits:NES> n
The Arena of Champions
<Rngd> Alec, Trained in Archaeology is standing here, fighting Vayn.
(flying)
. . . enveloped in shadows.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Jonny.
(flying)
. . . has a metallic luster.
Matai the fearsome blue dragon is standing here, fighting someone who
has already left.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is sitting here,
fighting someone who has already
left. (flying)
<Rngd> Mr Scaramanga is standing here. (flying) (invisible)
. . . is enveloped in flames.
Mavlad the bronze dragon is sitting here.
<VA> Jonny the Male Human is standing here, fighting Sylvice. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere good rested standing Y N N N Y 0 4
Moonglum v.good rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 1
Jonny good rested fighting Y N N N Y 0 1
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> c 'sil
Jonny attempts to strike at Sylvice with his halberd.
Jonny slashes Sylvice very hard.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> c 'sil'
Scaramanga utters some strange words.
You are stunned for a moment, but recover immediately.
Mavlad the bronze dragon is stunned!
Jonny is stunned momentarily, recovering quickly.
Vayn is stunned momentarily, recovering quickly.
386H 150V 1X 22.02% 96C [Me:Good] [Scaramanga:Perfect] Mem:4 Exits:ES>
c 'sil'
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
386H 150V 1X 22.02% 96C [Me:Good] [Scaramanga:Perfect] Mem:4 Exits:ES>
c 'sil's
Jonny deftly steps in front of the attack on you.
Alec wiggles his fingers as he outlines Jonny's head in the air.
386H 150V 1X 22.02% 96C [Me:Good] [Scaramanga:Perfect] Mem:4 Exits:ES>
c 'sil'syl
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Scaramanga misses Jonny with his hit.
Jonny slashes Scaramanga very hard.
Jonny is burned, as he swings at Scaramanga.
Alec cleaves Vayn hard.
Moonglum massacres Sokrates with his slash.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> c 'sil'sylvice
You utter the words, 'silence'
The magic fails!
386H 150V 1X 22.02% 96C Mem:4 Exits:ES>
Vayn focuses harshly on Sokrates and utters the words, 'soul leech'.
Sokrates shudders with agony as pain lashes and clamps down on his
soul.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> !
Scaramanga panics, and attempts to flee.
Scaramanga leaves east.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> !
Jonny staggers about confused!
Jonny massacres Sylvice with his slash.
Sokrates slashes Moonglum very hard.
Sokrates slashes Moonglum very hard.
Alec misses Vayn with his cleave.
Sylvice misses Jonny with his drain.
Moonglum slashes Sokrates extremely hard.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES>
Scaramanga arrives from the east.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES>
Moonglum tries to sweep Sokrates's legs, but misses badly.
386H 150V 1X 22.02% 96C Mem:4 Exits:ES> You utter the words, 'silence'
The magic fails!
386H 150V 1X 22.02% 96C Mem:5 Exits:ES>
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
386H 150V 1X 22.02% 96C Mem:5 Exits:ES>
Scaramanga utters some strange words.
Scaramanga's hands issue a spray of prismatic color!
You are caught in a spray of shimmering red!
You feel a slight chill.
Mavlad the bronze dragon is blasted by a spray of scintillating blue!
Jonny is caught in a spray of radiant yellow!
Vayn is caught in a spray of radiant yellow!
Vayn is caught in a spray of bright orange!
Moonglum is struck by a spray of murky violet!
355H 150V 1X 22.02% 96C [Me:Fair] [Scaramanga:V.Good] Mem:5 Exits:ES>
Sylvice utters the words, 'cure critical'.
355H 150V 1X 22.02% 96C [Me:Fair] [Scaramanga:V.Good] Mem:5 Exits:ES>
Jonny attempts to strike at Sylvice with his halberd.
Jonny slashes Sylvice extremely hard.
355H 150V 1X 22.02% 96C [Me:Fair] [Scaramanga:V.Good] Mem:5 Exits:ES>
grou
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Scaramanga misses Jonny with his hit.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum very hard.
Alec massacres Vayn with his cleave.
Vayn annihilates Sokrates with his slash.
Vayn annihilates Sokrates with his stab.
Vayn annihilates Sokrates with his slash.
Moonglum massacres Sokrates with his slash.
355H 150V 1X 22.02% 96C Mem:5 Exits:ES> sun
Sokrates steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
355H 150V 1X 22.02% 96C Mem:5 Exits:ES> sunYour group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested standing Y N N N Y 0 5
Moonglum good rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
355H 150V 1X 22.02% 96C Mem:5 Exits:ES> sun scaramanga
Scaramanga utters some strange words.
Scaramanga's hands issue a spray of prismatic color!
You are caught in a spray of shimmering red!
You feel a slight chill.
Mavlad the bronze dragon is caught in a spray of shimmering red!
Jonny is blasted by a spray of scintillating blue!
Jonny freezes in place.
Vayn is caught in a spray of radiant yellow!
Moonglum is blasted by a spray of scintillating blue!
340H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Fair] [Scaramanga:V.Good]
Mem:5 Exits:ES> You utter the
words, 'sunbolt'
Scaramanga withers as a ray of sunlight engulfs him!
The magic fails!
340H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Fair] [Scaramanga:Good] Mem:5
Exits:ES>
Sokrates stands up.
340H 150V 1X 22.02% 96C [Me:Fair] [Jonny:Fair] [Scaramanga:Good] Mem:5
Exits:ES>
Sokrates heroically rescues Scaramanga.
340H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:5 Exits:ES> !
Vayn focuses harshly on Sokrates and utters the words, 'soul leech'.
Sokrates shudders with agony as pain lashes and clamps down on his
soul.
340H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:V.Bad] Mem:5 Exits:ES> !
Jonny staggers about confused!
You miss Sokrates with your sting.
Sokrates slashes YOU hard.
Sokrates bruises YOU with his slash.
Alec misses Vayn with his cleave.
Sylvice drains Jonny extremely hard.
Moonglum slashes Sokrates hard.
331H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:V.Bad] Mem:5 Exits:ES> !
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
331H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Good] Mem:5 Exits:ES> !
Alec focuses on Sokrates and utters the words, 'cure critical'.
331H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:V.Good] Mem:5 Exits:ES>
grou
Scaramanga utters some strange
words.
Scaramanga's hands issue a spray of prismatic color!
You are caught in a spray of radiant yellow!
You feel a slight chill.
Mavlad the bronze dragon is hit by a spray of gleaming indigo!
Mavlad the bronze dragon shudders.
Jonny is caught in a spray of shimmering red!
Vayn is hit by a spray of gleaming indigo!
Moonglum is blasted by a spray of scintillating blue!
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested fighting Y N N N Y 0 5
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
317H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:V.Good] Mem:5 Exits:ES> cc
me
You utter the words, 'cure
critical'
Large open gashes on your body stop bleeding and heal.
401H 150V 1X 22.02% 96C [Me:Good] [Sokrates:V.Good] Mem:6 Exits:ES>
Vayn gazes at Sokrates with a look of evilness.
401H 150V 1X 22.02% 96C [Me:Good] [Sokrates:V.Good] Mem:6 Exits:ES>
Jonny staggers about confused!
Sokrates slashes YOU hard.
Sokrates slashes YOU hard.
Vayn misses Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Vayn massacres Sokrates with his slash.
Moonglum slashes Sokrates very hard.
384H 150V 1X 22.02% 96C [Me:Good] [Sokrates:Good] Mem:6 Exits:ES>
Sokrates gives Matai the fearsome blue dragon an order.
Matai the fearsome blue dragon barely claws YOU.
381H 150V 1X 22.02% 96C [Me:Good] [Sokrates:Good] Mem:6 Exits:ES>
Sokrates attacks with lightning fast series of attacks that leaves you
defenseless.
381H 150V 1X 22.02% 96C [Me:Good] [Sokrates:Good] Mem:6 Exits:ES>
Moonglum stands up.
381H 150V 1X 22.02% 96C [Me:Good] [Sokrates:Good] Mem:6 Exits:ES>
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
381H 150V 1X 22.02% 96C [Me:Good] [Sokrates:Good] Mem:6 Exits:ES> grou
Jonny staggers about confused!
Matai the fearsome blue dragon claws YOU hard.
Matai the fearsome blue dragon claws YOU.
You miss Sokrates with your sting.
Sokrates slashes YOU extremely hard.
Sokrates slashes YOU.
Mavlad the bronze dragon misses Scaramanga with his hit.
Alec misses Vayn with his cleave.
Vayn annihilates Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn massacres Sokrates with his stab.
Vayn massacres Sokrates with his slash.
Sylvice drains Jonny very hard.
Moonglum slashes Sokrates very hard.
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES>
Scaramanga sighs and stops studying.
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> gt
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> gt
bash scarama
Alec utters some strange words.
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> gt
bash scaramangYour group of 4 members consists
of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested fighting Y N N N Y 0 6
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested standing Y N N N Y 0 1
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> gt
bash scaramanga
You tell your group 'bash
scaramanga'
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> !
You tell your group 'bash
scaramanga'
346H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> !
Matai the fearsome blue dragon hits you with a lightning breath.
326H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> You
tell your group 'bash
scaramanga'
326H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> grou
Matai the fearsome blue dragon claws YOU.
Sokrates slashes YOU very hard.
Sokrates slashes YOU hard.
Vayn massacres Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Vayn annihilates Sokrates with his slash.
Sylvice drains Jonny extremely hard.
Moonglum slashes Sokrates extremely hard.
Vayn tells your group 'tick in 10'
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> grou
Your group of 4 members consists
of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested fighting Y N N N Y 0 6
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES>
Sylvice focuses on Sokrates and utters the words, 'cure critical'.
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> grou
Your group of 4 members consists
of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere fair rested fighting Y N N N Y 0 6
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES>
Moonglum crashes into Sylvice in a thundering collision, knocking him
to the ground!
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Fair] Mem:6 Exits:ES> c
'harm'
You utter the words, 'harm'
You grab Sokrates, who screams in pain.
301H 150V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> !
You return to your normal fighting style.
Matai the fearsome blue dragon claws YOU.
Matai the fearsome blue dragon barely claws YOU.
Sokrates slashes YOU.
Sokrates slashes YOU hard.
Alec massacres Vayn with his cleave.
Vayn annihilates Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn annihilates Sokrates with his stab.
Moonglum slashes Sokrates extremely hard.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:V.Bad] Mem:6 Exits:ES>
Alec focuses on Sokrates and utters the words, 'cure critical'.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES>
Scaramanga arrives from the south.
Sokrates stands up.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> c
Scaramanga utters some strange words.
You fall down, your ears ringing.
Mavlad the bronze dragon is stunned!
Jonny is stunned!
Vayn is stunned momentarily, recovering quickly.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> c 'h
Sokrates gazes at you with a look of evilness.
You feel a slight chill.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> c
'harm'sakYou are completely disoriented.
295H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> c
'harm'sakrato
Scaramanga misses Vayn with his hit.
Matai the fearsome blue dragon claws YOU hard.
Matai the fearsome blue dragon claws YOU.
Sokrates slashes YOU very hard.
Sokrates slashes YOU very hard.
Vayn misses Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Sylvice drains Jonny extremely hard.
Moonglum slashes Sokrates hard.
259H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES> c
'harm'sakrates
You are completely disoriented.
259H 158V 1X 22.02% 96C [Me:Fair] [Sokrates:Bad] Mem:6 Exits:ES>
Moonglum comes to your rescue! You're thankful, but a bit dazed.
259H 158V 1X 22.02% 96C Mem:6 Exits:ES> gt
Alec wiggles his fingers as he outlines your head in the air.
259H 158V 1X 22.02% 96C Mem:6 Exits:ES> gt stunned
You tell your group 'stunned'
259H 158V 1X 22.02% 96C Mem:6 Exits:ES> g
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum extremely hard.
Moonglum massacres Sokrates with his slash.
Matai the fearsome blue dragon claws YOU hard.
Alec misses Vayn with his cleave.
Vayn massacres Sokrates with his slash.
Vayn stabs Sokrates very hard.
Sylvice drains Jonny hard.
Their opponent, making them recoil momentarily in horror.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt
Sylvice stands up.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me
Scaramanga utters the words, 'yirebo'.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me in
Sokrates weakly gazes at Moonglum.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me in comba
Sokrates gives Matai the fearsome blue dragon an order.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me in comba
Sokrates attacks Moonglum with lightning fast series of attacks that
leaves him defenseless.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me in combbat
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> gt keep me in combbat
You tell
your group 'keej ma in coPbbat'
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES>
Jonny tells your group 'stunned'
249H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> sc
You stagger about confused!
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum hard.
Moonglum slashes Sokrates very hard.
Matai the fearsome blue dragon claws YOU hard.
Alec cleaves Vayn very hard.
Vayn massacres Sokrates with his slash.
Vayn stabs Sokrates extremely hard.
242H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> sc
You are
Mr. Belvedere, A Gentleman's Gentleman, a level 30 Cleric.
You are an Elder in Vague Ambition.
You are rank 19. You have completed 22.02% of your next rank.
You are 77 years old.
You have 242(480) hit and 158(158) movement points.
Your behaviour has been Evil.
The warmth of good envelops your soul.
You have scored 89999999 exp, and have 96(27997) steel coins.
You need 1 more experience to advance.
You have died 11 horrible deaths.
You have been connected for 38 minute(s).
You have been playing for 9 day(s), 21 hour(s) and 32 minute(s).
Your equipment is currently being concealed.
You could comfortably carry more.
You are sitting.
You are flying.
You are fighting Matai the fearsome blue dragon.
You are guarded by Jonny.
You are affected by the following:
power word stun
fly
sacred ward
protection from good
heroism
steelskin
242H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES>
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
242H 158V 1X 22.02% 96C [Me:Fair] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES>
Scaramanga utters some strange words.
You are enveloped in flames from a fireball sent by Scaramanga!
Scaramanga smirks as his fireball explodes into the face of Mavlad the
bronze dragon.
Scaramanga smirks as his fireball explodes into the face of Jonny.
Scaramanga smirks as his fireball explodes into the face of Vayn.
Scaramanga smirks as his fireball explodes into the face of Moonglum.
184H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
184H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
184H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You stagger about confused!
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum extremely hard.
Moonglum massacres Sokrates with his slash.
Matai the fearsome blue dragon claws YOU hard.
Alec massacres Vayn with his cleave.
Vayn misses Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Sylvice barely drains Jonny.
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES>
Alec focuses on Sokrates and utters the words, 'cure critical'.
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
Vayn utters some strange words.
Vez the fearsome blue dragon suddenly appears!
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Sokrates heroically rescues Scaramanga.
177H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
Sylvice utters the words, 'sunray'.
Sylvice's hands send forth blinding rays of sunlight!
Sylvice turns Vez the fearsome blue dragon to ashes with brilliant rays
of sunlight.
Vez the fearsome blue dragon has been defeated.
There is a flash of light and then Vez the fearsome blue dragon is
gone.
You wither as a ray of sunlight engulfs you!
You feel a slight chill.
Mavlad the bronze dragon withers as a ray of sunlight sent by Sylvice
engulfs him!
Jonny withers as a ray of sunlight sent by Sylvice engulfs him!
Vayn withers as a ray of sunlight sent by Sylvice engulfs him!
Moonglum withers as a ray of sunlight sent by Sylvice engulfs him!
149H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
149H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
149H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You stagger about confused!
Sokrates massacres Mavlad the bronze dragon with his slash.
Sokrates slashes Mavlad the bronze dragon extremely hard.
Mavlad the bronze dragon has been defeated.
There is a flash of light and then Mavlad the bronze dragon is gone.
Moonglum slashes Sokrates very hard.
Matai the fearsome blue dragon claws YOU hard.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
Moonglum crashes into Scaramanga in a thundering collision, knocking
him to the ground!
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
Alec panics, and attempts to flee.
Alec leaves east.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You are
completely disoriented.
142H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> st;heal me
You stagger about confused!
You direct your attention to Matai the fearsome blue dragon.
Your mind clears.
You should probably stand up!
You miss Matai the fearsome blue dragon with your sting.
Sokrates massacres Vayn with his slash.
Sokrates misses Vayn with his slash.
Moonglum slashes Sokrates very hard.
Scaramanga misses Vayn with his hit.
Jonny slashes Sylvice extremely hard.
Matai the fearsome blue dragon bruises YOU with his claw.
Vayn massacres Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn massacres Sokrates with his stab.
Sylvice drains Jonny extremely hard.
140H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You
stand up.
140H 158V 1X 22.02% 96C [Me:V.Bad] [Matai the fearsome blue
dragon:Perfect] Mem:6 Exits:ES> You
utter the words, 'heal'
You heal yourself.
Your entire body tingles for a few seconds.
475H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES>
Alec arrives from the east.
475H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES>
Jonny stands up.
475H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES>
Sokrates heroically rescues Sylvice.
475H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES> grou
Alec massacres YOU with his cleave.
453H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES>
Jonny attempts to strike at Sokrates with his halberd.
Jonny massacres Sokrates with his slash.
453H 158V 1X 22.02% 96C [Me:V.Good] [Matai the fearsome blue
dragon:Perfect] Mem:7 Exits:ES>
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Matai the fearsome blue dragon claws Jonny.
Jonny massacres Matai the fearsome blue dragon with his slash.
Alec misses Jonny with his cleave.
Sokrates slashes Jonny extremely hard.
Sokrates slashes Jonny hard.
Moonglum slashes Sokrates very hard.
Scaramanga misses Vayn with his hit.
Vayn massacres Sokrates with his slash.
Vayn misses Sokrates with his stab.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES> Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 7
Moonglum fair rested fighting Y N N N Y 0 0
Vayn bad rested fighting Y N N N Y 0 2
Jonny v.bad rested fighting Y N N N Y 0 1
453H 158V 1X 22.02% 96C Mem:7 Exits:ES>
Vayn focuses harshly on Sokrates and utters the words, 'soul leech'.
Sokrates shudders with agony as pain lashes and clamps down on his
soul.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES>
Scaramanga steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES> heal jonny
You utter the words, 'heal'
You heal Jonny.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES>
Scaramanga stands up.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES>
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES> heal m
Matai the fearsome blue dragon misses Jonny with his claw.
Matai the fearsome blue dragon claws Jonny very hard.
Jonny massacres Matai the fearsome blue dragon with his slash.
Alec cleaves Jonny hard.
Sokrates massacres Jonny with his slash.
Sokrates misses Jonny with his slash.
Sokrates wavers under Moonglum's mighty slash!
Moonglum slashes Sokrates extremely hard.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES> heal vayn
Jonny panics, and attempts to flee.
Jonny leaves east.
453H 158V 1X 22.02% 96C Mem:7 Exits:ES> You utter the words, 'heal'
You heal Vayn.
453H 158V 1X 22.02% 96C Mem:8 Exits:ES>
Scaramanga utters some strange words.
You are stunned for a moment, but recover immediately.
Vayn is stunned!
Moonglum is stunned momentarily, recovering quickly.
453H 158V 1X 22.02% 96C [Me:V.Good] [Vayn:V.Good] [Scaramanga:Good]
Mem:8 Exits:ES>
Jonny arrives from the east.
453H 158V 1X 22.02% 96C [Me:V.Good] [Vayn:V.Good] [Scaramanga:Good]
Mem:8 Exits:ES>
You miss Scaramanga with your sting.
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum extremely hard.
Moonglum massacres Sokrates with his slash.
453H 158V 1X 22.02% 96C [Me:V.Good] [Vayn:V.Good] [Scaramanga:Good]
Mem:8 Exits:ES>
Sokrates attacks Moonglum with lightning fast series of attacks that
leaves him defenseless.
453H 158V 1X 22.02% 96C [Me:V.Good] [Vayn:V.Good] [Scaramanga:Good]
Mem:8 Exits:ES>
Jonny massacres Sokrates with his slash.
453H 158V 1X 22.02% 96C [Me:V.Good] [Vayn:V.Good] [Scaramanga:Good]
Mem:8 Exits:ES> c 'sunr'
Scaramanga panics, and attempts to flee.
Scaramanga leaves east.
453H 158V 1X 22.02% 96C Mem:8 Exits:ES> c 'sunr'
You utter the words, 'sunray'
Your hands send forth blinding rays of sunlight!
Alec withers as a ray of sunlight engulfs him!
Sylvice withers as a ray of sunlight engulfs him!
Matai the fearsome blue dragon withers as a ray of sunlight engulfs
him!
Matai the fearsome blue dragon seems to be blinded!
Sokrates withers as a ray of sunlight engulfs him!
453H 158V 1X 22.02% 96C [Me:V.Good] [Alec:V.Good] Mem:8 Exits:ES>
Scaramanga arrives from the east.
453H 158V 1X 22.02% 96C [Me:V.Good] [Alec:V.Good] Mem:8 Exits:ES>
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Alec misses Jonny with his cleave.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Matai the fearsome blue dragon claws Jonny hard.
Matai the fearsome blue dragon misses Jonny with his claw.
Sylvice's blow is absorbed by your armor.
You. You can't help but shrink back in fear.
You feel a slight chill.
Sokrates massacres Moonglum with his slash.
Sokrates massacres Moonglum with his slash.
Moonglum slashes Sokrates extremely hard.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Alec focuses on Sokrates and utters some strange words.
Sokrates's skin takes an earthen hue.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Sokrates gazes at Moonglum with a look of evilness.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Moonglum stands up.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Sylvice utters the words, 'qjq fut'.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Jonny is hit by Matai the fearsome blue dragon's lightning breath.
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES> grou
Your group of 4 members consists
of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested fighting Y N N N Y 0 8
Moonglum v.bad rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny good rested fighting Y N N N Y 0 1
453H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
You miss Sylvice with your sting.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Matai the fearsome blue dragon misses Jonny with his claw.
Matai the fearsome blue dragon misses Jonny with his claw.
Sylvice drains YOU hard.
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum slashes Sokrates very hard.
446H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES> heal
m
Sylvice focuses on Sokrates and utters the words, 'cure critical'.
446H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES> heal
moonglum
Your casting is disrupted by the
fighting!
446H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES>
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
446H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:8 Exits:ES> !
You utter the words, 'heal'
You heal Moonglum.
446H 158V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:9 Exits:ES>
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Sylvice drains Jonny very hard.
Jonny slashes Sylvice extremely hard.
Alec cleaves Jonny hard.
Matai the fearsome blue dragon misses Jonny with his claw.
Matai the fearsome blue dragon claws Jonny very hard.
Sokrates misses Moonglum with his slash.
Sokrates slashes Moonglum very hard.
Moonglum slashes Sokrates very hard.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Moonglum spasms as Sokrates places his hand on Moonglum's chest.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Vayn tells your group 'tick in 10'
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> g
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> gt bash
Sylvice misses Jonny with his drain.
Jonny slashes Sylvice extremely hard.
Alec cleaves Jonny hard.
Matai the fearsome blue dragon misses Jonny with his claw.
Matai the fearsome blue dragon claws Jonny hard.
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum massacres Sokrates with his slash.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> gt bash
Alec stands up.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> gt bash sylv
Alec panics, and attempts to flee.
Alec leaves east.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> gt bash sylvice now
You tell your group 'bash sylvice now'
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> !
Alec arrives from the east.
Jonny hugs himself gleefully for no apparent reason.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> You tell your group 'bash
sylvice now'
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> !
Jonny focuses his purity on Sylvice's head!
Jonny focuses on Sylvice's head, but is thwarted.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> !
You tell your group 'bash sylvice now'
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> You tell your group 'bash
sylvice now'
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Scaramanga leaves south.
Alec leaves south.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum good rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> m
Sylvice drains Jonny extremely hard.
Jonny slashes Sylvice extremely hard.
Matai the fearsome blue dragon misses Jonny with his claw.
Moonglum wavers under Sokrates's mighty slash!
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum slashes Sokrates very hard.
Vayn massacres Sokrates with his slash.
Vayn stabs Sokrates extremely hard.
Spells currently memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]hold person
[ 1]prayer [ 1]sacred ward [ 1]sanctuary
5: [ 4]cure critical [ 1]fortify self [ 1]holy aura
6: [ 6]harm
7: [ 1]strength of one [ 2]sunbolt
Spells being memorized:
2: [ 2]silence
4: [ 1]heroism [ 1]sacred ward
5: [ 2]cure critical
6: [ 8]harm
7: [ 1]sunbolt
8: [ 1]gate [ 1]steelskin [ 3]sunray
You estimate your studies will complete in 9 (game) hours.
[return for more, q to stop]
Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-0 8-0
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Vayn stands up.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Sylvice panics, and attempts to flee.
Sylvice leaves south.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> grou
Jonny attempts to strike at Matai the fearsome blue dragon with his
halberd.
Jonny massacres Matai the fearsome blue dragon with his slash.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum good rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
446H 158V 1X 22.02% 96C Mem:9 Exits:ES>
Alec arrives from the east.
446H 158V 1X 22.02% 96C Mem:9 Exits:ES> cc vay
Jonny massacres Matai the fearsome blue dragon with his slash.
Matai the fearsome blue dragon misses Jonny with his claw.
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum slashes Sokrates extremely hard.
Vayn massacres Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn stabs Sokrates extremely hard.
Alec misses Jonny with his cleave.
464H 158V 1X 22.02% 96C Mem:8 Exits:ES> cc vayn
You utter the words, 'cure critical'
464H 158V 1X 22.02% 96C Mem:8 Exits:ES>
Scaramanga arrives from the south.
464H 158V 1X 22.02% 96C Mem:8 Exits:ES>
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
464H 158V 1X 22.02% 96C Mem:8 Exits:ES>
Scaramanga utters some strange words.
Jonny is stunned momentarily, recovering quickly.
You are stunned for a moment, but recover immediately.
Vayn is stunned momentarily, recovering quickly.
Moonglum is stunned momentarily, recovering quickly.
464H 158V 1X 22.02% 96C [Me:V.Good] [Jonny:Fair] [Scaramanga:Good]
Mem:8 Exits:ES>
Jonny panics, and attempts to flee.
Jonny leaves east.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
cc jonn
Scaramanga misses you with his hit.
Sokrates slashes Moonglum hard.
Sokrates slashes Moonglum very hard.
Moonglum slashes Sokrates very hard.
Vayn annihilates Sokrates with his slash.
Vayn massacres Sokrates with his stab.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
cc jonny
Who should the spell be cast
upon?
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
Vayn utters some strange words.
Vez the fearsome blue dragon suddenly appears!
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES> g
Vayn gives Vez the fearsome blue dragon an order.
Vez the fearsome blue dragon misses Sokrates with his claw.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
grou
Scaramanga utters some strange words.
Vez the fearsome blue dragon is stunned momentarily, recovering
quickly.
You are stunned for a moment, but recover immediately.
Vayn is stunned!
Moonglum is stunned!
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
grou
Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested fighting Y N N N Y 0 8
Moonglum good rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny fair rested standing Y N N N N 0 1
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
Alec wiggles his fingers as he outlines your head in the air.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
You stagger about confused!
You direct your attention to Scaramanga.
You miss Scaramanga with your sting.
Vez the fearsome blue dragon claws Sokrates hard.
Vez the fearsome blue dragon claws Sokrates hard.
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum extremely hard.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
grou
Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested fighting Y N N N Y 0 8
Moonglum fair rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny fair rested standing Y N N N N 0 1
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
Sokrates stands up.
464H 158V 1X 22.02% 96C [Me:V.Good] [Scaramanga:Good] Mem:8 Exits:ES>
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
464H 158V 1X 22.02% 96C Mem:8 Exits:ES> sc
You are Mr. Belvedere, A Gentleman's Gentleman, a level 30
Cleric.
You are an Elder in Vague Ambition.
You are rank 19. You have completed 22.02% of your next rank.
You are 77 years old.
You have 464(480) hit and 158(158) movement points.
Your behaviour has been Evil.
The warmth of good envelops your soul.
You have scored 89999999 exp, and have 96(27997) steel coins.
You need 1 more experience to advance.
You have died 11 horrible deaths.
You have been connected for 39 minute(s).
You have been playing for 9 day(s), 21 hour(s) and 33 minute(s).
Your equipment is currently being concealed.
You could comfortably carry more.
You are standing.
You are flying.
You are guarded by Jonny.
You are affected by the following:
fly
sacred ward
protection from good
heroism
steelskin
464H 158V 1X 22.02% 96C Mem:8 Exits:ES>
Alec massacres YOU with his cleave.
441H 158V 1X 22.02% 96C [Me:V.Good] [Alec:Good] Mem:8 Exits:ES>
Scaramanga arrives from the south.
441H 158V 1X 22.02% 96C [Me:V.Good] [Alec:Good] Mem:8 Exits:ES> fle
Sylvice arrives from the south.
Sokrates is hit by Vez the fearsome blue dragon's lightning breath.
441H 158V 1X 22.02% 96C [Me:V.Good] [Alec:Good] Mem:8 Exits:ES> !You
flee head over heels.
The Arena of Champions
441H 156V 1X 22.02% 96C Mem:8 Exits:NES> !
You're not fighting, why bother fleeing?
441H 156V 1X 22.02% 96C Mem:8 Exits:NES> !
You're not fighting, why bother fleeing?
441H 156V 1X 22.02% 96C Mem:8 Exits:NES> sca
Looking north:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Vayn.
(flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here, fighting Vayn. (flying)
. . . is enveloped in flames.
Vez the fearsome blue dragon is sitting here, fighting Sokrates.
<Rngd> Alec, Trained in Archaeology is standing here. (flying)
. . . enveloped in shadows.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here,
fighting Moonglum. (flying)
. . . has an earthen hue.
<VA> Vayn, Thinks the Song is About Him is sitting here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is sitting here, fighting Sokrates. (flying)
. . . has a tough exterior.
Looking east:
You see nothing special.
<VA> Jonny the Male Human is standing here. (flying)
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 156V 1X 22.02% 96C Mem:8 Exits:NES> e
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 154V 1X 22.02% 96C Mem:8 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 154V 1X 22.02% 96C Mem:8 Exits:NESW> w
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 152V 1X 22.02% 96C Mem:8 Exits:NES> sca
Looking north:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Vayn.
(flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here, fighting Vayn. (flying)
. . . is enveloped in flames.
Vez the fearsome blue dragon is sitting here, fighting Sokrates.
<Rngd> Alec, Trained in Archaeology is standing here. (flying)
. . . enveloped in shadows.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here,
fighting Moonglum. (flying)
. . . has an earthen hue.
<VA> Vayn, Thinks the Song is About Him is sitting here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is sitting here, fighting Sokrates. (flying)
. . . has a tough exterior.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 152V 1X 22.02% 96C Mem:8 Exits:NES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 8
Moonglum fair rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 152V 1X 22.02% 96C Mem:8 Exits:NES> s
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 150V 1X 22.02% 96C Mem:8 Exits:NE> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 8
Moonglum fair rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 150V 1X 22.02% 96C Mem:8 Exits:NE> #tickon
#TICKER IS NOW ON.
grou
Moonglum tells your group 'disoriented'
441H 150V 1X 22.02% 96C Mem:8 Exits:NE> Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 8
Moonglum fair rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 150V 1X 22.02% 96C Mem:8 Exits:NE> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 150V 1X 22.02% 96C Mem:8 Exits:NE> n
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 148V 1X 22.02% 96C Mem:8 Exits:NEW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 148V 1X 22.02% 96C Mem:8 Exits:NEW> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 8
Moonglum fair rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 148V 1X 22.02% 96C Mem:8 Exits:NEW> n
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 146V 1X 22.02% 96C Mem:8 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 146V 1X 22.02% 96C Mem:8 Exits:NESW> w
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 144V 1X 22.02% 96C Mem:8 Exits:NES> sca
Looking north:
You see nothing special.
<Rngd> Alec, Trained in Archaeology is standing here, fighting
Moonglum. (flying)
. . . enveloped in shadows.
<Rngd> Mr Scaramanga is standing here, fighting Moonglum. (flying)
. . . is enveloped in flames.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Vayn.
(flying)
. . . has a metallic luster.
Vez the fearsome blue dragon is sitting here, fighting Sokrates.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here,
fighting Moonglum. (flying)
. . . has an earthen hue.
<VA> Vayn, Thinks the Song is About Him is sitting here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is sitting here, fighting Sokrates. (flying)
. . . has a tough exterior.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
441H 144V 1X 22.02% 96C Mem:8 Exits:NES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 8
Moonglum bad rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 144V 1X 22.02% 96C Mem:8 Exits:NES> n;heal moonglum
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<Rngd> Alec, Trained in Archaeology is standing here, fighting
Moonglum. (flying)
. . . enveloped in shadows.
<Rngd> Mr Scaramanga is standing here, fighting Moonglum. (flying)
. . . is enveloped in flames.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Vayn.
(flying)
. . . has a metallic luster.
Vez the fearsome blue dragon is sitting here, fighting Sokrates.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here,
fighting Moonglum. (flying)
. . . has an earthen hue.
<VA> Vayn, Thinks the Song is About Him is sitting here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is sitting here, fighting Sokrates. (flying)
. . . has a tough exterior.
441H 142V 1X 22.02% 96C Mem:8 Exits:ES> You utter the words, 'heal'
You heal Moonglum.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Alec annihilates Moonglum with his cleave.
Sylvice drains Vayn extremely hard.
Their opponent, making them recoil momentarily in horror.
Sokrates slashes Moonglum extremely hard.
Sokrates massacres Moonglum with his slash.
Vayn slashes Sokrates extremely hard.
Vayn stabs Sokrates very hard.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Vayn stands up.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Alec focuses harshly on Moonglum and utters some strange words.
Alec throws a handful of sticks at Moonglum, but they turn into snakes
in midflight!
Moonglum screams in pain as a snake tears into his flesh.
Moonglum screams in pain as a snake tears into his flesh.
Moonglum screams in pain as a snake tears into his flesh.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Jonny slashes Sylvice extremely hard.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum good rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> g
Jonny massacres Sylvice with his slash.
Sylvice drains Vayn very hard.
Sokrates slashes Moonglum extremely hard.
Sokrates misses Moonglum with his slash.
Moonglum slashes Sokrates very hard.
Vayn slashes Sokrates extremely hard.
Vayn stabs Sokrates hard.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt
Vayn gives Vez the fearsome blue dragon an order.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt b
Sokrates attacks Moonglum with lightning fast series of attacks that
leaves him defenseless.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt bash al
Vayn gives Vez the fearsome blue dragon an order.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt bash alec now
You tell your group 'rash alec noF'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> !
You tell your group 'bash alec now'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> !
Alec focuses on Sokrates and utters some strange words.
Sokrates's wounds begin to heal.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gYou tell your group 'banh awec
now'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt
Vayn gives Vez the fearsome blue dragon an order.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt
Jonny slashes Sylvice extremely hard.
Sylvice drains Vayn hard.
Vez the fearsome blue dragon misses Sokrates with his claw.
Sokrates slashes Moonglum extremely hard.
Sokrates massacres Moonglum with his slash.
Moonglum slashes Sokrates very hard.
Vayn massacres Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Scaramanga focuses harshly on Moonglum and utters the words, 'silence'.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt sylvic
Sokrates gives Matai the fearsome blue dragon an order.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt sylvice out of heals
You tell your group 'nylvice out of TeIls'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Vayn attempts to impair Sokrates, but he is outmaneuvered instead.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> Your group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Jonny slashes Sylvice extremely hard.
Alec massacres Moonglum with his cleave.
Sylvice barely drains Vayn.
Vez the fearsome blue dragon claws Sokrates very hard.
Vez the fearsome blue dragon claws Sokrates very hard.
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum extremely hard.
Moonglum slashes Sokrates hard.
Vayn massacres Sokrates with his slash.
Vayn stabs Sokrates extremely hard.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> l
Moonglum stands up.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> l sylvic
Jonny attempts to focus on Sylvice and fails horribly.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> l sylvice
You see nothing special about him.
<CRZY> Sylvice the elder male silvanesti has quite a few wounds.
Elder of Crazy Clan.
Sylvice is using:
<worn on finger> a green metal ring..it glows dimly
<worn around neck> a dwarven holy symbol..it glows blue..it glows dimly
<worn on head> a tainted silver diadem..it glows blue
<worn on hands> a pair of fingerless writing gloves..it glows blue
<worn as shield> a shield encrusted with malachites..it glows dimly
<worn about body> a furry white cloak..it glows blue
<worn around right wrist> a bracelet of blackened rodent skulls..it
glows blue
<worn around left wrist> a glowing bracer..it glows blue..it glows
dimly
<used in primary hand> the rod of terror..it glows blue
<held in secondary hand> a chunk of golden amber..it glows blue
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gr
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Alec focuses on Sylvice and utters the words, 'cure critical'.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt bash ALE
Jonny slashes Sylvice extremely hard.
Vez the fearsome blue dragon claws Sokrates very hard.
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum extremely hard.
Moonglum massacres Sokrates with his slash.
Vayn annihilates Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn massacres Sokrates with his stab.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt bash ALEC
You tell your group 'bash IREC'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> !
You tell your group 'bish EPEC'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 1
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt b
Jonny attempts to strike at Sylvice with his halberd.
Jonny massacres Sylvice with his slash.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt B
Scaramanga focuses harshly on Moonglum and utters the words, 'silence'.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt BASH
Sylvice panics, and attempts to flee.
Sylvice leaves east.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> gt BASH ALEC
You tell your group 'BASH ALEC'
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Alec misses Moonglum with his cleave.
Vez the fearsome blue dragon misses Sokrates with his claw.
Vez the fearsome blue dragon claws Sokrates very hard.
Sokrates slashes Moonglum very hard.
Sokrates barely slashes Moonglum.
Moonglum massacres Sokrates with his slash.
Vayn annihilates Sokrates with his slash.
Vayn massacres Sokrates with his stab.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 9
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested standing Y N N N Y 0 1
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Alec screams wildly and cusses at Moonglum.
Moonglum briefly reveals a red aura!
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> m
Spells currently memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]hold person
[ 1]prayer [ 1]sacred ward [ 1]sanctuary
5: [ 3]cure critical [ 1]fortify self [ 1]holy aura
6: [ 5]harm
7: [ 1]strength of one [ 2]sunbolt
Spells being memorized:
2: [ 2]silence
4: [ 1]heroism [ 1]sacred ward
5: [ 3]cure critical
6: [ 9]harm
7: [ 1]sunbolt
8: [ 1]gate [ 1]steelskin [ 3]sunray
You estimate your studies will complete in 9 (game) hours.
[return for more, q to stop]
Spells left (level-number): 1-0 2-0 3-0 4-0 5-0 6-0 7-0 8-0
Sokrates stands up.
Vayn tries to attack Alec but stops with a confused look on his face.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Sokrates gazes at Moonglum with a look of evilness.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Scaramanga panics, and attempts to flee.
Scaramanga leaves east.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> m sto
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> m sto
Alec misses Moonglum with his cleave.
Vez the fearsome blue dragon claws Sokrates hard.
Vez the fearsome blue dragon misses Sokrates with his claw.
Sokrates slashes Moonglum extremely hard.
Sokrates slashes Moonglum very hard.
Moonglum slashes Sokrates extremely hard.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES>
Jonny leaves east.
441H 142V 1X 22.02% 96C Mem:9 Exits:ES> sYou sigh and hastily abandon
your studies.
441H 142V 1X 22.02% 96C Exits:ES> s a
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
441H 140V 1X 22.02% 96C Exits:ESW> s
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<Rngd> Mr Scaramanga is resting here. (flying)
. . . is enveloped in flames.
441H 138V 1X 22.02% 96C Exits:NESW> r
You rest your tired bones but stay aloft.
441H 138V 1X 22.02% 96C Exits:NESW>
Jonny annihilates Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
441H 138V 1X 22.02% 96C Exits:NESW> m
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Scaramanga misses Jonny with his hit.
441H 138V 1X 22.02% 96C Exits:NESW> m 'harm'
You open up your prayerbook and begin studying it.
harm: added to your list
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW> !
Scaramanga stands up.
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW> harm: added to your list
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW>
Scaramanga panics, and attempts to flee.
Scaramanga leaves north.
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW> !
harm: added to your list
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW>
Vayn tells your group 'tick in 10'
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW> #TICK-10
!
harm: added to your list
441H 138V 1X 22.02% 96C Mem:1 Exits:NESW> grou
#OK NEW TICKSIZE SET
#OK NEW TICKSIZE SET
Your studies complete, you close your prayerbook with a
smile.
Jonny closes his prayerbook with a content look on his face.
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested resting Y N N N Y 0 0
Moonglum v.bad rested fighting Y N N N N 0 0
Vayn good rested fighting Y N N N N 0 2
Jonny fair rested standing Y N N N Y 0 0
464H 158V 1X 22.02% 96C Exits:NESW> st
You stand up.
464H 158V 1X 22.02% 96C Exits:NESW> n
Sylvice arrives from the east.
464H 158V 1X 22.02% 96C Exits:NESW>
Sylvice leaves west.
464H 158V 1X 22.02% 96C Exits:NESW> n
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
464H 156V 1X 22.02% 96C Exits:ESW> hAlas, you cannot go that way...
464H 156V 1X 22.02% 96C Exits:ESW> w
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here, fighting Vez the fearsome blue
dragon. (flying)
. . . is enveloped in flames.
<Rngd> Alec, Trained in Archaeology is standing here, fighting
Moonglum. (flying)
. . . enveloped in shadows.
Vez the fearsome blue dragon is sitting here, fighting Sokrates.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is standing here,
fighting Moonglum. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
464H 154V 1X 22.02% 96C Exits:ES> sca
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
464H 154V 1X 22.02% 96C Exits:ES> sca
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
464H 154V 1X 22.02% 96C Exits:ES> gLooking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
464H 154V 1X 22.02% 96C Exits:ES> grou
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
Scaramanga misses Vez the fearsome blue dragon with his hit.
Vayn massacres Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Alec misses Moonglum with his cleave.
Vez the fearsome blue dragon claws Sokrates very hard.
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum very hard.
Moonglum slashes Sokrates extremely hard.
Moonglum crashes into Sokrates in a thundering collision, knocking him
to the ground!
464H 154V 1X 22.02% 96C Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 0
Moonglum v.bad rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C Exits:ES> heal moon
Alec screams wildly and cusses at Moonglum.
Moonglum briefly reveals a red aura!
Moonglum groans and stumbles back.
464H 154V 1X 22.02% 96C Exits:ES> heal moonglum
You utter the words, 'heal'
You heal Moonglum.
464H 154V 1X 22.02% 96C Mem:1 Exits:ES> g
Scaramanga utters some strange words.
You are stunned for a moment, but recover immediately.
Vez the fearsome blue dragon is stunned!
Vayn is stunned momentarily, recovering quickly.
Moonglum is stunned!
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> gt MO
You stagger about confused!
Your mind clears.
You miss Scaramanga with your sting.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
Vayn annihilates Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn annihilates Sokrates with his stab.
Alec annihilates Moonglum with his cleave.
Sokrates slashes Moonglum very hard.
Sokrates massacres Moonglum with his slash.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> gt MOONG
Jonny focuses his purity on Scaramanga's leg!
Jonny forces Scaramanga to the ground.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> gt MOONGLU
Vayn unsuccessfully tries to save Moonglum.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> gt MOONGLUM BASH #TICK+10
gt MOONGLUM BASH
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> gt MOONGLUM BASH ALEC
You tell your group 'MOONGLUM BASH ALEC'
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Fair] Mem:1
Exits:ES> he
You miss Scaramanga with your sting.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Scaramanga bruises Vez the fearsome blue dragon with his hit.
Vayn annihilates Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Alec annihilates Moonglum with his cleave.
Sokrates massacres Moonglum with his slash.
Sokrates slashes Moonglum very hard.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Bad] Mem:1
Exits:ES>
Jonny attempts to strike at Scaramanga with his halberd.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES> !
You tell your group 'MOONGLUM BASH ALEC'
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested fighting Y N N N Y 0 1
Moonglum good rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES> su
Alec wiggles his fingers as he outlines your head in the air.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:1
Exits:ES> sun
You utter the words, 'sunbolt'
Scaramanga withers as a ray of sunlight engulfs him!
The magic fails!
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:2
Exits:ES>
Sokrates stands up.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:2
Exits:ES>
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Scaramanga bruises Vez the fearsome blue dragon with his hit.
Vayn massacres Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn stabs Sokrates extremely hard.
Alec massacres Moonglum with his cleave.
Sokrates massacres Moonglum with his slash.
Sokrates massacres Moonglum with his slash.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Bad] Mem:2
Exits:ES>
Jonny attempts to strike at Scaramanga with his halberd.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:Awful] Mem:2
Exits:ES> !
Sylvice focuses on Scaramanga and utters the words, 'heal'.
Sylvice heals Scaramanga.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Good] Mem:2
Exits:ES>
Alec utters some strange words.
Sokrates heroically rescues Scaramanga.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Good] Mem:2
Exits:ES> You utter the words, 'sunbolt'
Scaramanga withers as a ray of sunlight engulfs him!
The magic fails!
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Good] Mem:2
Exits:ES>
Scaramanga stands up.
464H 154V 1X 22.02% 96C [Me:V.Good] [Vez the fearsome blue
dragon:Awful] [Scaramanga:V.Good] Mem:2
Exits:ES>
Jonny massacres Sokrates with his slash.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Sokrates slashes Jonny hard.
Scaramanga bruises Vez the fearsome blue dragon with his hit.
Vayn massacres Sokrates with his slash.
Vayn stabs Sokrates extremely hard.
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny strikes at Sokrates, but misses completely.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn attacks Sokrates with lightning fast series of attacks that leaves
him defenseless.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Scaramanga arrives from the south.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 2
Moonglum fair rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny massacres Sokrates with his slash.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Sokrates misses Jonny with his slash.
Vayn misses Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Alec cleaves Moonglum hard.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 2
Moonglum fair rested fighting Y N N N Y 0 0
Vayn v.good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> m
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> c 'sil'al
Vayn utters some strange words.
Vez the fearsome blue dragon suddenly appears!
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> c 'sil'alec
You can't remember how to cast that spell!
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> c
Jonny annihilates Sokrates with his slash.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Moonglum slashes Sokrates extremely hard.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb
Sokrates attacks Jonny with lightning fast series of attacks that
leaves him defenseless.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb
Vayn gives Vez the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb
Moonglum tells your group 'disoriented'
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb
Scaramanga focuses harshly on Vayn and utters some strange words.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
Scaramanga AIMs a magic missile at Vayn, who staggers under the blow.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> cb sakrates
Who should the spell be cast upon?
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny slashes Sokrates extremely hard.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Vayn massacres Sokrates with his slash.
Vayn misses Sokrates with his stab.
Alec misses Moonglum with his cleave.
Moonglum slashes Sokrates extremely hard.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny attempts to focus on Sokrates and fails horribly.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> grou
Alec focuses on Scaramanga and utters the words, 'sanctuary'.
Scaramanga is surrounded by a white aura.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> grou
Sylvice leaves south.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> scaYour group of 4 members
consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 2
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Sokrates gives Matai the fearsome blue dragon an order.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> sca
Moonglum stands up.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> gLooking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere v.good rested standing Y N N N Y 0 2
Moonglum fair rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 2
Jonny fair rested fighting Y N N N Y 0 0
464H 154V 1X 22.02% 96C Mem:2 Exits:ES>
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
464H 154V 1X 22.02% 96C Mem:2 Exits:ES> s a
The Arena of Champions
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
464H 152V 1X 22.02% 96C Mem:2 Exits:NES> kil sylvice
You sting Sylvice very hard.
464H 152V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:2 Exits:NES>
You feel a blast of hot air!
464H 152V 1X 22.02% 96C [Me:V.Good] [Sylvice:Good] Mem:2 Exits:NES>
Sylvice panics, and attempts to flee.
Sylvice leaves north.
464H 152V 1X 22.02% 96C Mem:2 Exits:NES> #al j kil sylovice
#Ok. {j} aliases {kil sylovice}.
#al j kil sylvice
#Ok. {j} aliases {kil sylvice}.
n
The Arena of Champions
A fearsome blue dragon, Matai, is standing here, ignoring you.
<CRZY> Sylvice the Male Silvanesti is standing here, fighting Moonglum.
(flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is enveloped in flames.
<VA> Jonny the Male Human is standing here, fighting Sokrates. (flying)
<Rngd> Alec, Trained in Archaeology is sitting here, fighting Moonglum.
(flying)
. . . enveloped in shadows.
<BST> Sokrates, Abyssed Culprit of the Dark Queen is sitting here,
fighting Jonny. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here, fighting
Sokrates. (flying)
<VA> Lord Moonglum is standing here, fighting Sokrates. (flying)
. . . has a tough exterior.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES> h
Matai the fearsome blue dragon has an indifferent look.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES>
Alec stands up.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES> j
You sting Sylvice very hard.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES> g
Alec panics, and attempts to flee.
Alec leaves east.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES> grou
Sylvice focuses on Sokrates and utters the words, 'heal'.
Sylvice heals Sokrates.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Alec arrives from the east.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Jonny strikes at Sokrates, but misses completely.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Alec misses Moonglum with his cleave.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Alec cleaves Moonglum extremely hard.
You sting Sylvice hard.
Jonny massacres Sokrates with his slash.
Sokrates slashes Jonny extremely hard.
Sokrates misses Jonny with his slash.
Vayn annihilates Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Moonglum slashes Sokrates extremely hard.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Vayn tells your group 'tick in 10'
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Scaramanga focuses harshly on Vayn and utters some strange words.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES> #TICK-10
Jonny attempts to strike at Sokrates with his halberd.
Jonny massacres Sokrates with his slash.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES> m
Spells currently
memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]hold person
[ 1]prayer [ 1]sacred ward [ 1]sanctuary
5: [ 3]cure critical [ 1]fortify self [ 1]holy aura
6: [ 8]harm
7: [ 1]strength of one
Spells being memorized:
6: [ 1]harm
7: [ 2]sunbolt
You estimate your studies will complete in 2 (game) hours.
Spells left (level-number): 1-0 2-2 3-0 4-2 5-3 6-5 7-1 8-5
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Good]
Mem:2 Exits:ES>
Alec cleaves Moonglum very hard.
You sting Sylvice hard.
Jonny annihilates Sokrates with his slash.
Sokrates slashes Jonny extremely hard.
Jonny blocks Sokrates's blow with a quick raise of his shield.
Jonny leans through Sokrates's blow and knocks him to the ground.
Vayn massacres Sokrates with his slash.
Vayn massacres Sokrates with his stab.
Moonglum massacres Sokrates with his slash.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Fair]
Mem:2 Exits:ES> m 'harm'
harm: added to
your list
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Fair]
Mem:3 Exits:ES> !
Sokrates gives Matai the fearsome blue dragon an order.
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Fair]
Mem:3 Exits:ES> !
harm: added to
your list
464H 150V 1X 22.02% 96C [Me:V.Good] [Moonglum:Fair] [Sylvice:Fair]
Mem:3 Exits:ES>
Sylvice panics, and attempts to flee.
Sylvice leaves south.
464H 150V 1X 22.02% 96C Mem:3 Exits:ES> harm: added to your list
Sokrates gives Matai the fearsome blue dragon an order.
464H 150V 1X 22.02% 96C Mem:4 Exits:ES> fl
Sokrates gives Matai the fearsome blue dragon an order.
464H 150V 1X 22.02% 96C Mem:4 Exits:ES> fle
Scaramanga leaves south.
You're not fighting, why bother fleeing?
Sokrates stands up.
464H 150V 1X 22.02% 96C Mem:4 Exits:ES> r
You rest your tired bones but stay aloft.
Sokrates focuses harshly on Jonny and utters the words, 'soul leech'.
Jonny shudders with agony as pain lashes and clamps down on his soul.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny strikes at Sokrates, but misses completely.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES> s
Alec cleaves Moonglum extremely hard.
Jonny massacres Sokrates with his slash.
Vayn massacres Sokrates with his slash.
Vayn's sword turns the deepest black!
Sokrates's life is drained by a sword!
Vayn stabs Sokrates extremely hard.
Moonglum slashes Sokrates very hard.
464H 150V 1X 22.02% 96C Mem:2 Exits:ES> st
You stand up.
464H 150V 1X 22.02% 96C Mem:4 Exits:ES> e a
The Arena of Champions
464H 148V 1X 22.02% 96C Mem:4 Exits:ESW> r
You rest your tired bones but stay aloft.
464H 148V 1X 22.02% 96C Mem:2 Exits:ESW> med
You try to ignore everything around you and focus upon your
prayers.
464H 148V 1X 22.02% 96C Mem:2 Exits:ESW> m sto 'harm'
harm: removed from your list
464H 148V 1X 22.02% 96C Mem:1 Exits:ESW> st#OK NEW TICKSIZE SET
st
Your studies complete, you close your prayerbook with a smile.
You feel hollow and weakened as the prayer surrounding you fades.
452H 158V 1X 22.02% 96C Exits:ESW> st
You stop meditating and stand up.
452H 158V 1X 22.02% 96C Exits:ESW> w
The Arena of Champions
<Rngd> Alec, Trained in Archaeology is sitting here, fighting Moonglum.
(flying)
. . . enveloped in shadows.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is sitting here, fighting Alec. (flying)
. . . has a tough exterior.
Alec stands up.
452H 156V 1X 22.02% 96C Exits:ES> g
Scaramanga arrives from the south.
452H 156V 1X 22.02% 96C Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere perfect rested standing Y N N N Y 0 0
Moonglum bad rested fighting Y N N N Y 0 0
Vayn good rested standing Y N N N Y 0 1
Jonny v.bad rested standing Y N N N Y 0 0
452H 156V 1X 22.02% 96C Exits:ES>
Vayn massacres Alec with his slash.
452H 156V 1X 22.02% 96C Exits:ES> he
Scaramanga utters some strange words.
You are stunned for a moment, but recover immediately.
Jonny is stunned momentarily, recovering quickly.
Vayn is stunned!
Moonglum is stunned momentarily, recovering quickly.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:V.Good] Exits:ES> heal
jonny
You utter the words, 'heal'
You heal Jonny.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:V.Good] Mem:1
Exits:ES>
Alec screams wildly and cusses at Moonglum.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:V.Good] Mem:1
Exits:ES>
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
Scaramanga misses you with his hit.
Moonglum slashes Alec extremely hard.
Moonglum gasps in pain as he swings through the shadows surrounding
Alec.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Good] Mem:1 Exits:ES>
he
Jonny panics, and attempts to flee.
Jonny leaves east.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Good] Mem:1 Exits:ES>
heal moonglum
Jonny arrives from the east.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Good] Mem:1 Exits:ES>
You utter the words, 'heal'
You heal Moonglum.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Good] Mem:2 Exits:ES>
Moonglum stands up.
452H 156V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Good] Mem:2 Exits:ES>
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES>
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
452H 156V 1X 22.02% 96C Mem:2 Exits:ES>
Moonglum slashes Alec extremely hard.
Moonglum gasps in pain as he swings through the shadows surrounding
Alec.
Alec cleaves Moonglum extremely hard.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> gt EVERYONE#TICK+10
gt EVERYONE STAY ON ALEC
Moonglum slashes Alec extremely hard.
Moonglum gasps in pain as he swings through the shadows surrounding
Alec.
Alec misses Moonglum with his cleave.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> gt EVERYONE STAY ON S
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> gt EVERYONE STAY ON SCARAMANGA
You tell your group 'EVERYONE STAY ON SCARAMANGA'
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere perfect rested standing Y N N N Y 0 2
Moonglum v.good rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 1
Jonny v.good rested fighting Y N N N Y 0 0
452H 156V 1X 22.02% 96C Mem:2 Exits:ES>
Alec stands up.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES>
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Moonglum slashes Alec extremely hard.
Moonglum gasps in pain as he swings through the shadows surrounding
Alec.
Alec massacres Moonglum with his cleave.
Moonglum crashes into Alec in a thundering collision, knocking him to
the ground!
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> l
The Arena of Champions
<VA> Jonny the Male Human is standing here, fighting Alec. (flying)
<Rngd> Alec, Trained in Archaeology is sitting here, fighting Moonglum.
(flying)
. . . enveloped in shadows.
A fearsome blue dragon, Matai, is standing here, ignoring you.
<VA> Vayn, Thinks the Song is About Him is sitting here, fighting Alec.
(flying)
<VA> Lord Moonglum is standing here, fighting Alec. (flying)
. . . has a tough exterior.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere perfect rested standing Y N N N Y 0 2
Moonglum v.good rested fighting Y N N N Y 0 0
Vayn good rested fighting Y N N N Y 0 1
Jonny v.good rested fighting Y N N N Y 0 0
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> exit
Obvious exits:
East - The Arena of Champions
South - The Arena of Champions
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> a
Jonny attempts to focus on Alec and fails horribly.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> ass
You attempt to assist Moonglum.
You toss a couple darts in quick succession at Alec, they all stick in
him.
452H 156V 1X 22.02% 96C [Me:Perfect] [Moonglum:V.Good] [Alec:V.Bad]
Mem:2 Exits:ES>
You sting Alec extremely hard.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
Moonglum massacres Alec with his slash.
Moonglum gasps in pain as he swings through the shadows surrounding
Alec.
Alec massacres Moonglum with his cleave.
452H 156V 1X 22.02% 96C [Me:Perfect] [Moonglum:Good] [Alec:V.Bad] Mem:2
Exits:ES> c
Jonny attempts to strike at Alec with his halberd.
Jonny massacres Alec with his slash.
Jonny gasps in pain as he swings through the shadows surrounding Alec.
452H 156V 1X 22.02% 96C [Me:Perfect] [Moonglum:Good] [Alec:Awful] Mem:2
Exits:ES> c 'harm'
You utter the
words, 'harm'
You grab Alec, who collapses in pain, then dies.
Alec has been defeated.
There is a flash of light and then Alec is gone.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES>
Vayn stands up.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 156V 1X 22.02% 96C Mem:2 Exits:ES> s
Moonglum flies in from the north.
Vayn arrives from the north.
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 154V 1X 22.02% 96C Mem:2 Exits:NES> sca
Looking north:
You see nothing special.
A fearsome blue dragon, Matai, is standing here, ignoring you.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 154V 1X 22.02% 96C Mem:2 Exits:NES> s
Moonglum flies in from the north.
Vayn arrives from the north.
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 152V 1X 22.02% 96C Mem:2 Exits:NE> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 152V 1X 22.02% 96C Mem:2 Exits:NE> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 150V 1X 22.02% 96C Mem:2 Exits:NEW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 150V 1X 22.02% 96C Mem:2 Exits:NEW> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 148V 1X 22.02% 96C Mem:2 Exits:NW> sca
Looking north:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 148V 1X 22.02% 96C Mem:2 Exits:NW> n
Moonglum flies in from the south.
Vayn arrives from the south.
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
452H 146V 1X 22.02% 96C Mem:2 Exits:NSW> c '
Scaramanga leaves west.
Sylvice leaves west.
452H 146V 1X 22.02% 96C Mem:2 Exits:NSW> c 'sunr'
You can't remember how to cast that spell!
452H 146V 1X 22.02% 96C Mem:2 Exits:NSW> w
Moonglum flies in from the east.
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 144V 1X 22.02% 96C Mem:2 Exits:NESW> m 'sunr'
sunray: added to your list
452H 144V 1X 22.02% 96C Mem:3 Exits:NESW> !
sunray: added to your list
452H 144V 1X 22.02% 96C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 144V 1X 22.02% 96C Mem:3 Exits:NESW> n
Moonglum flies in from the south.
Vayn arrives from the south.
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 142V 1X 22.02% 96C Mem:3 Exits:ESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
A fearsome blue dragon, Matai, is standing here, ignoring you.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 142V 1X 22.02% 96C Mem:3 Exits:ESW> w
Moonglum flies in from the east.
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
A fearsome blue dragon, Matai, is standing here, ignoring you.
452H 140V 1X 22.02% 96C Mem:3 Exits:ES> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 140V 1X 22.02% 96C Mem:3 Exits:ES> s
Moonglum flies in from the north.
Vayn arrives from the north.
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 138V 1X 22.02% 96C Mem:3 Exits:NES> s
Moonglum flies in from the north.
Vayn arrives from the north.
Jonny arrives from the north.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is enveloped in flames.
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> s
Scaramanga leaves east.
Sylvice leaves east.
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> gt bash scaramanga
You tell your group 'bash scaramanga'
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> !
You tell your group 'bash scaramanga'
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> !
You tell your group 'bash scaramanga'
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> gt spam it
You tell your group 'spam it'
452H 136V 1X 22.02% 96C Mem:3 Exits:NE> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 134V 1X 22.02% 96C Mem:3 Exits:NEW> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 132V 1X 22.02% 96C Mem:3 Exits:NW> n
Moonglum flies in from the south.
Vayn arrives from the south.
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 130V 1X 22.02% 96C Mem:3 Exits:NSW> w
Moonglum flies in from the east.
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 128V 1X 22.02% 96C Mem:3 Exits:NESW> n
Moonglum flies in from the south.
Vayn arrives from the south.
Jonny arrives from the south.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 126V 1X 22.02% 96C Mem:3 Exits:ESW> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW>
Vayn slashes Scaramanga extremely hard.
Vayn is burned, as he swings at Scaramanga.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga arrives from the south.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga leaves west.
Sylvice leaves west.
452H 124V 1X 22.02% 96C Mem:3 Exits:SW> w
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
452H 122V 1X 22.02% 96C Mem:3 Exits:ESW> e
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is sitting here. (flying)
. . . has a tough exterior.
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> gt again
Vayn tells your group 'tick in 10'
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> #TICK-10
gYou tell your group 'again'
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> gt spam it
You tell your group 'spam it'
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> gt
Moonglum stands up.
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> gt
What do you wish to tell your group?
452H 120V 1X 22.02% 96C Mem:3 Exits:SW> w
Moonglum flies in from the east.
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 118V 1X 22.02% 96C Mem:3 Exits:ESW> w
Moonglum flies in from the east.
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
A fearsome blue dragon, Matai, is standing here, ignoring you.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
452H 116V 1X 22.02% 96C Mem:3 Exits:ES> s
Scaramanga steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
452H 116V 1X 22.02% 96C Mem:3 Exits:ES> s
Scaramanga panics, and attempts to flee.
Scaramanga leaves south.
452H 116V 1X 22.02% 96C Mem:3 Exits:ES> s a
The Arena of Champions
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
452H 114V 1X 22.02% 96C Mem:3 Exits:NES> r
You rest your tired bones but stay aloft.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES> me
Scaramanga leaves east.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES> med
You find yourself still too distracted to meditate
properly.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES>
Sylvice arrives from the north.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES>
Sylvice leaves south.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES> r
You are already resting.
452H 114V 1X 22.02% 96C Mem:2 Exits:NES> m
Spells currently memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]hold person
[ 1]prayer [ 1]sacred ward [ 1]sanctuary
5: [ 3]cure critical [ 1]fortify self [ 1]holy aura
6: [ 8]harm
7: [ 1]strength of one [ 2]sunbolt
Spells being memorized:
6: [ 3]harm
8: [ 2]sunray
You estimate your studies will complete in 2 (game) hours.
Spells left (level-number): 1-0 2-2 3-0 4-2 5-3 6-3 7-1 8-3
452H 114V 1X 22.02% 96C Mem:2 Exits:NES>
452H 114V 1X 22.02% 96C Mem:2 Exits:NES> m sto 'harm'
harm: removed from your list
452H 158V 1X 22.02% 96C Mem:1 Exits:NES> #TICK!!!
st
You stand up.
452H 158V 1X 22.02% 96C Mem:1 Exits:NES> n
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is sitting here. (flying)
. . . has a tough exterior.
A fearsome blue dragon, Matai, is standing here, ignoring you.
452H 156V 1X 22.02% 96C Mem:1 Exits:ES> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 156V 1X 22.02% 96C Mem:1 Exits:ES> grou
Your group of 4 members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere perfect rested standing Y N N N Y 0 1
Moonglum good rested sitting Y N N N Y 0 0
Vayn good rested standing Y N N N Y 0 0
Jonny v.good rested standing Y N N N Y 0 0
452H 156V 1X 22.02% 96C Mem:1 Exits:ES> e
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
452H 154V 1X 22.02% 96C Mem:1 Exits:ESW> e
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
452H 152V 1X 22.02% 96C Mem:1 Exits:SW> w
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
452H 150V 1X 22.02% 96C Mem:1 Exits:ESW> w
Vayn arrives from the east.
Jonny arrives from the east.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
A fearsome blue dragon, Matai, is standing here, ignoring you.
452H 148V 1X 22.02% 96C Mem:1 Exits:ES> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
452H 146V 1X 22.02% 96C Mem:1 Exits:ESW> e
Moonglum flies in from the west.
Vayn arrives from the west.
Jonny arrives from the west.
The Arena of Champions
<VA> Jonny the Male Human is standing here. (flying)
<VA> Vayn, Thinks the Song is About Him is standing here. (flying)
<VA> Lord Moonglum is standing here. (flying)
. . . has a tough exterior.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
<Rngd> Mr Scaramanga is standing here. (flying)
. . . is outlined by a dim aura.
452H 144V 1X 22.02% 96C Mem:1 Exits:SW> e
Alas, you cannot go that way...
452H 144V 1X 22.02% 96C Mem:1 Exits:SW>
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C Mem:1 Exits:SW>
Moonglum crashes into Scaramanga in a thundering collision, knocking
him to the ground!
452H 144V 1X 22.02% 96C Mem:1 Exits:SW> ass
You attempt to assist Jonny.
You toss a couple darts in quick succession at Scaramanga, they all
stick in him.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Scaramanga:Fair]
Mem:1 Exits:SW>
You miss Scaramanga with your sting.
Moonglum slashes Scaramanga hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Scaramanga misses Jonny with his hit.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Scaramanga:Fair]
Mem:1 Exits:SW>
Vayn massacres Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn's sword turns the deepest black!
Scaramanga's life is drained by a sword!
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:V.Good] [Scaramanga:Fair]
Mem:1 Exits:SW> sun
Jonny attempts to strike at Scaramanga with his halberd.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Fair]
Mem:1 Exits:SW> #TICK+10
c 'harm'Vayn massacres
Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn stabs Scaramanga extremely hard.
Vayn is burned, as he swings at Scaramanga.
You sting Scaramanga very hard.
Moonglum slashes Scaramanga extremely hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Scaramanga misses Jonny with his hit.
You utter the words, 'sunbolt'
Scaramanga withers as a ray of sunlight engulfs him!
Scaramanga is mortally wounded, and will die soon, if not aided.
The magic fails!
452H 144V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Dying] Mem:1 Exits:SW>
c 'harm'
Sylvice focuses on Scaramanga and utters the words, 'heal'.
Sylvice heals Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Scaramanga:V.Good] Mem:1
Exits:SW> c 'harm'
Vayn attacks Scaramanga with lightning fast series of attacks that
leaves him defenseless.
452H 144V 1X 22.02% 96C [Me:Perfect] [Scaramanga:V.Good] Mem:1
Exits:SW>
Jonny focuses his purity on Scaramanga's leg!
Jonny forces Scaramanga to the ground.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Good]
Mem:1 Exits:SW>
Scaramanga steps aside as Moonglum attempts a bash, stumbles, and falls
flat on his face.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Good]
Mem:1 Exits:SW>
Scaramanga misses Jonny with his hit.
Vayn massacres Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn massacres Scaramanga with his stab.
Vayn is burned, as he swings at Scaramanga.
Moonglum slashes Scaramanga extremely hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Fair]
Mem:1 Exits:SW> ch sylvice
You utter the
words, 'hold person'
The magic fails!
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Fair]
Mem:1 Exits:SW>
Vayn gazes at Scaramanga with a look of evilness.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Fair]
Mem:1 Exits:SW> !
Sylvice focuses on Scaramanga and utters the words, 'heal'.
Sylvice heals Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Good]
Mem:1 Exits:SW>
Jonny attempts to strike at Scaramanga with his halberd.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Good]
Mem:1 Exits:SW>
Scaramanga misses Jonny with his hit.
Vayn misses Scaramanga with his slash.
Vayn stabs Scaramanga extremely hard.
Vayn is burned, as he swings at Scaramanga.
Moonglum slashes Scaramanga extremely hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW> You can't
remember how to cast that spell!
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW> m
Sylvice leaves south.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW> m
Spells currently
memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]prayer
[ 1]sacred ward [ 1]sanctuary
5: [ 3]cure critical [ 1]fortify self [ 1]holy aura
6: [ 8]harm
7: [ 1]strength of one [ 1]sunbolt
Spells being memorized:
4: [ 1]hold person
6: [ 2]harm
7: [ 1]sunbolt
8: [ 2]sunray
You estimate your studies will complete in 1 (game) hour.
Spells left (level-number): 1-0 2-2 3-0 4-2 5-3 6-4 7-1 8-3
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW>
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW> c '
Jonny tells your group 'bash sylvice man'
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Good]
Mem:1 Exits:SW> c
Jonny attempts to strike at Scaramanga with his halberd.
Jonny slashes Scaramanga extremely hard.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Fair]
Mem:1 Exits:SW>
Scaramanga misses Jonny with his hit.
Vayn massacres Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn massacres Scaramanga with his stab.
Vayn is burned, as he swings at Scaramanga.
Moonglum slashes Scaramanga hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Moonglum stands up.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Bad]
Mem:1 Exits:SW>
Moonglum crashes into Scaramanga in a thundering collision, knocking
him to the ground!
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Bad]
Mem:1 Exits:SW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
<CRZY> Sylvice the Male Silvanesti is standing here. (flying)
. . . has a metallic luster.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Bad]
Mem:1 Exits:SW> c 'harm'
You utter the
words, 'harm'
Scaramanga appears to grow stronger.
Scaramanga easily evades your grasp. Did you seriously think you'd
reach him?
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Bad]
Mem:2 Exits:SW>
Sylvice arrives from the south.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:Bad]
Mem:2 Exits:SW>
Vayn focuses harshly on Scaramanga and utters the words, 'soul leech'.
Scaramanga shudders with agony as pain lashes and clamps down on his
soul.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Bad]
Mem:2 Exits:SW> c '
Sylvice focuses on Scaramanga and utters the words, 'heal'.
Sylvice heals Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Good] [Scaramanga:V.Good]
Mem:2 Exits:SW> c 'harm'sylvice
Scaramanga misses Jonny with his hit.
Moonglum slashes Scaramanga very hard.
Moonglum is burned, as he swings at Scaramanga.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
Jonny attempts to strike at Scaramanga with his halberd.
Jonny massacres Scaramanga with his slash.
Jonny is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Good]
Mem:2 Exits:SW> c 'harm'sylvice
You utter the
words, 'harm'
You grab Sylvice, who screams in pain.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Good]
Mem:2 Exits:SW>
Vayn focuses harshly on Scaramanga and utters the words, 'soul leech'.
Scaramanga shudders with agony as pain lashes and clamps down on his
soul.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Fair]
Mem:2 Exits:SW>
Jonny deftly steps in front of you, pushing you out of the way.
Jonny comes to your rescue! You're thankful, but a bit dazed.
Sylvice drains Jonny very hard.
Jonny slashes Sylvice extremely hard.
Scaramanga misses Jonny with his hit.
Moonglum slashes Scaramanga hard.
Moonglum is burned, as he swings at Scaramanga.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Fair]
Mem:2 Exits:SW> !
Moonglum crashes into Sylvice in a thundering collision, knocking him
to the ground!
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Fair]
Mem:2 Exits:SW> !
You utter the
words, 'harm'
You grab Sylvice, who screams in pain.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> !
Scaramanga stands up.
452H 144V 1X 22.02% 96C [Me:Perfect] [Jonny:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> !
Scaramanga panics, and attempts to flee.
Scaramanga leaves west.
452H 144V 1X 22.02% 96C Mem:3 Exits:SW>
Sylvice drains Jonny hard.
Jonny massacres Sylvice with his slash.
452H 144V 1X 22.02% 96C Mem:3 Exits:SW>
Jonny attempts to strike at Sylvice with his halberd.
Jonny massacres Sylvice with his slash.
452H 144V 1X 22.02% 96C Mem:3 Exits:SW>
Vayn massacres Sylvice with his slash.
Vayn's sword turns the deepest black!
Sylvice's life is drained by a sword!
452H 144V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga arrives from the west.
452H 144V 1X 22.02% 96C Mem:3 Exits:SW>
Scaramanga utters some strange words.
Jonny is stunned!
Vayn is stunned momentarily, recovering quickly.
Moonglum is stunned momentarily, recovering quickly.
You are stunned for a moment, but recover immediately.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> You utter the
words, 'harm'
You grab Sylvice, who collapses in pain, then dies.
Sylvice has been defeated.
There is a flash of light and then Sylvice is gone.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW>
Vayn slashes Scaramanga very hard.
Vayn is burned, as he swings at Scaramanga.
Vayn stabs Scaramanga extremely hard.
Vayn is burned, as he swings at Scaramanga.
Moonglum slashes Scaramanga very hard.
Moonglum is burned, as he swings at Scaramanga.
Scaramanga misses Vayn with his hit.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> say
Jonny tells your group 'bash sylvice man'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> say
Moonglum crashes into Scaramanga in a thundering collision, knocking
him to the ground!
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> say
Vayn attacks Scaramanga with lightning fast series of attacks that
leaves him defenseless.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> say
Jonny tells your group 'nice!'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW> say just quit out
You say 'just
quit out'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Fair]
Mem:3 Exits:SW>
Vayn massacres Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn's sword turns the deepest black!
Scaramanga's life is drained by a sword!
Vayn massacres Scaramanga with his stab.
Vayn is burned, as he swings at Scaramanga.
You miss Scaramanga with your sting.
Moonglum slashes Scaramanga extremely hard.
Moonglum is burned, as he swings at Scaramanga.
Scaramanga misses Vayn with his hit.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW> say you lost
You say 'you
lost'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW> grou
Vayn utters some strange words.
Vez the fearsome blue dragon suddenly appears!
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW> grou
Your group of 4
members consists of:
Member Hits Move Position Fly Inv Water iMT Here Light Mem
-----------------------------------------------------------------------
----------
Belvedere perfect rested fighting Y N N N Y 0 3
Moonglum fair rested fighting Y N N N Y 0 0
Vayn fair rested fighting Y N N N Y 0 2
Jonny fair rested sitting Y N N N Y 0 0
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW> m
Spells currently
memorized:
1: [ 2]aid [ 1]bless [ 1]create food
[ 1]create water [ 2]cure light [ 1]know alignment
[ 2]restore strength [ 1]spiritual hammer
2: [ 4]blindness [ 3]cure blindness [ 1]light
[ 1]remove curse
3: [ 4]cure serious [ 3]gust of wind [ 3]remove poison
4: [ 2]dispel magic [ 2]free action [ 1]prayer
[ 1]sacred ward [ 1]sanctuary
5: [ 3]cure critical [ 1]fortify self [ 1]holy aura
6: [ 4]harm
7: [ 1]strength of one [ 1]sunbolt
Spells being memorized:
4: [ 1]hold person
6: [ 6]harm
7: [ 1]sunbolt
8: [ 2]sunray
You estimate your studies will complete in 3 (game) hours.
Spells left (level-number): 1-0 2-2 3-0 4-2 5-3 6-4 7-1 8-3
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW>
You miss Scaramanga with your sting.
Moonglum slashes Scaramanga hard.
Moonglum is burned, as he swings at Scaramanga.
Scaramanga misses Vayn with his hit.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW>
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW>
Vayn gives Vez the fearsome blue dragon an order.
Vez the fearsome blue dragon misses Scaramanga with his claw.
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW>
Moonglum crashes into Scaramanga in a thundering collision, knocking
him to the ground!
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW>
Vayn tells your group 'tick in 10'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:V.Bad]
Mem:3 Exits:SW> sun
You utter the
words, 'sunbolt'
Scaramanga withers as a ray of sunlight engulfs him!
The magic fails!
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Awful]
Mem:4 Exits:SW>
Jonny says 'bye'
452H 144V 1X 22.02% 96C [Me:Perfect] [Vayn:Fair] [Scaramanga:Awful]
Mem:4 Exits:SW> #TICK-10
Vez the fearsome blue dragon claws Scaramanga very hard.
Vez the fearsome blue dragon is burned, as he swings at Scaramanga.
Vez the fearsome blue dragon misses Scaramanga with his claw.
Vayn massacres Scaramanga with his slash.
Vayn is burned, as he swings at Scaramanga.
Vayn's sword turns the deepest black!
Scaramanga's life is drained by a sword!
Vayn massacres Scaramanga with his stab.
Vayn is burned, as he swings at Scaramanga.
Scaramanga is incapacitated and will slowly die, if not aided.
Moonglum massacres Scaramanga with his slash.
Moonglum is burned, as he swings at Scaramanga.
Scaramanga has been defeated.
There is a flash of light and then Scaramanga is gone.
452H 144V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Awful] Mem:4 Exits:SW>
Vayn gives Vez the fearsome blue dragon an order.
452H 144V 1X 22.02% 96C [Me:Perfect] [Scaramanga:Awful] Mem:4 Exits:SW>
Vayn gives Vez the fearsome blue dragon an order.
452H 144V 1X 22.02% 96C Mem:4 Exits:SW> gt nice job team
You tell your group 'nice job team'

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. http://arctic.elay.org/rss.xml
2. http://www.topmudsites.com/vote-just.html
3. http://www.mudconnect.com/cgi-bin/vote_rank.cgi?mud=Arctic
4. file:///index.php?option=forgot
5. file:///index.php?option=register
6. file:///index.php?option=recentlogs
7. file:///index.php?option=recentlogs&lognbr=10
8. file:///index.php?option=recentlogs&lognbr=0
9. file:///index.php?option=toplogs
10. file:///index.php?option=mostviewedlogs
11. file:///index.php?option=uploadlog
12. file:///index.php?option=collections
13. file:///index.php?option=quicklist
14. http://www.topmudsites.com/vote-just.html
15. http://www.mudconnect.com/mud-bin/vote_rank.cgi?mud=Arctic
16. http://arcticmud.blogspot.com/
17. http://pollux.ldz.lv/~punk/upload/index.php
18. http://mudlogs.foghaven.net/
19. http://normstorm.com/template/m-news.html
20. http://mud.arctic.org/forum/
21. http://mud.arctic.org/
22. file:///index.php?option=poll&action=new
23. file:///index.php?option=poll&action=listpolls
24. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/rss.xml
25. http://twitter.com/arcticelayorg
26. file:///Users/erinswenson-healey/dev/davidwees-arctic-logs/logs/html/log2752.html?option=forums&action=displaythread&threadid=2752
