<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Horace r.i.p.

POV: Draven

Log Rating: 3.3203

Was told horace was a random pkiller so i poffed to him and killed him.
Latter i found out he was wild and returned his eq.

Start logging: 27.11.2002 23:32
Your studies complete, you close your spellbook with a smile.
Bejoza tells your group 'Lenore loosing xps on dwarves?'
340H 125V 7354445X 3202C Exits:W>
Uliah tells your group 'of course he is :)'
340H 125V 7354445X 3202C Exits:W> eqYou are using:
<worn on finger> an ancient jade ring..it glows blue
<worn on finger> an ancient jade ring..it glows blue
<worn around neck> a silver chain of maple leaves
<worn on body> a black velvet robe..it glows blue
<worn on head> the crown of King Lorac (invisible)..it glows blue
<worn on feet> the boots of the elven magi (invisible)..it glows blue
<worn on arms> a pair of finely crafted circlets..it glows blue..it
glows dimly
<worn as shield> a mirror shield..it glows blue
<worn about body> a renegade's robe
<worn about waist> a thick belt adorned with fiery opals (invisible)
<worn as pouch> a travelling component pouch
<worn around right wrist> a frosted tin bracer..it glows blue..it glows
dimly
<worn around left wrist> a frosted tin bracer..it glows blue..it glows
dimly
<used in primary hand> an aspen staff..it glows blue
<held in secondary hand> a dragon orb (invisible)..it glows blue
340H 125V 7354445X 3202C Exits:W> groYour group of 5 members consists
of:
Member Hits Move Position Fly Inv Water Light Mem
-----------------------------------------------------------------------
-
Bejoza perfect rested standing Y Y N 0 1
Uliah perfect rested standing Y N N 1 0
Onnilas perfect rested fighting Y N N 0 3
Lenore good rested fighting N N N 0 0
Draven perfect rested standing Y Y N 1 0
340H25V 7354445X 3202C Exits:W>
Kelian stands up.
340H 125V 7354445X 3202C Exits:W> c 'relo' horace
Kelian flies west.
320H 125V 7354445X 3202C Exits:W> You utter the words, 'relocate'
The jagged branches rip and tear at your exposed flesh, causing
painful scrapes and cuts.
Lost in a Dark Forest
The trees in the forest cast deep and dark shadows which seem to absorb
the light from all around. Limbs from the trees create a thick web of
jagged thorny branches making travel through the forest treacherous and
painful in all directions.
The corpse of a goblin warrior is lying here.
The corpse of a huge ogre is lying here.
The corpse of a goblin warrior is lying here. [3]
Sir Altraz Regweld is resting here. (flying)
. . . is outlined with a dim aura.
Horace Horsekiller, Tour Guide of Xak Tsaroth is standing here.
320H 125V 7354445X 3202C Mem:2 Exits:NESW>
Altraz stands up.
320H 125V 7354445X 3202C Mem:2 Exits:NESW>
Altraz glances at Horace.
320H 125V 7354445X 3202C Mem:2 Exits:NESW> c 'h p' horace
Lenore tells your group 'a bit'
320H 125V 7354445X 3202C Mem:2 Exits:NESW> You utter the words, 'hold
person'
Horace freezes in place.
320H 125V 7354445X 3202C Mem:2 Exits:NESW> say leave altrazYou say
'leave altraz'
320H 125V 7354445X 3202C Mem:2 Exits:NESW> lLost in a Dark Forest
The trees in the forest cast deep and dark shadows which seem to absorb
the light from all around. Limbs from the trees create a thick web of
jagged thorny branches making travel through the forest treacherous and
painful in all directions.
The corpse of a goblin warrior is lying here.
The corpse of a huge ogre is lying here.
The corpse of a goblin warrior is lying here. [3]
Sir Altraz Regweld is standing here. (flying)
. . . is outlined with a dim aura.
Horace Horsekiller, Tour Guide of Xak Tsaroth is standing here.
320H 125V 7354445X 3202C Mem:2 Exits:NESW>
Altraz nods solemnly.
320H 125V 7354445X 3202C Mem:2 Exits:NESW> c 'fo' horaceYou utter the
words, 'force bolt'
You hear bones crack as your force bolt slams into Horace.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Bad] Mem:3 Exits:NESW>
c 'fo' horace
Altraz flies south.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Bad] Mem:3 Exits:NESW>
You bludgeon Horace extremely hard.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:V.Bad] Mem:3
Exits:NESW> c 'fo' horaceYou utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Horace.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:V.Bad] Mem:4
Exits:NESW>
A goblin warrior arrives from the east.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:V.Bad] Mem:4
Exits:NESW> c 'fo' horacec 'fo' horaceYou utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Horace.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Awful] Mem:4
Exits:NESW> c 'fo' horacec 'fo' horace
A goblin warrior tries to kick you but he misses and destroys an image
instead.
A goblin warrior misses you and destroys an image.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Awful] Mem:4
Exits:NESW> c 'l b'You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Horace.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Awful] Mem:5
Exits:NESW> c 'l b'
A goblin warrior misses you with his cleave.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Awful] Mem:5
Exits:NESW>
You step aside as a goblin warrior tries to bash you, causing him to
tumble and fall face down.
320H 125V 7354445X 3202C [Draven:V.Good] [Horace:Awful] Mem:5
Exits:NESW> You utter the words, 'force bolt'
Your force bolt shatters Horace's skull into lifeless goo.
You receive 0 experience.
Horace is dead! R.I.P.
320H 125V 7354445X 3202C [Horace:Dying] Mem:6 Exits:NESW> c 'l b'
The death cry of Horace echoes from somewhere nearby...
Altraz stops following Horace.
You direct your attention to a goblin warrior.
320H 125V 7354445X 3202C [Draven:V.Good] [a goblin warrior:Perfect]
Mem:6 Exits:NESW>
You massacre a goblin warrior with your bludgeon.
A goblin warrior cleaves YOU extremely hard.
A goblin warrior burns as he passes through your fire shield.
301H 125V 7353735X 3202C [Draven:V.Good] [a goblin warrior:Fair] Mem:6
Exits:NESW> get all corpseWho should the spell be cast upon?
301H 125V 7353735X 3202C [Draven:V.Good] [a goblin warrior:Fair] Mem:6
Exits:NESW> Who should the spell be cast upon?
301H 125V 7353735X 3202C [Draven:V.Good] [a goblin warrior:Fair] Mem:6
Exits:NESW> You utter the words, 'lightning bolt'
Your lightning bolt shatters a goblin warrior to pieces.
You receive 91249 experience.
A goblin warrior is dead! R.I.P.
301H 125V 7260190X 3202C [a goblin warrior:Dying] Mem:6 Exits:NESW>
The death cry of a goblin warrior echoes from somewhere nearby...
301H 125V 7260190X 3202C Mem:6 Exits:NESW>
Bejoza tells your group 'all be flying'
301H 125V 7260190X 3202C Mem:6 Exits:NESW> Unexpected end of input:
You must specify a character to perform that action on.
301H 125V 7260190X 3202C Mem:6 Exits:NESW> You get a badly chipped axe
from the corpse of a goblin warrior.
You get a suit of leather armor from the corpse of a goblin warrior.
You get a pile of coins from the corpse of a goblin warrior.
There were 12 coins.
301H 125V 7260190X 3214C Mem:6 Exits:NESW> Lost in a Dark Forest
The trees in the forest cast deep and dark shadows which seem to absorb
the light from all around. Limbs from the trees create a thick web of
jagged thorny branches making travel through the forest treacherous and
painful in all directions.
The corpse of a goblin warrior is lying here.
The corpse of Horace is lying here.
The corpse of a goblin warrior is lying here.
The corpse of a huge ogre is lying here.
The corpse of a goblin warrior is lying here. [3]
301H 125V 7260190X 3214C Mem:6 Exits:NESW> get all horaceYou get a
colossal war axe from the corpse of Horace.
You get a crystal bracelet from the corpse of Horace.
You get a band of power from the corpse of Horace.
You get a cloth belt pack from the corpse of Horace.
You get a weatherbeaten rucksack from the corpse of Horace.
You get an ebony shield from the corpse of Horace.
You get a set of black rerebrace from the corpse of Horace.
You get a pair of black razor-lined gloves from the corpse of Horace.
You get a pair of green leather boots from the corpse of Horace.
You get a pair of ergothian battle armor greaves from the corpse of
Horace.
Mask : You can't carry that much weight.
Plate : You can't carry that much weight.
You get a gaudy silver ring from the corpse of Horace.
Ring : You can't carry that much weight.
You get a large pile of coins from the corpse of Horace.
There were 715 coins.
Dagger : You can't carry that much weight.
Canteen : You can't carry that much weight.
Canteen : You can't carry that much weight.
Canteen : You can't carry that much weight.
Scroll : You can't carry that much weight.
Potion : You can't carry that much weight.
Potion : You can't carry that much weight.
Scroll : You can't carry that much weight.
Scroll : You can't carry that much weight.
Lantern : You can't carry that much weight.
Symbol : You can't carry that much weight.
You get a pinch of chameleon dust from the corpse of Horace.
Waterskin : You can't carry that much weight.
Charm : You can't carry that much weight.
Torch : You can't carry that much weight.
Collar : You can't carry that much weight.
You get a corked flask of swamp gas from the corpse of Horace.
Pouch : You can't carry that much weight.
You get a gleaming silver die from the corpse of Horace.
Sword : You can't carry that many items.
Whip : You can't carry that many items.
Waterskin : You can't carry that many items.
Flask : You can't carry that many items.
Flask : You can't carry that many items.
Flask : You can't carry that many items.
Flask : You can't carry that many items.
Chest : You can't carry that many items.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
