<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Evil goblins Snarg and Styxie dies

POV: Elyana

Log Rating: -0.5000

Snarg says 'LONG LIVE FREEDOM!'

310H 132V 13005083X 670C Mem:4 Exits:NESW> scanLooking north:
You see nothing special.
A tired traveller is looking around for the town's inn.
A sailor fresh off the boat is looking for a good time in town.
A merchant is here trying to sell you something.
A merchant is here trying to sell you something.
Looking east:
You see nothing special.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Styxie the Female Wild Elf is standing here. (flying)
Snarg the Male Goblin is standing here.
A tired traveller is looking around for the town's inn.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
310H 132V 13005083X 670C Mem:4 Exits:NESW> wc 'h p' SnargHeze flies in
from the east.
Market Street West
Styxie the Female Wild Elf is standing here. (flying)
Snarg the Male Goblin is standing here.
A tired traveller is looking around for the town's inn.
310H 131V 13005083X 670C Mem:4 Exits:NESW>
Snarg leaves east.
Styxie flies east.
310H 131V 13005083X 670C Mem:4 Exits:NESW> Who should the spell be cast
upon?
310H 131V 13005083X 670C Mem:4 Exits:NESW> weHeze flies in from the
east.
Market Street West
310H 130V 13005083X 670C Mem:4 Exits:NESW> c 'h p' Snargec 'h p'
SnargHeze flies in from the west.
Market Street West
Styxie the Female Wild Elf is standing here. (flying)
Snarg the Male Goblin is standing here.
A tired traveller is looking around for the town's inn.
310H 129V 13005083X 670C Mem:4 Exits:NESW> You utter the words, 'hold
person'
310H 129V 13005083X 670C Mem:4 Exits:NESW>
You are sent sprawling as Styxie crashes into you.
304H 129V 13005083X 670C [Elyana:V.Good] [Styxie:Perfect] Mem:4
Exits:NESW>
Snarg swings madly at Heze with a two-handed sword, cutting him a deep
wound.
304H 129V 13005083X 670C [Elyana:V.Good] [Styxie:Perfect] Mem:4
Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'hold person'.
304H 129V 13005083X 670C [Elyana:V.Good] [Styxie:Perfect] Mem:4
Exits:NESW>
Snarg misses Heze with his slash.
Styxie misses you with her cleave.
You miss Styxie with your whip.
Your flaming robe dissolves away.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:Perfect] Mem:4
Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'hold person'.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:Perfect] Mem:4
Exits:NESW> st
Snarg misses Heze with his slash.
Styxie misses you with her cleave.
You whip Styxie hard.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:V.Good] Mem:4
Exits:NESW>
You step aside as Styxie tries to bash you, causing her to tumble and
fall face down.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:V.Good] Mem:4
Exits:NESW> c 'h p' Snarg
Snarg appears to get angry for a second.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:V.Good] Mem:4
Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'hold person'.
Snarg freezes in place.
310H 141V 13005083X 670C [Elyana:Perfect] [Styxie:V.Good] Mem:4
Exits:NESW>
Styxie cleaves YOU.
You whip Styxie extremely hard.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:4
Exits:NESW> You can't do that while sitting.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:4
Exits:NESW> c 'h p' StyxieYou can't do this sitting!
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:4
Exits:NESW> You stand up.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:4
Exits:NESW> You utter the words, 'hold person'
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:5
Exits:NESW> st
Snarg rolls on the floor in a fit of laughter.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Good] Mem:5
Exits:NESW>
Heze focuses harshly on Styxie and utters the words, 'force bolt'.
The sound of bones cracking echoes as Heze's force bolt slams into
Styxie.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
You feel yourself exposed.
Styxie misses you with her cleave.
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Snarg says 'wooohoo'
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> stYou utter the words, 'hold person'
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> c 'h p' Styxie
Snarg says 'DEATH INFEIDELS'
304H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Heze pierces Snarg.
Styxie cleaves YOU very hard.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'force bolt'.
The sound of bones cracking echoes as Heze's force bolt slams into
Snarg.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Mercator shouts 'moss-covered book for sale'
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Snarg says 'DEATH INFEIDELS'
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> stYou are already standing.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> You are already standing.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> You utter the words, 'hold person'
Styxie freezes in place.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW> c 'f b' Styxie
Snarg says 'EVILS SCUMS MUST PAY'
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Fair] Mem:5
Exits:NESW>
Heze focuses harshly on Styxie and utters the words, 'force bolt'.
The sound of bones cracking echoes as Heze's force bolt slams into
Styxie.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Bad] Mem:5
Exits:NESW> You are already standing.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:V.Bad] Mem:5
Exits:NESW> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Styxie.
293H 141V 13005083X 670C [Elyana:V.Good] [Styxie:Awful] Mem:6
Exits:NESW> c 'f b' Styxieget all 1.corpseSnarg misses Heze with his
slash.
Heze misses Snarg with his pierce.
You whip Styxie extremely hard.
You receive 0 experience.
Styxie is dead! R.I.P.
get coins corpseexa corpseThe death cry of Styxie echoes from somewhere
nearby...
Styxie stops following Snarg.
Who should the spell be cast upon?
293H 141V 13005083X 670C Mem:6 Exits:NESW> You get a broad steel
battle-axe from the corpse of Styxie.
You get a tarnished steel shield from the corpse of Styxie.
You get a pile of coins from the corpse of Styxie.
There were 14 coins.
You get a swollen mouse bladder from the corpse of Styxie.
You get a swollen mouse bladder from the corpse of Styxie.
You get a tarnished steel longsword from the corpse of Styxie.
You get a battle axe from the corpse of Styxie.
Potion : You can't carry that much weight.
Potion : You can't carry that much weight.
Scroll : You can't carry that much weight.
Scroll : You can't carry that much weight.
Leg : You can't carry that much weight.
Leg : You can't carry that much weight.
293H 141V 13005083X 684C Mem:6 Exits:NESW> The corpse doesn't seem to
have what you are looking for.
293H 141V 13005083X 684C Mem:6 Exits:NESW> It's a pretty ghastly sight!
Searching through the remains, you find:
corpse (here) :
a milky potion of see invisible [2]
a scroll of recall [2]
a roasted turkey leg [2]
293H 141V 13005083X 684C Mem:6 Exits:NESW> c 'f b' Snarg
Snarg says 'DIE DIE DIE!'
293H 141V 13005083X 684C Mem:6 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Snarg.
293H 141V 13005083X 684C Mem:7 Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'force bolt'.
The sound of bones cracking echoes as Heze's force bolt slams into
Snarg.
293H 141V 13005083X 684C Mem:7 Exits:NESW> c 'f b' Snarg
Snarg misses Heze with his slash.
293H 141V 13005083X 684C Mem:7 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Snarg.
293H 141V 13005083X 684C Mem:8 Exits:NESW> c 'f b' Snarg
Snarg slashes Heze very hard.
293H 141V 13005083X 684C Mem:8 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Snarg.
293H 141V 13005083X 684C Mem:9 Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'lightning bolt'.
Snarg wavers under the impact of the lightning bolt sent by Heze.
293H 141V 13005083X 684C Mem:9 Exits:NESW> c 'f b' Snarg
Snarg says 'LONG LIVE FREEDOM!'
293H 141V 13005083X 684C Mem:9 Exits:NESW>
Snarg slashes Heze hard.
293H 141V 13005083X 684C Mem:9 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Snarg.
293H 141V 13005083X 684C Mem:10 Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'lightning bolt'.
Snarg wavers under the impact of the lightning bolt sent by Heze.
293H 141V 13005083X 684C Mem:10 Exits:NESW> c 'f b' Snarg
Snarg misses Heze with his slash.
293H 141V 13005083X 684C Mem:10 Exits:NESW>
Snarg says 'SCUMS!'
293H 141V 13005083X 684C Mem:10 Exits:NESW> You utter the words, 'force
bolt'
You hear bones crack as your force bolt slams into Snarg.
293H 141V 13005083X 684C Mem:11 Exits:NESW>
Heze focuses harshly on Snarg and utters the words, 'lightning bolt'.
Snarg receives the full blast of a lightning bolt from Heze ... and is
no more.
You receive 0 experience.
Snarg is dead! R.I.P.
get coins corpseexa corpse
293H 141V 13005083X 684C Mem:11 Exits:NESW>
The death cry of Snarg echoes from somewhere nearby...
293H 141V 13005083X 684C Mem:11 Exits:NESW> get all 1.corpseYou get a
pile of coins from the corpse of Snarg.
There were 29 coins.
293H 141V 13005083X 713C Mem:11 Exits:NESW> It's a pretty ghastly
sight! Searching through the remains, you find:
corpse (here) :
a two-handed sword
a white robe
a pair of grey leather boots
a green leather plate
a swollen mouse bladder [6]
a heavy flanged mace
a large piece of pork chop [5]
a milky potion of see invisible
a scroll of recall
a bottle of Khurian whiskey [4]
293H 141V 13005083X 713C Mem:11 Exits:NESW> Sword : You can't carry
that much weight.
Robe : You can't carry that much weight.
Boots : You can't carry that much weight.
Plate : You can't carry that much weight.
Bladder : You can't carry that much weight.
Bladder : You can't carry that much weight.
Bladder : You can't carry that much weight.
Bladder : You can't carry that much weight.
Bladder : You can't carry that much weight.
Bladder : You can't carry that much weight.
Mace : You can't carry that much weight.
Pork : You can't carry that much weight.
Pork : You can't carry that much weight.
Pork : You can't carry that much weight.
Pork : You can't carry that much weight.
Pork : You can't carry that much weight.
Potion : You can't carry that much weight.
Scroll : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.
Bottle : You can't carry that much weight.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
