<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

The ball of light following you winks out.

POV: Xtal

Log Rating: -1.4349

Elyana and its underling decide to kill me.

Another completly random kill on some do nothing
player minding his own business.
------------------------------------------------
218H 133V 3714676X 430C Mem:2 Exits:ES> imp
You utter the words, 'improved invisibility'
You vanish.
218H 133V 3714676X 430C Mem:3 Exits:ES> l
l
Draconian Officers Quarters
The corpse of a draconian guard is lying here.
A translucent being hovers in the air here. (invisible)
218H 133V 3714676X 430C Mem:3 Exits:ES> Draconian Officers Quarters
The corpse of a draconian guard is lying here.
A translucent being hovers in the air here. (invisible)
218H 133V 3714676X 430C Mem:3 Exits:ES> sc
You are Xtal the Male Gnome, a level 24 Mage.
You are 40 years old.
You have 218(218) hit and 133(133) movement points.
You are influenced by the black moon, Nuitari.
You have scored 31285324 exp, and have 430(7590) steel coins.
You need 3714676 more experience to advance.
You have died 12 horrible deaths.
You have been connected for 43 minute(s).
You have been playing for too long.
You are standing.
You are flying.
You are affected by the following:
improved invisibility
strength
fly
invisibility
continual light
detect invisibility
218H 133V 3714676X 430C Mem:3 Exits:ES> in
You are carrying:
a silver flute..it hums softly
a medicinal potion
a first aid kit
a loaf of hymox bread [4]
a green marble chest
a watering can [2]
a scroll of recall [3]
218H 133V 3714676X 430C Mem:3 Exits:ES> exam pack
The pack appears to be brand new.
pack (used) :
a blue potion of remove poison [2]
a brass lamp
a medallion of the earth [4]
a milky potion of see invisible [2]
a yellow green vial [2]
218H 133V 3714676X 430C Mem:3 Exits:ES> exam chest
The stone surface of the chest is flawless.
chest (carried) :
a white dragon eye
a glowing scroll of recall..it glows dimly
a vial of slug venom
218H 133V 3714676X 430C Mem:3 Exits:ES> l
Draconian Officers Quarters
The corpse of a draconian guard is lying here.
A translucent being hovers in the air here. (invisible)
218H 133V 3714676X 430C Mem:3 Exits:ES> o hit self
An invisible stalker slowly fades into existence.
You issue the order 'hit self'.
218H 133V 3714676X 430C Mem:3 Exits:ES>
Quinefier shouts 'www.geocities.com/namaerien/girl_sleeping.jpg'
218H 133V 3714676X 430C Mem:3 Exits:ES> s
**** 21 damage
The Draconian Commander's Quarters
A translucent being hovers in the air here.
The draconian commander seems quite annoyed to see you.
The draconian commander massacres YOU with his slash.
197H 132V 3714676X 430C [Xtal:V.Good] [the draconian commander:Perfect]
Mem:3 Exits:NS> o ass
An invisible stalker misses the draconian
commander with its hit.
You issue the order 'ass'.
197H 132V 3714676X 430C [Xtal:V.Good] [the draconian commander:Perfect]
Mem:3 Exits:NS> fle
PANIC! You couldn't escape!
197H 132V 3714676X 430C [Xtal:V.Good] [the draconian commander:Perfect]
Mem:3 Exits:NS> fle
You flee head over heels.
Officer's Quarters
The corpse of a draconian guard is lying here.
197H 131V 3714676X 430C Mem:3 Exits:NE> n
The Draconian Commander's Quarters
An invisible stalker is standing here, fighting the draconian
commander.
The draconian commander is resting here, fighting an invisible stalker.
197H 130V 3714676X 430C Mem:3 Exits:NS> ii command
*** The draconian commander STANDS UP ***
197H 130V 3714676X 430C Mem:3 Exits:NS> ii commander
You utter the words, 'lightning bolt'
The lightning bolt hits the draconian commander with full impact.
197H 130V 3713690X 430C Mem:3 Exits:NS> ii commander
The draconian commander massacres an invisible stalker with his slash.
An invisible stalker hits the draconian commander very hard.
An invisible stalker misses the draconian commander with its claw.
197H 130V 3713690X 430C Mem:3 Exits:NS>
*** Elyana relocates to YOU. !*!*!*!*!*!
The draconian commander focuses harshly on you and utters the words,
'silence'.
197H 130V 3713690X 430C Mem:3 Exits:NS> You utter the words, 'lightning
bolt'
The lightning bolt hits the draconian commander with full impact.
197H 130V 3712704X 430C Mem:4 Exits:NS> rec re
The draconian commander utters the words, 'stinking cloud'.
197H 130V 3712704X 430C Mem:4 Exits:NS> rec recall
The draconian commander massacres an invisible stalker with his slash.
An invisible stalker misses the draconian commander with its hit.
An invisible stalker misses the draconian commander with its claw.
197H 130V 3712704X 430C Mem:4 Exits:NS> rec recall
Elyana focuses harshly on you and utters the words, 'hold person'.
******* HELD *******
197H 130V 3712704X 430C Mem:4 Exits:NS> You are unable to use your
physical form.
197H 130V 3712704X 430C Mem:4 Exits:NS> 'why?
You say 'why?'
197H 130V 3712704X 430C Mem:4 Exits:NS>
The draconian commander massacres an invisible stalker with his slash.
An invisible stalker is dead! R.I.P.
The death cry of an invisible stalker echoes from somewhere nearby...
An invisible stalker stops following you.
An invisible stalker transcends this world and enters another plane.
197H 130V 3712704X 430C Mem:4 Exits:NS> l
You are unable to use your physical form.
197H 130V 3712704X 430C Mem:4 Exits:NS> l
**** 20 damage
The draconian commander focuses harshly on you and utters the words,
'ray of enfeeblement'.
The draconian commander slashes YOU extremely hard.
The draconian commander utters the words, '* fireshield'.
177H 130V 3712704X 430C [Xtal:Good] [the draconian commander:Bad] Mem:4
Exits:NS> You are unable to use your physical form.
177H 130V 3712704X 430C [Xtal:Good] [the draconian commander:Bad] Mem:4
Exits:NS>
Elyana focuses harshly on you and utters the words, '* energy drain'.
Elyana slowly fades into existence.
Luckily for you Elyana slept during draining-lessons.
177H 130V 3712704X 430C [Xtal:Good] [the draconian commander:Bad] Mem:4
Exits:NS> **** 20 damage
The draconian commander slashes YOU extremely hard.
157H 130V 3712704X 430C [Xtal:Fair] [the draconian commander:Bad] Mem:4
Exits:NS> l
You are unable to use your physical form.
157H 130V 3712704X 430C [Xtal:Fair] [the draconian commander:Bad] Mem:4
Exits:NS>
A glowing portal opens in front of Elyana, and Mona steps from it.
The draconian commander utters the words, '* prismatic spray'.
157H 130V 3712704X 430C [Xtal:Fair] [the draconian commander:Bad] Mem:4
Exits:NS> **** 50 damage
Elyana focuses harshly on you and utters the words, '* energy drain'.
Elyana slowly fades into existence.
You feel less energetic as Elyana drains you.
That Really did HURT!
107H 130V 4992704X 430C [Xtal:Bad] [the draconian commander:Bad] Mem:4
Exits:NS>
The draconian commander utters the words, 'shield'.
107H 130V 4992704X 430C [Xtal:Bad] [the draconian commander:Bad] Mem:4
Exits:NS> 'i **** 48 damage
'i
The draconian commander massacres YOU with his slash.
The draconian commander massacres YOU with his slash.
59H 130V 4992704X 430C [Xtal:V.Bad] [the draconian commander:Bad] Mem:4
Exits:NS> 'i never do anything to you
You say 'i never do anything to you'
59H 130V 4992704X 430C [Xtal:V.Bad] [the draconian commander:Bad] Mem:4
Exits:NS>
Elyana glances at you.
59H 130V 4992704X 430C [Xtal:V.Bad] [the draconian commander:Bad] Mem:4
Exits:NS> **** 49 damage
The draconian commander massacres YOU with his slash.
You wish your wounds would stop BLEEDING so much!
The draconian commander massacres YOU with his slash.
You wish your wounds would stop BLEEDING so much!
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS>
Mona focuses harshly on you and utters the words, 'hold person'.
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS>
Elyana focuses harshly on you and utters the words, '* energy drain'.
Elyana slowly fades into existence.
Luckily for you Elyana slept during draining-lessons.
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS> l
You are unable to use your physical form.
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS> re
The draconian commander utters the words, 'blur'.
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS> rec recall
You are unable to use your physical form.
10H 130V 4992704X 430C [Xtal:Awful] [the draconian commander:Bad] Mem:4
Exits:NS> The draconian commander massacres YOU with his
slash.
You're dead.
********* HOLD GONE ************
**** LOST INVISIBILITY ****
You feel weaker.
**** LOST INVISIBILITY ****
The ball of light following you winks out.
**** DET INVIS GONE ****
0) Leave Arctic.
1) Enter the game.
2) Change your description.
3) Change your password.
4) Delete this character.
Make a choice: sigh

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
