<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

fresno + kxzis rip

POV: Scelesta

Log Rating: 0.5455

some randomers try to random the randoming kings

Manny tells your group 'puff'
317H 156V 21440948X 3972C Mem:1 Exits:EW>
Manny tells your group 'some fuck just held me'
317H 156V 21440948X 3972C Mem:1 Exits:EW> grou
Your group of 2 members consists of:
Member Hits Move Position Fly Inv Water Light Mem
-----------------------------------------------------------------------
-
Manny perfect rested standing Y N N 1 2
Scelesta perfect rested resting Y Y N 1 1
317H 156V 21440948X 3972C Mem:1 Exits:EW> gt
What do you wish to tell your group?
317H 156V 21440948X 3972C Mem:1 Exits:EW> st
You stand up.
317H 156V 21440948X 3972C Mem:3 Exits:EW> relo manny
You utter the words, 'relocate'
Guild Road
The roads leads east and west between the buildings and halls. To the
north is the warriors' arena, where sounds of clashing weapons can be
heard. South of you, followers of Takhisis dressed in dark metal armor
and
wielding dangerous long swords train against one another. Sparks fly
from
bare metal in both directions.
A young kender stands here, looking about curiously.
Manny the Male Wild Elf is standing here. (flying)
Kxzis the Male Gnome is standing here.
317H 156V 21440948X 3972C Mem:4 Exits:NESW>
Kxzis focuses harshly on Manny and utters some strange words.
317H 156V 21440948X 3972C Mem:4 Exits:NESW> ki manny
You barely hit Manny.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW>
Kxzis focuses harshly on Manny and utters some strange words.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW>
You feel yourself exposed.
You barely hit Manny.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW>
You notice some movement in the room.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW> c 'h p' kxzis
You cannot concentrate enough to cast!
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW>
Lakhan yells 'tarnished silver ring for free in inn'
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:4
Exits:NESW> c 'h p' kxzis
You utter the words, 'hold person'
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:5
Exits:NESW> c 'h p' kxzis
Kxzis focuses harshly on you and utters some strange words.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:5
Exits:NESW>
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:5
Exits:NESW>
A mouse arrives from the east.
317H 156V 21440948X 3972C [Scelesta:Perfect] [Manny:V.Good] Mem:5
Exits:NESW>
Manny cleaves YOU extremely hard.
302H 156V 21440948X 3972C [Scelesta:V.Good] [Manny:V.Good] Mem:5
Exits:NESW> You utter the words,
'hold person'
302H 156V 21440948X 3972C [Scelesta:V.Good] [Manny:V.Good] Mem:5
Exits:NESW>
Manny crashes into Kxzis in a thundering collision, knocking him to the
ground!
302H 156V 21440948X 3972C [Scelesta:V.Good] [Manny:V.Good] Mem:5
Exits:NESW> flee
flee
sca
Kxzis misses Manny with his hit.
Manny misses you and destroys an image.
302H 156V 21440948X 3972C [Scelesta:V.Good] [Manny:V.Good] Mem:5
Exits:NESW> You notice some move
ment in the room.
You flee head over heels.
Guild Road
The road leads east and west between the buildings and halls. To the
north is the rangers' guild, while to the south is a large hall
occupied by
druids.
Fresno the Male Human is standing here.
302H 155V 21440948X 3972C Mem:5 Exits:NESW> c 'f b' kxzis
You're not fighting, why bother fleeing?
302H 155V 21440948X 3972C Mem:5 Exits:NESW> Looking north:
Green-clad rangers string their bows for a hunt.
A drunken sailor steadies himself as he tries to stagger back to his
boat.
A solemn looking ranger stands here, protecting patrons of the guild.
The master ranger is kneeling here, examining tracks of a long-gone
apprentice.
Looking east:
Bulky fighters clog the road.
A young kender stands here, looking about curiously.
A mouse scampers about, scavenging for food and carefully avoiding the
feral cats.
Manny the Male Wild Elf is standing here, fighting Kxzis. (flying)
Kxzis the Male Gnome is sitting here, fighting Manny.
Looking south:
A mongrel flees from the door as his skin turns stone hard.
A drunken sailor steadies himself as he tries to stagger back to his
boat.
A massive black panther is here, tail swishing from side to side.
The master druid stands here, looking very somber.
Looking west:
Various colored robes glide along the road.
sca
A black-robed priest of Hiddukel is here, trying to find his temple.
A black-robed priest of Hiddukel is here, trying to find his temple.
A percheron is standing here.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
302H 155V 21440948X 3972C Mem:5 Exits:NESW> Who should the spell be
cast upon?
302H 155V 21440948X 3972C Mem:5 Exits:NESW> e
c 'f b' kxzis
Guild Road
The roads leads east and west between the buildings and halls. To the
north is the warriors' arena, where sounds of clashing weapons can be
heard. South of you, followers of Takhisis dressed in dark metal armor
and
wielding dangerous long swords train against one another. Sparks fly
from
bare metal in both directions.
A young kender stands here, looking about curiously.
A mouse scampers about, scavenging for food and carefully avoiding the
feral cats.
Manny the Male Wild Elf is standing here, fighting Kxzis. (flying)
Kxzis the Male Gnome is sitting here, fighting Manny.
302H 154V 21440948X 3972C Mem:5 Exits:NESW> You can't remember how to
cast that spell!
302H 154V 21440948X 3972C Mem:5 Exits:NESW>
Manny cleaves Kxzis extremely hard.
Kxzis misses Manny with his hit.
302H 154V 21440948X 3972C Mem:5 Exits:NESW>
Manny crashes into Kxzis in a thundering collision, knocking him to the
ground!
302H 154V 21440948X 3972C Mem:5 Exits:NESW> watch manny
You now watch Manny.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:Fair**] Mem:5
Exits:NESW> c 'l b' kxzis
You utter the words, 'lightning bolt'
The lightning bolt hits Kxzis with full impact.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:Bad**] Mem:6
Exits:NESW>
Manny's mightly cleave almost cuts Kxzis in two.
Manny annihilates Kxzis with his cleave.
Kxzis misses Manny with his hit.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:V.Bad**] Mem:6
Exits:NESW>
Manny cleaves Kxzis extremely hard.
Kxzis misses Manny with his hit.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:V.Bad**] Mem:6
Exits:NESW>
You notice some movement in the room.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:V.Bad**] Mem:6
Exits:NESW>
Manny crashes into Kxzis in a thundering collision, knocking him to the
ground!
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:Awful**] Mem:6
Exits:NESW>
A mouse leaves north.
302H 154V 21440948X 3972C [**Manny:V.Good**] [**Kxzis:Awful**] Mem:6
Exits:NESW> w
Guild Road
The road leads east and west between the buildings and halls. To the
north is the rangers' guild, while to the south is a large hall
occupied by
druids.
Fresno the Male Human is standing here.
302H 153V 21440948X 3972C Mem:6 Exits:NESW>
Fresno tries to backstab you, but he misses and destroys your image.
302H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Perfect] Mem:6
Exits:NESW>
You stop watching Manny.
302H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Perfect] Mem:6
Exits:NESW>
You notice some movement in the room.
302H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Perfect] Mem:6
Exits:NESW>
Fresno misses you and destroys an image.
Fresno pierces YOU hard.
You miss Fresno with your hit.
You make a twirling motion with the wand, and point it at Fresno.
You watch with selfpride as your wand's magic missile hits Fresno.
You watch with selfpride as your wand's magic missile hits Fresno.
You watch with selfpride as your wand's magic missile hits Fresno.
You watch with selfpride as your wand's magic missile hits Fresno.
294H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Good] Mem:6
Exits:NESW>
Fresno panics, and attempts to flee.
Fresno leaves south.
294H 153V 21440948X 3972C Mem:6 Exits:NESW> gt fresno
You tell your group 'fresno'
294H 153V 21440948X 3972C Mem:6 Exits:NESW>
Your blood freezes as you hear someone's death cry.
294H 153V 21440948X 3972C Mem:6 Exits:NESW> gt attacked me
You tell your group 'attacked me'
294H 153V 21440948X 3972C Mem:6 Exits:NESW> sca
You notice some movement in the room.
294H 153V 21440948X 3972C Mem:6 Exits:NESW> Looking north:
Green-clad rangers string their bows for a hunt.
A drunken sailor steadies himself as he tries to stagger back to his
boat.
A solemn looking ranger stands here, protecting patrons of the guild.
The master ranger is kneeling here, examining tracks of a long-gone
apprentice.
Looking east:
Bulky fighters clog the road.
Manny the Male Wild Elf is standing here. (flying)
Looking south:
A mongrel flees from the door as his skin turns stone hard.
A drunken sailor steadies himself as he tries to stagger back to his
boat.
A massive black panther is here, tail swishing from side to side.
The master druid stands here, looking very somber.
Looking west:
Various colored robes glide along the road.
A black-robed priest of Hiddukel is here, trying to find his temple.
A percheron is standing here.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
294H 153V 21440948X 3972C Mem:6 Exits:NESW>
Fresno tried to backstab you, but you avoid him.
294H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Good] Mem:6
Exits:NESW> get here
You don't see what you are looking for here.
294H 153V 21440948X 3972C [Scelesta:V.Good] [Fresno:Good] Mem:6
Exits:NESW>
Fresno pierces YOU hard.
Fresno misses you with his pierce.
You miss Fresno with your hit.
The lightning has stopped.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Good] Mem:6
Exits:NESW> c 'h p'
You utter the words, 'hold person'
Fresno freezes in place.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Good] Mem:7
Exits:NESW> gt fresno freezes
Fresno laughs heartily.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Good] Mem:7
Exits:NESW> gt come bash it dea
d
You tell your group 'fresno freezes'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Good] Mem:7
Exits:NESW> c 'l b'
You tell your group 'come bash it dead'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Good] Mem:7
Exits:NESW> You utter the words
, 'lightning bolt'
The lightning bolt hits Fresno with full impact.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:8
Exits:NESW>
You notice some movement in the room.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:8
Exits:NESW> l fresno
c 'e drain'
Fresno says 'dont take my gear!'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:8
Exits:NESW> You see nothing speci
al about him.
Fresno the young adult male human has quite a few wounds.
Fresno is using:
<used in primary hand> an ebony spear
<used in secondary hand> a short sword
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:8
Exits:NESW> You utter the words,
'energy drain'
You make a feeble attempt at draining Fresno.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW>
Manny tells your group 'where'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW>
Fresno says 'please!'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW>
Manny flies in from the east.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW>
Manny flies west.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW>
Manny flies in from the west.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW> gt WEST
Manny crashes into Fresno in a thundering collision, knocking him to
the ground!
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW> c 'e drain'
You tell your group 'WEST'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:10
Exits:NESW> You utter the words,
'energy drain'
You drain Fresno of some of his energy.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:12
Exits:NESW>
Manny cleaves Fresno extremely hard.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:12
Exits:NESW> c 'e drain'
You utter the words, 'energy drain'
You make a feeble attempt at draining Fresno.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Fair] Mem:14
Exits:NESW>
Manny massacres Fresno with his cleave.
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Bad] Mem:14
Exits:NESW> c 'l b'
Fresno says 'NOOOOOOOOOOOOOOOO'
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:Bad] Mem:14
Exits:NESW>
Fresno rolls on the floor in a fit of laughter.
Manny crashes into Fresno in a thundering collision, knocking him to
the ground!
303H 156V 21440948X 3972C [Scelesta:V.Good] [Fresno:V.Bad] Mem:14
Exits:NESW> You utter the words
, 'lightning bolt'
Your lightning bolt shatters Fresno to pieces.
You receive 0 experience.
Fresno is dead! R.I.P.
303H 156V 21440948X 3972C [Fresno:Dying] Mem:15 Exits:NESW>
The death cry of Fresno echoes from somewhere nearby...
303H 156V 21440948X 3972C Mem:15 Exits:NESW> get all corpse
You get a large pile of coins from the corpse of Fresno.
There were 126 coins.
303H 156V 21440948X 4098C Mem:15 Exits:NESW> You get a short sword from
the corpse of Fresno.
You get an ebony spear from the corpse of Fresno.
303H 156V 21440948X 4098C Mem:15 Exits:NESW> Warning: your input
'coins.' ignored.
You divide 126 coins equally among the group members present.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
