<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Murdah RIP

POV: Scelesta

Log Rating: 2.3333

A few randomers try to hurt my friends.

Drin tries to bash you, but she passes right through your image.
272H 115V 15779823X 2594C [Scelesta:Perfect] [Drin:Perfect] Mem:3
Exits:NESW>
Groo tells your group 'dko'
272H 115V 15779823X 2594C [Scelesta:Perfect] [Drin:Perfect] Mem:3
Exits:NESW> flee
Groo tells your group 'ft'
272H 115V 15779823X 2594C [Scelesta:Perfect] [Drin:Perfect] Mem:3
Exits:NESW> flee
You flee head over heels.
Path Through the Marketplace
The dwarven marketplace stretches out all about you. The dwarven
merchants show off their goods to the multitude of customers who walk
by.
The noise of all the activity begins to overwhelm you with its
magnitude.
To the west, the path leads towards the heart of Thorbardin, while to
the
east, the path leads to the gates out of the keep.
272H 114V 15779823X 2594C Mem:3 Exits:NESW> You're not fighting, why
bother fleeing?
272H 114V 15779823X 2594C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking west:
You see nothing special.
A dwarven warrior is here, guarding the marketplace.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is sitting here. (flying)
Murdah the Male Gnome is standing here. (flying) (invisible)
. . . is enveloped in flames.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Groo tells your group 'etc on this'
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Xion tells your group 'what the hell'
272H 114V 15779823X 2594C Mem:3 Exits:NESW> yell boggle?
You yell 'boggle?'
272H 114V 15779823X 2594C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking west:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
A dwarven warrior is here, guarding the marketplace.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is sitting here. (flying)
Murdah the Male Gnome is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Saladin tells your group 'lets do khaloris!'
272H 114V 15779823X 2594C Mem:3 Exits:NESW> cast 'f b' murdah
Who should the spell be cast upon?
272H 114V 15779823X 2594C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking west:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
A dwarven warrior is here, guarding the marketplace.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is sitting here. (flying)
Murdah the Male Gnome is standing here. (flying) (invisible)
. . . is enveloped in flames.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Groo tells your group 'not full course'
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Groo tells your group 'k'
272H 114V 15779823X 2594C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking west:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
A dwarven warrior is here, guarding the marketplace.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is standing here. (flying)
Murdah the Male Gnome is standing here. (flying) (invisible)
. . . is enveloped in flames.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Murdah yells 'learn the mud noob'
272H 114V 15779823X 2594C Mem:3 Exits:NESW> sca
Looking north:
You see nothing special.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking west:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
A dwarven warrior is here, guarding the marketplace.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is standing here. (flying)
Murdah the Male Gnome is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Groo tells your group 'perfect for khar'
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Murdah flies in from the west.
Drin flies in from the west.
Saslehoff flies in from the west.
272H 114V 15779823X 2594C Mem:3 Exits:NESW>
Murdah focuses harshly on you and utters the words, 'magic missile'.
Murdah misses you and destroys an image.
Murdah misses you and destroys an image.
Murdah misses you and destroys an image.
The images around you fade out of existance.
Murdah slowly fades into existence.
You stagger as a magic missile from Murdah hits you.
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:Perfect] Mem:3
Exits:NESW> sc
You are Scelesta Fiesta, Crashing the Trailer Trash Parties, a level 28
Mage.
You are 39 years old.
You have 265(272) hit and 114(152) movement points.
You are influenced by the black moon, Nuitari.
You have scored 78220177 exp, and have 2594(5549) steel coins.
You need 15779823 more experience to advance.
You have died 22 horrible deaths.
You have been connected for 45 minute(s).
You have been playing for 25 day(s), 9 hour(s) and 26 minute(s).
You are standing.
You are flying.
You are fighting Murdah.
You are following Chun.
You are affected by the following:
fly
clairvoyance
antimagic shell
improved invisibility
detect invisibility
continual light
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:Perfect] Mem:3
Exits:NESW>
You step aside as Drin tries to bash you, causing her to tumble and
fall face down.
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:Perfect] Mem:3
Exits:NESW>
A dwarven merchant arrives from the west.
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:Perfect] Mem:3
Exits:NESW> cast 'f b' murdah
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Murdah.
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:V.Bad] Mem:4
Exits:NESW>
Saslehoff misses you with his bludgeon.
265H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:V.Bad] Mem:4
Exits:NESW> cast 'f b' murdah
You feel yourself exposed.
Saslehoff misses you with his bludgeon.
Drin slashes YOU hard.
Murdah misses you with his hit.
257H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:V.Bad] Mem:4
Exits:NESW>
Groo tells your group 'all stocked up?'
257H 114V 15779823X 2594C [Scelesta:V.Good] [Murdah:V.Bad] Mem:4
Exits:NESW>
Murdah panics, and attempts to flee.
You direct your attention to Saslehoff.
Murdah flies south.
257H 114V 15779823X 2594C [Scelesta:V.Good] [Saslehoff:V.Good] Mem:4
Exits:NESW> Who should the s
pell be cast upon?
257H 114V 15779823X 2594C [Scelesta:V.Good] [Saslehoff:V.Good] Mem:4
Exits:NESW> flee
Saslehoff misses you with his bludgeon.
Drin slashes YOU hard.
249H 114V 15779823X 2594C [Scelesta:V.Good] [Saslehoff:V.Good] Mem:4
Exits:NESW> cast 'f b' murda
h
You flee head over heels.
Center of the Marketplace
Here, at the center of the marketplace, the traders and customers roam
all about. The noise of haggling and bartering combines with the clink
of
coins and moving of heavy goods to nearly deafen you. To the east and
west
stretches the main path through Thorbardin keep, running from the gates
to
the keep to the east to the gates to the mountain itself to the west. A
smaller road runs north and south through the marketplace.
A white marble fountain offers refreshment to weary travelers here.
249H 113V 15779823X 2594C Mem:4 Exits:NESW> Who should the spell be
cast upon?
249H 113V 15779823X 2594C Mem:4 Exits:NESW> sca
Looking north:
You see nothing special.
A dwarven warrior is here, guarding the marketplace.
A dwarven merchant looks you over, determining if you have any money.
A dwarven warrior is here, guarding the marketplace.
Looking east:
You see nothing special.
Murdah the Male Gnome is standing here. (flying)
. . . is enveloped in flames.
A dwarven merchant looks you over, determining if you have any money.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
Drin the Female Goblin is sitting here. (flying)
Looking south:
You see nothing special.
A dwarven warrior is here, guarding the marketplace.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
249H 113V 15779823X 2594C Mem:4 Exits:NESW> e
s
Groo tells your group 'mass invis, fly us '
249H 113V 15779823X 2594C Mem:4 Exits:NESW> Path Through the
Marketplace
The dwarven marketplace stretches out all about you. The dwarven
merchants show off their goods to the multitude of customers who walk
by.
The noise of all the activity begins to overwhelm you with its
magnitude.
To the west, the path leads towards the heart of Thorbardin, while to
the
east, the path leads to the gates out of the keep.
A dwarven merchant looks you over, determining if you have any money.
Drin the Female Goblin is sitting here. (flying)
249H 112V 15779823X 2594C Mem:4 Exits:NESW> s
The Marketplace
All the activity of the marketplace around you...the merchants
attracting customers with their shouts about how they have the best
prices
in the whole marketplace, the customers haggling with the merchants
over
the best prices, the guards marching about in their heavy armor...all
tend
to overwhelm you as the noise grows.
249H 111V 15779823X 2594C Mem:4 Exits:NESW>
Nimnogg tells your group '****** TICK IN ABOUT 15 ******'
249H 111V 15779823X 2594C Mem:4 Exits:NESW> The Marketplace
The marketplace continues all about you. The merchants, visitors, and
guards roam all about. To the south, one of the high walls of the keep
rises, protecting you from the outside world. On top of this wall, you
spy
the outline of sentries moving about, guarding the keep and its market
from
the evils outside.
249H 110V 15779823X 2594C Mem:4 Exits:NEW> n
Saladin tells your group 'quick fast xp cash ranks'
249H 110V 15779823X 2594C Mem:4 Exits:NEW> n
cast 'f b' murdah
The Marketplace
The Marketplace
All the activity of the marketplace around you...the merchants
attracting customers with their shouts about how they have the best
prices
in the whole marketplace, the customers haggling with the merchants
over
the best prices, the guards marching about in their heavy armor...all
tend
to overwhelm you as the noise grows.
249H 109V 15779823X 2594C Mem:4 Exits:NESW> Path Through the
Marketplace
The dwarven marketplace stretches out all about you. The dwarven
merchants show off their goods to the multitude of customers who walk
by.
The noise of all the activity begins to overwhelm you with its
magnitude.
To the west, the path leads towards the heart of Thorbardin, while to
the
east, the path leads to the gates out of the keep.
A dwarven merchant looks you over, determining if you have any money.
Drin the Female Goblin is standing here. (flying)
249H 108V 15779823X 2594C Mem:4 Exits:NESW>
Murdah flies in from the north.
Saslehoff flies in from the north.
249H 108V 15779823X 2594C Mem:4 Exits:NESW>
You are sent sprawling as Drin crashes into you.
Murdah flies east.
Saslehoff flies east.
233H 108V 15779823X 2594C [Scelesta:Good] [Drin:Perfect] Mem:4
Exits:NESW> sca
Drin slashes YOU extremely hard.
You drain Drin very hard.
213H 108V 15779823X 2594C [Scelesta:Good] [Drin:V.Good] Mem:4
Exits:NESW>
213H 108V 15779823X 2594C [Scelesta:Good] [Drin:V.Good] Mem:4
Exits:NESW>
Drin slashes YOU extremely hard.
You miss Drin with your drain.
193H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW>
Groo tells your group 'i wanna be fast heh'
193H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> Who should the spell be
cast upon?
193H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> Looking north:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking east:
You see nothing special.
A dwarven merchant looks you over, determining if you have any money.
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
You step aside as Drin tries to bash you, causing her to tumble and
fall face down.
193H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW>
Drin slashes YOU very hard.
You should probably stand up!
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> reply come
Xion tells your group 'do hierophant'
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> st
cast 'f b' murdah
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> You stand up.
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> Who should the spell be
cast upon?
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> l
Path Through the Marketplace
The dwarven marketplace stretches out all about you. The dwarven
merchants show off their goods to the multitude of customers who walk
by.
The noise of all the activity begins to overwhelm you with its
magnitude.
To the west, the path leads towards the heart of Thorbardin, while to
the
east, the path leads to the gates out of the keep.
A dwarven merchant looks you over, determining if you have any money.
Drin the Female Goblin is sitting here, fighting YOU. (flying)
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:4
Exits:NESW> cast 'f b'
You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Drin.
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Chun tells your group 'scelesta fighting them'
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Groo tells your group 'so if im slow feel free take over'
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Chun tells your group 'scelesta fighting them'
179H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Drin slashes YOU extremely hard.
163H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
cast 'h p'
Groo tells your group 'where'
163H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Xion tells your group 'tab loads are raised i thought'
163H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
You can't remember how to
cast that spell!
163H 108V 15779823X 2594C [Scelesta:Fair] [Drin:Good] Mem:5 Exits:NESW>
Drin slashes YOU very hard.
You are thirsty.
166H 142V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:13
Exits:NESW>
Monalis tells you 'coming on tic'
166H 142V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:13
Exits:NESW>
Murdah flies in from the west.
Saslehoff flies in from the west.
166H 142V 15779823X 2594C [Scelesta:Fair] [Drin:V.Good] Mem:13
Exits:NESW>
Murdah focuses harshly on you and utters the words, 'lightning bolt'.
YOU'RE HIT. A lightning bolt from Murdah has reached its goal.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:13
Exits:NESW>
Nimnogg tells your group 'where?'
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:13
Exits:NESW> mirror
Drin stands up.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:13
Exits:NESW> You utter the words, 'm
irror image'
You are surrounded by 4 duplicate images.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:15
Exits:NESW>
Drin tries to bash you, but she passes right through your image.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:15
Exits:NESW>
Chun tells your group 'dunno'
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:15
Exits:NESW> quaff flask
Drin misses you and destroys an image.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:15
Exits:NESW>
Murdah focuses harshly on you and utters the words, 'lightning bolt'.
Murdah misses you and destroys an image.
117H 142V 15779823X 2594C [Scelesta:Bad] [Drin:V.Good] Mem:15
Exits:NESW> cast 'f b' murdah
You desparately quaff a flask of clear liquid.
Large open gashes on your body stop bleeding and heal.
Large open gashes on your body stop bleeding and heal.
246H 142V 15779823X 2594C [Scelesta:V.Good] [Drin:V.Good] Mem:15
Exits:NESW> You utter the words,
'force bolt'
Your force bolt shatters Murdah's skull into lifeless goo.
You receive 0 experience.
Murdah is dead! R.I.P.
246H 142V 15779823X 2594C [Scelesta:V.Good] [Drin:V.Good] Mem:18
Exits:NESW>
The death cry of Murdah echoes from somewhere nearby...
Drin stops following Murdah.
Murdah now follows Drin.
Drin is the new leader of Murdah's group.
Murdah stops following Drin.
Saslehoff stops following Murdah.
Saslehoff now follows Drin.
246H 142V 15779823X 2594C [Scelesta:V.Good] [Drin:V.Good] Mem:18
Exits:NESW> get all corpse
Drin slashes YOU extremely hard.
231H 142V 15779823X 2594C [Scelesta:Good] [Drin:V.Good] Mem:18
Exits:NESW>
Drin stands up.
231H 142V 15779823X 2594C [Scelesta:Good] [Drin:V.Good] Mem:18
Exits:NESW> You get an ivy wristba
nd from the corpse of Murdah.
You get an ivy wristband from the corpse of Murdah.
You get a dirty leather beltpouch from the corpse of Murdah.
You get a traveler's robe from the corpse of Murdah.
You get a carved marble shield from the corpse of Murdah.
You get a pair of black ice arm guards from the corpse of Murdah.
You get a pair of black cloth gloves from the corpse of Murdah.
You get a pair of leather moccasins from the corpse of Murdah.
You get a pair of plain leather pants from the corpse of Murdah.
You get a carved marble mask from the corpse of Murdah.
You get a green leather plate from the corpse of Murdah.
You get a lucky bone charm from the corpse of Murdah.
You get a white necklace of large beads from the corpse of Murdah.
You get a gaudy silver ring from the corpse of Murdah.
You get a gaudy silver ring from the corpse of Murdah.
You get a pile of coins from the corpse of Murdah.
There were 98 coins.
You get an elven cloak from the corpse of Murdah.
You get a herbal satchel from the corpse of Murdah.
You get a stylish black leather vest from the corpse of Murdah.
You get a nereid's shawl from the corpse of Murdah.
You get a small canteen from the corpse of Murdah.
You get a small canteen from the corpse of Murdah.
You get a waterskin from the corpse of Murdah.
You get a large hide waterskin from the corpse of Murdah.
You get a falconer's gauntlet from the corpse of Murdah.
You get a scroll of recall from the corpse of Murdah.
Potion : You can't carry that many items.
Leg : You can't carry that many items.
Leg : You can't carry that many items.
Leg : You can't carry that many items.
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:V.Good] Mem:18
Exits:NESW> cast 'web'
You utter the words, 'web'
You throw webbing all over Drin!
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:V.Good] Mem:19
Exits:NESW>
Drin tries to move, but she cannot break the webs around herself!
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:V.Good] Mem:19
Exits:NESW> cast 'f b'
Chun tells your group 'looks like hes doing alright'
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:V.Good] Mem:19
Exits:NESW> You utter the words, '
force bolt'
You hear bones crack as your force bolt slams into Drin.
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:Fair] Mem:22
Exits:NESW> gt puff
Saslehoff focuses harshly on you and utters some strange words.
Saslehoff misses you and destroys an image.
The images around you fade out of existance.
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:Fair] Mem:22
Exits:NESW> cast 'f b'
Drin tries to move, but she cannot break the webs around herself!
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:Fair] Mem:22
Exits:NESW> You tell your group 'puf
f'
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:Fair] Mem:22
Exits:NESW> You utter the words, 'fo
rce bolt'
You hear bones crack as your force bolt slams into Drin.
231H 142V 15779823X 2692C [Scelesta:Good] [Drin:Fair] Mem:25
Exits:NESW>
Saslehoff focuses harshly on you and utters some strange words.
Your flesh burns as Saslehoff enshrouds you in a cloak of flames.
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Fair] Mem:25
Exits:NESW>
Drin tries to move, but she cannot break the webs around herself!
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Fair] Mem:25
Exits:NESW>
Xion appears before you in a puff of smoke.
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Fair] Mem:25
Exits:NESW> cast 'e drain'
A dwarven merchant leaves south.
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Fair] Mem:25
Exits:NESW>
Chun appears before you in a puff of smoke.
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Fair] Mem:25
Exits:NESW> You utter the words, 'en
ergy drain'
You drain Drin of some of her energy.
198H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Bad] Mem:29 Exits:NESW>
Drin slashes YOU extremely hard.
179H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Bad] Mem:29 Exits:NESW>
Saslehoff focuses harshly on you and utters some strange words.
Your flesh burns as Saslehoff enshrouds you in a cloak of flames.
145H 142V 15779823X 2692C [Scelesta:Fair] [Drin:Bad] Mem:29 Exits:NESW>
Drin grabs a glowing scroll of recall.
Drin recites a glowing scroll of recall.
Drin disappears.
cast 'e drain'
cast 'e drain' saslehoff
Unexpected end of input:
You must specify a character to perform that action on.
145H 142V 15779823X 2692C Mem:29 Exits:NESW> You utter the words,
'energy drain'
You drain Saslehoff of some of his energy.
145H 142V 15779823X 2692C [Scelesta:Fair] [Saslehoff:Perfect] Mem:33
Exits:NESW>
Saslehoff grabs a scroll of recall.
Saslehoff recites a scroll of recall.
Saslehoff disappears.
145H 142V 15779823X 2692C Mem:33 Exits:NESW>
Chun tells your group 'hahahahha'
145H 142V 15779823X 2692C Mem:33 Exits:NESW> relo saslehoff
You utter the words, 'relocate'
A Side Street
The street ends in a rough-shod barricade. For some unknown reason, the
peasants that once lived here seem to have left and tried to stop
outsiders
from entering this area. Several burnt torches have been stuck into the
walls, finding niches and holes in the crude furniture that has been
used
in a futile effort. It seems that had the barricade not been there, you
could probably have found a way to get back to the main square from
here. A
tall, deserted house lies to the west, its door has been forced open
and
there is a faint smell of ashes and old smoke. A symbol of death
appears to
have been carved into the wood surround with a knife.
Saslehoff the Male Kender is standing here. (flying)
. . . has a tough exterior.
A feral cat parades her territory and sniffs your leg.
A feral cat parades her territory and sniffs your leg.
A feral cat pounces on a piece of dirt.
145H 142V 15779823X 2692C Mem:35 Exits:NW>
Chun tells your group 'he drained 2 ppl'
Saslehoff flies north.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
