<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Elyana RIP

POV: Scelesta

Log Rating: 2.1429

Elyana falls for some trap.

Ipu tells your group 'WIZ EYE: Elyana has arrived from the west exit.'
272H 156V 1827252X 2063C Mem:4 Exits:NESW> You now watch a fire
salamander.
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW>
Ipu tells your group 'no offense, but main group > scelesta'
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW>
Ipu tells your group 'WIZ EYE: Elyana has left through the east exit.'
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW> sc
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW>
Ipu tells your group 'hm'
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW>
Ipu tells your group 'WIZ EYE: Elyana has arrived from the north exit.'
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW>
Ipu tells your group 'WIZ EYE: Elyana has left through the south exit.'
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW> flee
flee
You're not fighting, why bother fleeing?
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW> n
You're not fighting, why bother fleeing?
272H 156V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW> n
A fire salamander arrives from the south.
X'thal Road
The road seems to narrow towards the south. There is a noticable
difference in the Vry-kith of this area. Although they don't appear to
be
as industrious as dangerous. Each Vry-kith you see stands a head taller
then it's brethren, and glint off their black ice armour is menacing in
the
least. There also are fewer merchants here, and what outlanders you see
are heavily armed.
Exuding heat, a salamander slithers around here.
A Vry-kith child wanders around here.
272H 155V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> flee
A fire salamander arrives from the south.
X'thal Road
You continue through the southern part of the village. The Vry-kith
are constantly going darting to and fro. You gaze in bewilderment as
the
seemingly tireless insectoids go about their errands. The sounds of
clicking can be heard throughout the village. The domes are scattered
about in some haphazard pattern.
Exuding heat, a salamander slithers around here.
272H 154V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NSW> flee
You're not fighting, why bother fleeing?
272H 154V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NSW> n
You're not fighting, why bother fleeing?
272H 154V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NSW> n
A fire salamander arrives from the south.
The Village Commons
You have reached the center of the village. The two main roads of the
village intersect in a large grassy expanse. Several outland merchants
scurry about, almost frantically attempting to trade with the Vry-kith.
This is the only part of the village which doesn't have crystal domes
scattered about. Your eyes drift towards a small wooden sign that has
been
placed near the center of the commons.
Exuding heat, a salamander slithers around here.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
272H 153V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NESW> A fire salamander arrives from the south.
X'thal Road
As you approach closer to the center of the village, the domes become
clustered closer together. Immediately to the east is a uniquely
familiar
building. The stark angular lines draw your attention to it, and the
warm
smell of smoke beckons to your senses.
Exuding heat, a salamander slithers around here.
272H 152V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> cast 'm m' elyana
Who should the spell be cast upon?
272H 152V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> sca
Looking north:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
An outland mercenary stares at you and snarls in contempt.
Looking east:
You see nothing special.
Chun Li is standing here. (flying) (invisible)
Kieri stands behind a desk and greets you warmly as you enter.
Looking south:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 152V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> e
A fire salamander arrives from the west.
Kieri's Fire
The inn is made from pure black wood, found only in the southern
tundra. The blazing fire caresses you with heat, erasing the chills and
depression of the icy winds. You notice several large casks of wine
layered upon the northern wall, for it seems Kieri is well versed in
removing the pall of the harsh wasteland. Glancing westward you see a
stairway heading upwards.
Exuding heat, a salamander slithers around here.
Chun Li is standing here. (flying) (invisible)
Kieri stands behind a desk and greets you warmly as you enter.
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
Sindbad has entered the game.
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
fol teraz
fol teraz
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
w
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
cast 'm m' elyana
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
I see no person by that name here!
272H 151V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4 Exits:W>
A fire salamander arrives from the east.
X'thal Road
As you approach closer to the center of the village, the domes become
clustered closer together. Immediately to the east is a uniquely
familiar
building. The stark angular lines draw your attention to it, and the
warm
smell of smoke beckons to your senses.
Exuding heat, a salamander slithers around here.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> Who should the spell be cast upon?
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> sca
Looking north:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
An outland mercenary stares at you and snarls in contempt.
Looking east:
You see nothing special.
Teraz the Male Dwarf is standing here. (flying)
Sindbad the Sailortaur is standing here. (flying) (invisible)
Chun Li is standing here. (flying) (invisible)
Kieri stands behind a desk and greets you warmly as you enter.
Looking south:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> sca
Looking north:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
An outland mercenary stares at you and snarls in contempt.
Looking east:
You see nothing special.
Teraz the Male Dwarf is standing here. (flying)
Sindbad the Sailortaur is standing here. (flying) (invisible)
Chun Li is standing here. (flying) (invisible)
Kieri stands behind a desk and greets you warmly as you enter.
Looking south:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> cast 'm m' elyana
Who should the spell be cast upon?
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> cast 'm m' elyana
A vry-kith child arrives from the south.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES>
Elyana flies in from the north.
A troll arrives from the north.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:4
Exits:NES> You utter the words, 'magic missile'
You miss Elyana and destroy an image instead.
You miss Elyana and destroy an image instead.
You miss Elyana and destroy an image instead.
Your missiles are mysteriously deflected.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Elyana flies south.
A troll leaves south.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Teraz flies in from the east.
Sindbad flies in from the east.
Chun flies in from the east.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES> sca
Ipu flies in from the east.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Elyana flies in from the south.
A troll arrives from the south.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Sindbad slowly fades into existence.
Sindbad crashes into Elyana in a thundering collision, knocking her to
the ground!
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Elyana steps aside as Teraz attempts a bash, stumbles, and falls flat
on his face.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES> fol teraz
Looking north:
You see nothing special.
A Vry-kith child wanders around here.
A Vry-kith child wanders around here.
An outland mercenary stares at you and snarls in contempt.
Looking east:
You see nothing special.
Kieri stands behind a desk and greets you warmly as you enter.
Looking south:
You see nothing special.
A Vry-kith child wanders around here.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES> You stop following Ipu.
You now follow Teraz.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Ipu now follows Teraz.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES>
Teraz misses Elyana and destroys an image instead.
Sindbad annihilates Elyana with his cleave.
Elyana misses Sindbad with her pierce.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES> cast 'f b' elyana
Chun focuses harshly on Elyana and utters the words, 'force bolt'.
Chun slowly fades into existence.
The sound of bones cracking echoes as Chun's force bolt slams into
Elyana.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:5
Exits:NES> You utter the words, 'force bolt'
You hear bones crack as your force bolt slams into Elyana.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> cast 'f b' elyana
Teraz annihilates Elyana with his stab.
Sindbad massacres Elyana with his cleave.
Elyana is dead! R.I.P.
get coins corpse
The death cry of Elyana echoes from somewhere nearby...
A troll stops following Elyana.
A troll transcends this world and enters another plane.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES>
Ipu gets a very large pile of coins from the corpse of Elyana.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> get all corpse
Ipu gets a short sword from the corpse of Elyana.
Ipu gets a stark white wrist guard from the corpse of Elyana.
Ipu gets a dark blue wrist guard from the corpse of Elyana.
Ipu gets a plain component pouch from the corpse of Elyana.
Ipu gets a blue canvas belt from the corpse of Elyana.
Ipu gets a heavy black cloak with silvery runes from the corpse of
Elyana.
Ipu gets a shield of granite from the corpse of Elyana.
Ipu gets thick padded sleeves from the corpse of Elyana.
Ipu gets a pair of leather gloves from the corpse of Elyana.
Ipu gets a pair of magi boots from the corpse of Elyana.
Ipu gets some black satin pants with deep pockets from the corpse of
Elyana.
Ipu gets a pair of black-rimmed glasses from the corpse of Elyana.
Ipu gets the robe of the elements from the corpse of Elyana.
Ipu gets a skull chain from the corpse of Elyana.
Ipu gets an engraved gold necklace from the corpse of Elyana.
Ipu gets a fiery red ring from the corpse of Elyana.
Ipu gets a glowing ball of fire from the corpse of Elyana.
Ipu gets a golden dwarven ring from the corpse of Elyana.
Ipu gets a milky potion of see invisible from the corpse of Elyana.
Ipu gets a milky potion of see invisible from the corpse of Elyana.
Ipu gets a short sword from the corpse of Elyana.
Ipu gets a milky potion of see invisible from the corpse of Elyana.
Ipu gets a vibrant volatile crimson potion from the corpse of Elyana.
Ipu gets a vibrant volatile crimson potion from the corpse of Elyana.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> Who should the spell be cast upon?
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> Chun is zapped by a loop of darkness and instantly drops it.
Chun gets a small wooden chest from the corpse of Elyana.
Chun gets a short sword from the corpse of Elyana.
Chun gets a rusty crowbar from the corpse of Elyana.
Chun gets a rusty crowbar from the corpse of Elyana.
Chun gets a rusty crowbar from the corpse of Elyana.
The corpse doesn't seem to have what you are looking for.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> The corpse doesn't seem to have what you are looking for.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES>
Teraz stands up.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES>
Sindbad snickers softly.
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> say fuckin rights
You say 'fuckin rights'
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES> in
You are carrying:
a glowing scroll of recall..it glows blue..it glows dimly [3]
a brown peaty potion..it glows blue
a silvery potion..it glows blue
a glowing scroll of recall..it glows blue..it glows dimly [4]
a small wooden chest
a black runed ring..it glows blue
a milky potion of see invisible..it glows blue
some leaves of hemlock
an entire loaf of bread [3]
an emerald shafted javelin..it glows blue
a pretty pink satin gown
a blue potion of remove poison..it glows blue
a greasy goatskin booze bag..it glows blue..it glows dimly
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES>
Teraz says 'we didnt even get heals'
272H 150V 1827252X 2063C [**a fire salamander:Perfect**] Mem:6
Exits:NES>

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
