<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Ambushing more wilds.

POV: Jaime

Log Rating: 1.0000

Ansolism finally comes out of rent to deliver equipment to us.

629H 107V 9026242X 0C Exits:NS>
Dain flies south.
You follow Dain south.
A Road to the Sea
629H 105V 9026242X 0C Exits:NS>
Aten flies in from the south.
Ansolism flies in from the south.
Krieger flies in from the south.
Hocus flies in from the south.
Melee flies in from the south.
Lachplesis flies in from the south.
Loony flies in from the south.
Demaleon flies in from the south.
Arvar flies in from the south.
Santino flies in from the south.
629H 105V 9026242X 0C Exits:NS>
Dain flies south.
You follow Dain south.
A Road to the Sea
629H 103V 9026242X 0C Exits:NW>
Dain flies north.
You follow Dain north.
A Road to the Sea
629H 101V 9026242X 0C Exits:NS> bas ansolismbas ansolism
Dain flies north.
You follow Dain north.
A Road to the Sea
629H 99V 9026242X 0C Exits:NS>
Moona quaffs a brewed potion.
629H 99V 9026242X 0C Exits:NS> bas ansolismYou couldn't find what you
were looking for.
629H 99V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
High Road to Flotsam
629H 97V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
High Road to Flotsam
629H 95V 9026242X 0C Exits:NS> bas ansolismYou couldn't find what you
were looking for.
629H 95V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
High Road to Flotsam
629H 93V 9026242X 0C Exits:NS> bas ansolismYou couldn't find what you
were looking for.
629H 93V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
The Southern Gate To Flotsam
629H 91V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
Market Street
A greedy merchant staggers past you as he attempts to get to the duty
office.
629H 89V 9026242X 0C Exits:NESW> You couldn't find what you were
looking for.
629H 89V 9026242X 0C Exits:NESW> bas ansolismYou couldn't find what you
were looking for.
629H 89V 9026242X 0C Exits:NESW>
Dain flies north.
You follow Dain north.
Market Street
A greedy merchant staggers past you as he attempts to get to the duty
office.
629H 88V 9026242X 0C Exits:NS>
Dain flies north.
You follow Dain north.
Market Street
Santino, the Prodigal Son is standing here. (flying) (invisible)
Arvar, Chekist of the Wild is standing here. (flying) (invisible)
Demaleon the Harbinger of Doom is standing here. (flying) (invisible)
Loony Mukta, Mhwaka Battle Badger is standing here. (flying)
(invisible)
Lachplesis, the Bear Eared Goblin is standing here. (flying)
(invisible)
. . . has a tough exterior.
Melee Pelle, Wild's Water Breathing Nymph is standing here. (flying)
(invisible)
. . . is surrounded by 4 duplicate images.
Hocus Pocus, Alakazam is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Krieger, Wonderboy High up in the Castle made of Clouds is standing
here. (flying) (invisible)
Ansolism, The Wild Answer is standing here. (flying) (invisible)
Aten the Male Human is standing here. (flying) (invisible)
629H 87V 9026242X 0C Exits:NES>
Anathea crashes into Ansolism in a thundering collision, knocking him
to the ground!
629H 87V 9026242X 0C Exits:NES> bas ansolism
Dain flies north.
You follow Dain north.
Market Square
629H 86V 9026242X 0C Exits:NESW> You couldn't find what you were
looking for.
629H 86V 9026242X 0C Exits:NESW> bas ansolism
Aten flies in from the south.
629H 86V 9026242X 0C Exits:NESW>
Dain flies north.
You follow Dain north.
The Variety Stall
The old dwarf Fiagan raises an eyebrow as you browse his barrow.
629H 85V 9026242X 0C Exits:NS> You couldn't find what you were looking
for.
629H 85V 9026242X 0C Exits:NS> bas ansolismYou couldn't find what you
were looking for.
629H 85V 9026242X 0C Exits:NS>
Moona utters some strange words.
Moona conjures a writhing mass of inky black tentacles!
Fiagan the trader narrowly escapes the gruesome black tentacles!
629H 85V 9026242X 0C Exits:NS>
Dain flies south.
You follow Dain south.
Market Square
Aten the Male Human is standing here. (flying) (invisible)
629H 84V 9026242X 0C Exits:NESW> bas ansolismYou couldn't find what you
were looking for.
629H 84V 9026242X 0C Exits:NESW> bas ansolismbas ansolism
Dain flies south.
You follow Dain south.
Market Street
Anathea, A Legend Reborn is standing here, fighting Ansolism. (flying)
Santino, the Prodigal Son is standing here. (flying) (invisible)
Arvar, Chekist of the Wild is standing here. (flying) (invisible)
Demaleon the Harbinger of Doom is standing here. (flying) (invisible)
Loony Mukta, Mhwaka Battle Badger is standing here. (flying)
(invisible)
Lachplesis, the Bear Eared Goblin is standing here. (flying)
(invisible)
. . . has a tough exterior.
Melee Pelle, Wild's Water Breathing Nymph is standing here. (flying)
(invisible)
. . . is enveloped in flames.
Hocus Pocus, Alakazam is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Krieger, Wonderboy High up in the Castle made of Clouds is standing
here. (flying) (invisible)
Ansolism, The Wild Answer is sitting here, fighting Anathea. (flying)
(invisible)
629H 83V 9026242X 0C Exits:NES> You try to bash Ansolism, but you miss
and tumble forward onto your face.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:V.Good]
Exits:NES> bas ansolism
Thod slowly fades into existence.
Thod crashes into Loony in a thundering collision, knocking him to the
ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:V.Good]
Exits:NES>
Krieger slowly fades into existence.
Krieger crashes into Mytto in a thundering collision, knocking her to
the ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:V.Good]
Exits:NES>
Dain utters some strange words.
Dain slowly fades into existence.
Santino is shredded by shards of ice.
Arvar is shredded by shards of ice.
Demaleon is shredded by shards of ice.
Loony is shredded by shards of ice.
Lachplesis is shredded by shards of ice.
Dain destroys Melee's mirror images.
Melee is shredded by shards of ice.
Hocus is shredded by shards of ice.
Krieger is shredded by shards of ice.
Ansolism is shredded by shards of ice.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:Good]
Exits:NES>
Demaleon crashes into Lara in a thundering collision, knocking her to
the ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:Good]
Exits:NES>
Arvar crashes into Dain in a thundering collision, knocking him to the
ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:V.Good] [Ansolism:Good]
Exits:NES>
Lara pierces Demaleon very hard.
Hocus slowly fades into existence.
Hocus misses Dain with his whip.
Melee misses Dain with his pierce.
Lachplesis slowly fades into existence.
Lachplesis massacres Dain with his shoot.
Lachplesis massacres Dain with his shoot.
Demaleon massacres Dain with his crush.
Demaleon is chilled, as he swings at Dain.
Arvar bludgeons Dain extremely hard.
Arvar is chilled, as he swings at Dain.
Dain bludgeons Santino very hard.
Santino slowly fades into existence.
Santino massacres Dain with his stab.
Santino is chilled, as he swings at Dain.
Krieger smites Mytto very hard.
Mytto slowly fades into existence.
Mytto smites Krieger very hard.
Thod obliterates Loony with his cleave.
Thod obliterates Loony with his cleave.
Loony slowly fades into existence.
Loony misses Thod with his bludgeon.
You massacre Ansolism with your slash.
Anathea slashes Ansolism hard.
Ansolism slowly fades into existence.
Ansolism massacres Anathea with his slash.
Ansolism massacres Anathea with his slash.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Good]
Exits:NES>
Moona utters some strange words.
Moona conjures a writhing mass of inky black tentacles!
Santino screams in pain as inky black tentacles constrict him.
Arvar screams in pain as inky black tentacles constrict him.
Demaleon screams in pain as inky black tentacles constrict him.
Loony screams in pain as inky black tentacles constrict him.
Lachplesis screams in pain as inky black tentacles constrict him.
Melee screams in pain as inky black tentacles constrict him.
Hocus screams in pain as inky black tentacles constrict him.
Krieger screams in pain as inky black tentacles constrict him.
Ansolism screams in pain as inky black tentacles constrict him.
Woa crashes into Santino in a thundering collision, knocking him to the
ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Good]
Exits:NES>
Jierk shouts '530hp warrior seeking group lvl 23'
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Good]
Exits:NES> bas ansolism
Woa annihilates Santino with his crush.
Moona misses Santino with her pierce.
Moona misses Santino with her pierce.
Lara misses Demaleon with her pierce.
Hocus whips Dain very hard.
Hocus is chilled, as he swings at Dain.
Melee misses Dain with his pierce.
Lachplesis massacres Dain with his shoot.
Lachplesis massacres Dain with his shoot.
Demaleon massacres Dain with his crush.
Demaleon is chilled, as he swings at Dain.
Arvar massacres Dain with his bludgeon.
Arvar is chilled, as he swings at Dain.
Dain bludgeons Santino extremely hard.
Santino massacres Dain with his stab.
Santino is chilled, as he swings at Dain.
Krieger misses Mytto with his smite.
Mytto smites Krieger very hard.
Thod annihilates Loony with his cleave.
Loony misses Thod with his bludgeon.
You massacre Ansolism with your slash.
Anathea slashes Ansolism hard.
Ansolism massacres Anathea with his slash.
Ansolism massacres Anathea with his slash.
Ansolism stands up.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Ansolism gets a scroll from his chest.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Lachplesis snickers softly.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Anathea crashes into Ansolism in a thundering collision, knocking him
to the ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Aten now follows Ansolism.
Ansolism is the new leader of Aten's group.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> You can't do that while sitting.
stand
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> You can't do that while sitting.
Loony stands up.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> Thod tells your group 'haste me'
You can't do that while sitting.
Loony utters some strange words.
Loony disappears.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> You can't do that while sitting.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> bas ansolismThod slowly fades into existence.
Thod crashes into Ansolism in a thundering collision, knocking him to
the ground!
You stand up.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Lara stands up.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Krieger sinks gently to the ground.
Krieger stops using an onyx sceptre with a pearl handle.
Krieger grabs a glowing scroll of recall.
Krieger recites a glowing scroll of recall.
Krieger disappears.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES> stYou crash into Ansolism in a bone crunching bash, sending
him sprawling to the ground.
Lara panics, and attempts to flee.
Lara flies south.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Good] [Ansolism:Fair]
Exits:NES>
Thod obliterates Ansolism with his cleave.
Woa annihilates Santino with his crush.
Moona misses Santino with her pierce.
Hocus misses Dain with his whip.
bas ansolismMelee misses Dain with his pierce.
Lachplesis misses Dain with his shoot.
Lachplesis massacres Dain with his shoot.
Demaleon massacres Dain with his crush.
Demaleon is chilled, as he swings at Dain.
Dain is dead! R.I.P.
exa corpseYou massacre Ansolism with your slash.
Anathea slashes Ansolism very hard.
Ansolism massacres Anathea with his slash.
Ansolism massacres Anathea with his slash.
The death cry of Dain echoes from somewhere nearby...
Lara stops following Dain.
Anathea stops following Dain.
Moona stops following Dain.
Thod stops following Dain.
Mytto stops following Dain.
You stop following Dain.
You now follow Lara.
Woa stops following Dain.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Melee gets a large pile of coins from the corpse of Dain.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Lachplesis is zapped by a demonic bone staff and instantly drops it.
Lachplesis gets a belt of seashells from the corpse of Dain.
Lachplesis gets a ghostly shroud from the corpse of Dain.
Lachplesis gets a fiery pair of gloves from the corpse of Dain.
Lachplesis gets a pair of rotting boots from the corpse of Dain.
Lachplesis is zapped by a leather skullcap and instantly drops it.
Lachplesis gets a set of flowing satin robes from the corpse of Dain.
Lachplesis gets a beaded leather necklace from the corpse of Dain.
Lachplesis gets a triple crescent moon talisman from the corpse of
Dain.
Lachplesis gets a foul smelling ring from the corpse of Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a milky potion of see invisible from the corpse of
Dain.
Lachplesis gets a tiny acorn from the corpse of Dain.
Lachplesis gets a glowing scroll of recall from the corpse of Dain.
Lachplesis gets a glowing scroll of recall from the corpse of Dain.
Lachplesis gets a glowing scroll of recall from the corpse of Dain.
Lachplesis gets a brewed potion from the corpse of Dain.
Lachplesis gets a small canteen from the corpse of Dain.
Lachplesis gets an entire loaf of bread from the corpse of Dain.
Lachplesis gets a necklace of snake rattles from the corpse of Dain.
Lachplesis gets a glowing scroll of recall from the corpse of Dain.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Hocus utters some strange words.
Hocus disappears in a puff of smoke.
Santino gets a scroll from his bag.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Woa crashes into Santino in a thundering collision, knocking him to the
ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES> bas ansolism
Melee grabs a glowing scroll of recall.
Melee recites a glowing scroll of recall.
Melee disappears.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Lachplesis misses Woa with his shoot.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Lara flies in from the south.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES> get all 1.corpse
Lara focuses on Thod and utters some strange words.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Demaleon tries to bash Lara, but he passes right through her image and
falls.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:Bad]
Exits:NES>
Demaleon misses Lara and destroys an image instead.
Lara misses Demaleon with her pierce.
Lachplesis misses Woa with his shoot.
Santino massacres Woa with his stab.
Thod annihilates Ansolism with his cleave.
Woa annihilates Santino with his crush.
Moona misses Santino with her pierce.
Moona misses Santino with her pierce.
Moona appears to be in two places at once, after they strike with their
dagger.
Moona is surrounded by 2 duplicate images.
You massacre Ansolism with your slash.
Anathea slashes Ansolism hard.
Ansolism massacres Anathea with his slash.
Ansolism massacres Anathea with his slash.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Arvar gets a scroll from his sack.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Mytto stands up.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Arvar stops using a black stone.
Arvar grabs a glowing scroll of recall.
Arvar recites a glowing scroll of recall.
Arvar disappears.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Moona focuses harshly on Santino and utters some strange words.
The sound of bones cracking echoes as Moona's force bolt slams into
Santino.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Ansolism steps aside as Anathea attempts a bash, stumbles, and falls
flat on her face.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES> bas ansolism
Mytto focuses on Lara and utters some strange words.
Mytto heals Lara.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Aten flies in from the north.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Thod crashes into Ansolism in a thundering collision, knocking him to
the ground!
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES>
Lachplesis panics, and attempts to flee.
Lachplesis flies south.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Fair] [Ansolism:V.Bad]
Exits:NES> Demaleon misses Lara and destroys an image instead.
Santino massacres Woa with his stab.
Thod obliterates Ansolism with his cleave.
Thod obliterates Ansolism with his cleave.
Woa annihilates Santino with his crush.
You massacre Ansolism with your slash.
Anathea slashes Ansolism hard.
Ansolism annihilates Anathea with his slash.
Ansolism annihilates Anathea with his slash.
You are already standing.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES>
Aten slowly fades into existence.
Aten slashes Lara extremely hard.
Aten is burned, as he swings at Lara.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES> You try to bash Ansolism, but you miss and tumble forward
onto your face.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES>
Moona focuses harshly on Santino and utters some strange words.
The sound of bones cracking echoes as Moona's force bolt slams into
Santino.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES>
Santino grabs a glowing scroll of recall.
Santino recites a glowing scroll of recall.
Santino disappears.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES> st
Woa quaffs a brewed potion.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES>
Mytto stops following Lara.
Mytto now follows Thod.
629H 83V 9026242X 0C [Me:V.Good] [Anathea:Bad] [Ansolism:Awful]
Exits:NES>
Lara utters some strange words.
Lara's hands issue a spray of prismatic color!
Aten is struck by a spray of vibrant green!
Aten is caught in a spray of shimmering red!
Woa is hit by a spray of gleaming indigo!
You are struck by a spray of vibrant green!
You are struck by a spray of murky violet!
Mytto is blasted by a spray of scintillating blue!
Thod is struck by a spray of vibrant green!
Lara misses Moona and destroys an image instead.
Anathea is caught in a spray of shimmering red!
Demaleon is hit by a spray of gleaming indigo!
A spray of indigo flows over Ansolism, ripping out his mind.
You receive 0 experience.
Ansolism is dead! R.I.P.
exa corpse
546H 83V 9026242X 0C [Me:Good] [Ansolism:Dying] Exits:NES> get all
1.corpseget all 1.corpse
The death cry of Ansolism echoes from somewhere nearby...
Ansolism sinks gently to the ground.
Aten stops following Ansolism.
Ansolism now follows Aten.
Aten is the new leader of Ansolism's group.
Ansolism stops following Aten.
Krieger stops following Ansolism.
Krieger now follows Aten.
Hocus stops following Ansolism.
Hocus now follows Aten.
Lachplesis stops following Ansolism.
Lachplesis now follows Aten.
Loony stops following Ansolism.
Loony now follows Aten.
Demaleon stops following Ansolism.
Demaleon now follows Aten.
Arvar stops following Ansolism.
Arvar now follows Aten.
Santino stops following Ansolism.
Santino now follows Aten.
546H 83V 9026242X 0C Exits:NES> get all 1.corpse
Moona misses Lara with her pierce.
Moona appears to be in two places at once, after they strike with their
dagger.
Moona is surrounded by 2 duplicate images.
Mytto slowly fades into existence.
Mytto smites Lara extremely hard.
Mytto is burned, as she swings at Lara.
Woa massacres Lara with his crush.
Woa is burned, as he swings at Lara.
Aten misses Lara with his slash.
Aten misses Lara and destroys an image instead.
Demaleon crushes Lara extremely hard.
Demaleon is burned, as he swings at Lara.
546H 83V 9026242X 0C Exits:NES>
Demaleon gets a very large pile of coins from the corpse of Ansolism.
546H 83V 9026242X 0C Exits:NES>
Lachplesis flies in from the south.
546H 83V 9026242X 0C Exits:NES>
Demaleon stands up.
546H 83V 9026242X 0C Exits:NES>
Mytto focuses on Thod and utters some strange words.
Mytto heals Thod.
546H 83V 9026242X 0C Exits:NES>
Aten gazes at Lara with a look of evilness.
546H 83V 9026242X 0C Exits:NES>
Moona gets a red hilted longsword from the corpse of Ansolism.
Moona gets Arctic Night from the corpse of Ansolism.
Moona gets a mithril bracelet from the corpse of Ansolism.
Moona gets a mithril bracelet from the corpse of Ansolism.
Moona gets a leather scabbard from the corpse of Ansolism.
Moona gets a white dragonwing cloak from the corpse of Ansolism.
Moona gets some brassards of silver dragonscale from the corpse of
Ansolism.
Moona gets a pair of dragonrider's gloves from the corpse of Ansolism.
Moona gets a majestic pair of riding boots from the corpse of Ansolism.
Moona gets a pair of unfinished mithril legplates from the corpse of
Ansolism.
Moona gets the diamond encrusted skull of Glymmer from the corpse of
Ansolism.
Moona gets an ancient suit of mithril chainmail from the corpse of
Ansolism.
Moona gets a gold trimmed burgundy cape from the corpse of Ansolism.
Moona gets a dark tourmaline pendant from the corpse of Ansolism.
Moona gets a frosted tin ring from the corpse of Ansolism.
Moona gets an ashen stone ring from the corpse of Ansolism.
Moona gets a glowing scroll of recall from the corpse of Ansolism.
Moona gets a magnetized needle from the corpse of Ansolism.
Moona gets some cat whiskers from the corpse of Ansolism.
Moona gets a deformed crow's leg from the corpse of Ansolism.
546H 83V 9026242X 0C Exits:NES>
Anathea stands up.
546H 83V 9026242X 0C Exits:NES>
Anathea gets a deformed crow's leg from the corpse of Ansolism.
Anathea gets a thimble of human blood from the corpse of Ansolism.
Anathea gets some rose petals from the corpse of Ansolism.
Anathea gets the key to darkness from the corpse of Ansolism.
Anathea gets a vial of vinegar from the corpse of Ansolism.
Anathea gets a wooden shield of dragons from the corpse of Ansolism.
Anathea gets a corked flask of swamp gas from the corpse of Ansolism.
Anathea gets a handful of ogre teeth from the corpse of Ansolism.
Anathea gets a smear of green mud from the corpse of Ansolism.
Anathea gets a colorful mushroom from the corpse of Ansolism.
Anathea gets a small training dagger from the corpse of Ansolism.
Anathea gets a spinning dagger from the corpse of Ansolism.
Anathea gets a small training dagger from the corpse of Ansolism.
Anathea gets an intricately carved horn from the corpse of Ansolism.
Anathea gets a red potion from the corpse of Ansolism.
Anathea gets a small bag of silver dust from the corpse of Ansolism.
Anathea gets a blue scroll from the corpse of Ansolism.
Anathea gets a vial of sparkling pink liquid from the corpse of
Ansolism.
Anathea gets a glowing scroll of recall from the corpse of Ansolism.
Anathea gets a strange dagger from the corpse of Ansolism.
Anathea gets a small pinch of human gray matter from the corpse of
Ansolism.
Anathea gets some volcanic ash from the corpse of Ansolism.
Anathea gets a hand-held sundial from the corpse of Ansolism.
Anathea gets a small wooden chest from the corpse of Ansolism.
Anathea gets a glowing scroll of recall from the corpse of Ansolism.
Anathea gets a whip with nine heads from the corpse of Ansolism.
Anathea gets a footmans pike from the corpse of Ansolism.
Anathea gets a gnome skull from the corpse of Ansolism.
546H 83V 9026242X 0C Exits:NES>
Loony stops following Aten.
546H 83V 9026242X 0C Exits:NES> get all 1.corpse
Moona focuses harshly on Demaleon and utters some strange words.
The sound of bones cracking echoes as Moona's force bolt slams into
Demaleon.
546H 83V 9026242X 0C Exits:NES>
Lachplesis flies south.
546H 83V 9026242X 0C Exits:NES>
Woa panics, and attempts to flee.
Woa flies east.
546H 83V 9026242X 0C Exits:NES>
Thod slowly fades into existence.
Thod crashes into Aten in a thundering collision, knocking him to the
ground!
546H 83V 9026242X 0C Exits:NES>
Thod obliterates Aten with his cleave.
Thod obliterates Aten with his cleave.
Aten slashes Lara very hard.
Aten is burned, as he swings at Lara.
Aten misses Lara with his smite.
Demaleon crushes Lara extremely hard.
Demaleon is burned, as he swings at Lara.
Lara misses Demaleon with her pierce.
564H 111V 9026242X 0C Exits:NES>
Lara focuses harshly on Demaleon and utters some strange words.
564H 111V 9026242X 0C Exits:NES> It's a pretty ghastly sight! Searching
through the remains, you find:
corpse (here) :
564H 111V 9026242X 0C Exits:NES> The corpse doesn't seem to have what
you are looking for.
564H 111V 9026242X 0C Exits:NES> bas atenYou can't do that while
sitting.
564H 111V 9026242X 0C Exits:NES> You stand up.
564H 111V 9026242X 0C Exits:NES>
Anathea crashes into Aten in a thundering collision, knocking him to
the ground!
564H 111V 9026242X 0C Exits:NES> It's a pretty ghastly sight! Searching
through the remains, you find:
corpse (here) :
564H 111V 9026242X 0C Exits:NES> Moona focuses harshly on Demaleon and
utters some strange words.
The sound of bones cracking echoes as Moona's force bolt slams into
Demaleon.
The corpse doesn't seem to have what you are looking for.
564H 111V 9026242X 0C Exits:NES>
Woa flies in from the east.
564H 111V 9026242X 0C Exits:NES>
Mytto focuses on Lara and utters some strange words.
Mytto heals Lara.
564H 111V 9026242X 0C Exits:NES>
Aten steps aside as Woa attempts a bash, stumbles, and falls flat on
his face.
564H 111V 9026242X 0C Exits:NES>
Demaleon crashes into Anathea in a thundering collision, knocking her
to the ground!
564H 111V 9026242X 0C Exits:NES> The corpse doesn't seem to have what
you are looking for.
564H 111V 9026242X 0C Exits:NES> Woa annihilates Aten with his crush.
Woa annihilates Aten with his crush.
Anathea slashes Aten hard.
Thod annihilates Aten with his cleave.
You receive 0 experience.
Aten is dead! R.I.P.
exa corpseDemaleon massacres Lara with his crush.
The death cry of Aten echoes from somewhere nearby...
Santino stops following Aten.
Arvar stops following Aten.
Demaleon stops following Aten.
Lachplesis stops following Aten.
Hocus stops following Aten.
Krieger stops following Aten.
You get a small iron flail from the corpse of Aten.
You are zapped by a slender draconian blade and instantly drop it.
You get a red steel bracer from the corpse of Aten.
You get a gleaming gladiatorial bracer from the corpse of Aten.
You get a leather belt pouch from the corpse of Aten.
You get a pair of dwarven arm plates from the corpse of Aten.
You get a pair of demon claw gloves from the corpse of Aten.
You get a pair of elven chain leggings from the corpse of Aten.
You are zapped by a black battle armour with red trim and instantly
drop it.
You get a draconian war collar from the corpse of Aten.
You get a cloak made of old, black cloth from the corpse of Aten.
You get a woodsman's ring from the corpse of Aten.
You get a very large pile of coins from the corpse of Aten.
There were 2739 coins.
You get a glowing scroll of recall from the corpse of Aten.
You get a green hilted machete from the corpse of Aten.
You get a glowing scroll of recall from the corpse of Aten.
You get a glowing scroll of recall from the corpse of Aten.
You get a piece of sweet bread from the corpse of Aten.
You get a waterskin from the corpse of Aten.
You get a waterskin from the corpse of Aten.
You get a waterskin from the corpse of Aten.
You get a waterskin from the corpse of Aten.
You get a waterskin from the corpse of Aten.
You get a milky potion of see invisible from the corpse of Aten.
564H 111V 9026242X 2739C Exits:NES> You are already standing.
564H 111V 9026242X 2739C Exits:NES> You couldn't find what you were
looking for.
564H 111V 9026242X 2739C Exits:NES> It's a pretty ghastly sight!
Searching through the remains, you find:
corpse (here) :
564H 111V 9026242X 2739C Exits:NES> stYou are already standing.
564H 111V 9026242X 2739C Exits:NES>
Woa stands up.
564H 111V 9026242X 2739C Exits:NES> l
Mytto utters some strange words.
Mytto heals Mytto.
564H 111V 9026242X 2739C Exits:NES>
Lara utters some strange words.
Lara's hands issue a spray of prismatic color!
Woa is hit by a spray of gleaming indigo!
You are hit by a spray of gleaming indigo!
Mytto is caught in a spray of bright orange!
Thod is hit by a spray of gleaming indigo!
Lara misses Moona and destroys an image instead.
Anathea is hit by a spray of gleaming indigo!
Demaleon is struck by a spray of vibrant green!
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:V.Good]
Exits:NES> Market Street
A heavy black armour with red trim lies on the ground here.
A mean looking blade has been left here.
The corpse of Aten is lying here.
The corpse of Ansolism is lying here.
A cap made of leather and embroidered in fine silk lies unattended
here.
An evil looking staff lies here. (invisible)..it glows dimly
The corpse of Dain is lying here.
Woa Nitro, Leading the Blood Sea Boarding Team is standing here,
fighting Lara. (flying)
Lara Ellypse, Prime Magi of the Fallen Glory is standing here, fighting
Demaleon. (flying)
Mytto, Eradication Instincts Defined is standing here, fighting Lara.
(flying)
. . . has a metallic luster.
Thod of Chaos is standing here, fighting Lara. (flying)
Moona the Female Human is standing here, fighting Lara. (flying)
. . . appears duplicated.
Anathea, A Legend Reborn is sitting here, fighting Lara. (flying)
Demaleon the Harbinger of Doom is standing here, fighting Lara.
(flying)
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:V.Good]
Exits:NES>
Anathea slashes Lara hard.
Thod obliterates Lara with his cleave.
Thod obliterates Lara with his cleave.
You massacre Lara with your slash.
Woa massacres Lara with his crush.
Woa massacres Lara with his crush.
Moona misses Lara with her pierce.
Moona misses Lara with her pierce.
Demaleon crushes Lara extremely hard.
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:V.Bad]
Exits:NES>
Woa panics, and attempts to flee.
Woa flies north.
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:V.Bad]
Exits:NES> bas
Thod crashes into Lara in a thundering collision, knocking her to the
ground!
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:Awful]
Exits:NES> You try to bash Lara, but you miss and tumble forward onto
your face.
stand
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:Awful]
Exits:NES> fleestandfleeflee
Moona focuses harshly on Demaleon and utters some strange words.
The sound of bones cracking echoes as Moona's force bolt slams into
Demaleon.
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:Awful]
Exits:NES>
Mytto focuses on Lara and utters some strange words.
Mytto heals Lara.
519H 111V 9026242X 2739C [Me:Good] [Demaleon:V.Bad] [Lara:V.Good]
Exits:NES>
Anathea misses Lara with her slash.
Thod annihilates Lara with his cleave.
You massacre Lara with your slash.
Demaleon massacres Lara with his crush.
Lara pierces Demaleon very hard.
Demaleon gets a scroll from his chest.
519H 111V 9026242X 2739C [Me:Good] [Demaleon:Awful] [Lara:Fair]
Exits:NES>
Demaleon grabs a glowing scroll of recall.
Demaleon recites a glowing scroll of recall.
Demaleon disappears.
519H 111V 9026242X 2739C [Me:Good] [Anathea:V.Bad] [Lara:Fair]
Exits:NES>
Moona grabs a rolled white parchment.
Moona recites a rolled white parchment.
Moona heals Moona.
Anathea stands up.
519H 111V 9026242X 2739C [Me:Good] [Anathea:V.Bad] [Lara:Fair]
Exits:NES>
Lara pierces Anathea extremely hard.
Anathea slashes Lara hard.
Thod annihilates Lara with his cleave.
You annihilate Lara with your slash.
Moona misses Lara with her pierce.
Mytto smites Lara extremely hard.
Mytto focuses on Anathea and utters some strange words.
Mytto heals Anathea.
519H 111V 9026242X 2739C [Me:Good] [Anathea:V.Good] [Lara:Bad]
Exits:NES>
Anathea panics, and attempts to flee.
Anathea flies north.
519H 111V 9026242X 2739C [Me:Good] [Moona:Perfect] [Lara:Bad]
Exits:NES> Thod says 'doh'
You stand up.
519H 111V 9026242X 2739C [Me:Good] [Moona:Perfect] [Lara:Bad]
Exits:NES> Thod panics, and attempts to flee.
Thod flies south.
You flee head over heels.
Market Square
Anathea, A Legend Reborn is standing here. (flying)
Woa Nitro, Leading the Blood Sea Boarding Team is standing here.
(flying)
519H 110V 9026242X 2739C Exits:NESW>
Woa flies north.
519H 110V 9026242X 2739C Exits:NESW> You are already standing.
519H 110V 9026242X 2739C Exits:NESW> You're not fighting, why bother
fleeing?
519H 110V 9026242X 2739C Exits:NESW> You're not fighting, why bother
fleeing?
519H 110V 9026242X 2739C Exits:NESW>
Woa flies in from the north.
519H 110V 9026242X 2739C Exits:NESW>
519H 110V 9026242X 2739C Exits:NESW> scanexit
Anathea flies south.
519H 110V 9026242X 2739C Exits:NESW>
519H 110V 9026242X 2739C Exits:NESW> Looking north:
You see nothing special.
The old dwarf Fiagan raises an eyebrow as you browse his barrow.
. . . is overwhelmed by inky black tentacles.
Looking east:
You see nothing special.
Irick the cloth trader beckons you to sample his merchandise.
Looking south:
You see nothing special.
Anathea, A Legend Reborn is standing here. (flying)
Lara Ellypse, Prime Magi of the Fallen Glory is standing here, fighting
Mytto. (flying)
Mytto, Eradication Instincts Defined is standing here, fighting Lara.
(flying)
. . . has a metallic luster.
Looking west:
You see nothing special.
Degyan is here, cleaning a broadsword that is for sale.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
519H 110V 9026242X 2739C Exits:NESW> Obvious exits:
North - The Variety Stall
East - Irick's Fine Cloth Stall
South - Market Street
West - Degyan's Weapon Rack
519H 110V 9026242X 2739C Exits:NESW> sMarket Street
A heavy black armour with red trim lies on the ground here.
A mean looking blade has been left here.
The corpse of Aten is lying here.
The corpse of Ansolism is lying here.
A cap made of leather and embroidered in fine silk lies unattended
here.
An evil looking staff lies here. (invisible)..it glows dimly
The corpse of Dain is lying here.
Thod of Chaos is standing here. (flying) (invisible)
Anathea, A Legend Reborn is standing here. (flying)
Mytto, Eradication Instincts Defined is standing here. (flying)
. . . has a metallic luster.
519H 109V 9026242X 2739C Exits:NES>
Moona flies in from the east.
519H 109V 9026242X 2739C Exits:NES>
Mytto stops following Thod.
Mytto now follows Moona.
519H 109V 9026242X 2739C Exits:NES> gt lootYou are not a member of a
group.
519H 109V 9026242X 2739C Exits:NES>
Woa flies in from the north.
Woa kneels down and studies the ground.
519H 109V 9026242X 2739C Exits:NES> drop all.rationYou drop an iron
ration.
You drop an iron ration.
519H 109V 9026242X 2739C Exits:NES> lMarket Street
An iron ration has been discarded here. [2]
A heavy black armour with red trim lies on the ground here.
A mean looking blade has been left here.
The corpse of Aten is lying here.
The corpse of Ansolism is lying here.
A cap made of leather and embroidered in fine silk lies unattended
here.
An evil looking staff lies here. (invisible)..it glows dimly
The corpse of Dain is lying here.
Woa Nitro, Leading the Blood Sea Boarding Team is standing here.
(flying)
Lara Ellypse, Prime Magi of the Fallen Glory is standing here. (flying)
Moona the Female Human is standing here. (flying)
. . . is enveloped in flames.
Thod of Chaos is standing here. (flying) (invisible)
Anathea, A Legend Reborn is standing here. (flying)
Mytto, Eradication Instincts Defined is standing here. (flying)
(invisible)
. . . has a metallic luster.
519H 109V 9026242X 2739C Exits:NES>
Woa stops following Lara.
Woa now follows Moona.
519H 109V 9026242X 2739C Exits:NES>
Anathea stops following Lara.
Anathea now follows Thod.
519H 109V 9026242X 2739C Exits:NES> fol moonaYou stop following Lara.
You now follow Moona.
519H 109V 9026242X 2739C Exits:NES>
Woa says 'fucking form'
519H 109V 9026242X 2739C Exits:NES>
Anathea stops following Thod.
Anathea now follows Moona.
519H 109V 9026242X 2739C Exits:NES>
Mytto gets an iron ration.
Mytto gets an iron ration.
Mytto gets a black battle armour with red trim.
Mytto gets a slender draconian blade.
Mytto gets the corpse of Aten.
Mytto gets the corpse of Ansolism.
Mytto gets a leather skullcap.
Mytto gets a demonic bone staff.
519H 109V 9026242X 2739C Exits:NES>
You are now a member of Moona's group.
519H 109V 9026242X 2739C Exits:NES>
Anathea gets the corpse of Dain.
519H 109V 9026242X 2739C Exits:NES>
Mytto drops an iron ration.
Mytto drops an iron ration.
519H 109V 9026242X 2739C Exits:NES>
Woa grabs a crimson dust covered chest.
519H 109V 9026242X 2739C Exits:NES>
Thod stops following Lara.
Thod now follows Moona.
519H 109V 9026242X 2739C Exits:NES> drop all.breadYou drop a piece of
sweet bread.
519H 109V 9026242X 2739C Exits:NES>
Moona beckons for everyone to follow her.

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
