<VeWtiFuL> yea but now i started a garden center out of my driveway

Login
Username: __________
Password: __________
Login
[1]Forgot your password?
[2]Register for a Login
Mud Logs
[3]Recent Logs
[4]Older Logs
[5]Newer Logs
[6]Top Rated Logs
[7]Most Viewed Logs
[8]Upload A Log
[9]Log Collections
[10]Log Quicklist
Mud Links
[11]Arcticmud Blog!
[12]Xanitha's Mud Log Page
[13]RGB Mud Log Page
[14]Lasse's Logs (not current)
[15]Oligo's Logs (not current)
[16]Arctic Mud Forums
[17]Arctic Mud Homepage
[18]Vote for Arctic
on Top Mud Sites

What is the worst change this wipe?

(*) hp gain randomness
( ) +heal items
( ) every high level zone bugged
( ) road shortening
( ) rolling system
( ) nosummon items
( ) all of the above
Vote Results

[19]Submit a Poll
[20]List Previous Polls

Revenge

POV: Ollip

Log Rating: 1.5185

After getting beat down in palanthas because people in group wanted to
rush things, I reformed a more orginized group and lead them to a beat
down.

inding Path
This small cobbled path winds its way into the dark forest. You have
heard story from the people of Solace not to enter the Darken Wood that
exists outside of town. But the woods seem quite harmless right now.
Naustramus the Male Theiwar Dwarf is standing here. (flying)
. . . is followed by a hovering ball of light.
Hymak the Male Gnome is standing here. (flying) (invisible)
. . . is followed by a hovering ball of light.
Sa 'Sa, Pretty Pretty Princess is standing here. (flying)
Xy Zee, RoT Inc is standing here. (flying)
Aemen the Female Hylar Dwarf is standing here. (flying)
Iopi Ka'Bash is standing here. (flying)
Cano is standing here. (flying)
Monalis A. Conscientious Flower Girl of RoT is standing here. (flying)
(red
aura)
Scelesta is standing here. (flying) (invisible) (red aura)
. . . is followed by a hovering ball of light.
Virtue Of Takhisis, Pure Evil is standing here. (flying) (invisible)
Vein the Male Human is standing here. (flying) (invisible) (red aura)
Jenie Einej, Genie of Doom is standing here. (flying) (invisible) (red
aura)
Fraen de Mynd is standing here. (flying) (invisible)
Manny, Sassy Mcfat Fat is standing here. (flying) (invisible)
Luze is standing here. (flying) (invisible) (red aura)
560H 116V 10281932X 8C Mem:2 Exits:EW>
Luze slowly fades into existence.
Luze crashes into Sa in a thundering collision, knocking her to the
ground!
560H 116V 10281932X 8C Mem:2 Exits:EW> q
Iopi crashes into Virtue in a thundering collision, knocking her to the
ground!
560H 116V 10281932X 8C Mem:2 Exits:EW> You attempt to strike at Virtue
with your sword.
You bruise Virtue with your slash.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:Perfect] [Virtue:V.Good]
Mem:2 Exits:EW>
Vein slowly fades into existence.
Sa steps aside as Vein attempts a bash, stumbles, and falls flat on his
face.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:Perfect] [Virtue:V.Good]
Mem:2 Exits:EW>
Vein crushes Sa extremely hard.
You slash Virtue hard.
Iopi slashes Virtue.
Virtue slowly fades into existence.
Virtue crushes Iopi extremely hard.
Luze massacres Sa with his slash.
Sa barely hits Luze.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW>
Fraen slowly fades into existence.
Fraen crashes into Xy in a thundering collision, knocking him to the
ground!
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW>
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW>
Monalis utters some strange words.
A yellowish-green cloud permeates the air.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW> ave
Scelesta focuses harshly on Sa and utters some strange words.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW> ave le
Naustramus focuses on Aemen and utters some strange words.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW> ave legs
Jenie focuses harshly on Sa and utters some strange words.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW> You focus your
purity on Virtue's leg!
You focus on Virtue's legs, but are thwarted.
560H 116V 10281932X 8C [Me:Perfect] [Iopi:V.Good] [Virtue:V.Good] Mem:2
Exits:EW>
Monalis destroys Scelesta's mirror images.
You step in front of Monalis and direct your attacks at Jenie.
What a self-sacrificing act! You're such a hero!
Jenie slowly fades into existence.
Jenie misses you with his bludgeon.
You slash Jenie very hard.
Monalis misses Scelesta with her pierce.
Scelesta claws Monalis hard.
Cano crushes Manny very hard.
Manny slowly fades into existence.
Manny cleaves Cano extremely hard.
Fraen misses Xy with his slash.
Xy bludgeons Fraen extremely hard.
Vein massacres Sa with his crush.
Iopi massacres Virtue with his slash.
Virtue crushes Iopi extremely hard.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
560H 116V 10281932X 8C [Me:Perfect] [Jenie:V.Good] Mem:2 Exits:EW>
Charo flies in from the west.
560H 116V 10281932X 8C [Me:Perfect] [Jenie:V.Good] Mem:2 Exits:EW>
Aemen crashes into Jenie in a thundering collision, knocking him to the
ground!
560H 116V 10281932X 8C [Me:Perfect] [Jenie:Good] Mem:2 Exits:EW> r
Charo utters some strange words.
A sudden wind rushes by you.
560H 116V 10281932X 8C [Me:Perfect] [Jenie:Good] Mem:2 Exits:EW> rally
Scelesta utters some strange words.
Scelesta's hands issue a spray of color!
Naustramus is caught in a spray of radiant yellow!
Naustramus is caught in a spray of radiant yellow!
Hymak is caught in a spray of radiant yellow!
Hymak is caught in a spray of radiant yellow!
Hymak seems weaker.
Sa is caught in a spray of shimmering red!
Xy is caught in a spray of radiant yellow!
Xy seems weaker.
Xy is caught in a spray of radiant yellow!
Aemen is caught in a spray of shimmering red!
Iopi is caught in a spray of shimmering red!
Cano is caught in a spray of radiant yellow!
Monalis is caught in a spray of shimmering red!
You are caught in a spray of shimmering red!
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Good] Mem:2 Exits:EW> rally
Naustramus focuses harshly on Scelesta and utters some strange words.
Scelesta wavers under the impact of the lightning bolt sent by
Naustramus.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Good] Mem:2 Exits:EW> st
ral
Sa stands up.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Good] Mem:2 Exits:EW> rally
Monalis utters some strange words.
Charo is shredded by shards of ice.
Scelesta is shredded by shards of ice.
Virtue is shredded by shards of ice.
Vein is shredded by shards of ice.
Jenie is shredded by shards of ice.
Fraen is shredded by shards of ice.
Manny is shredded by shards of ice.
Luze is shredded by shards of ice.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Fair] Mem:2 Exits:EW> rally
Iopi crashes into Virtue in a thundering collision, knocking her to the
ground!
Luze crashes into Sa in a thundering collision, knocking her to the
ground!
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Fair] Mem:2 Exits:EW>
Hymak focuses harshly on Scelesta and utters some strange words.
Scelesta wavers under the impact of the lightning bolt sent by Hymak.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Fair] Mem:2 Exits:EW>
The surrounding fumes have been thinned by the wind.
Charo slowly fades into existence.
Charo barely hits Monalis.
Aemen slashes Jenie extremely hard.
Aemen massacres Jenie with her slash.
Jenie misses you with his bludgeon.
You slash Jenie very hard.
Cano crushes Manny extremely hard.
Manny cleaves Cano extremely hard.
Fraen massacres Xy with his slash.
Xy misses Fraen with his bludgeon.
Vein massacres Sa with his crush.
Iopi slashes Virtue extremely hard.
Virtue crushes Iopi very hard.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
Vein stands up.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW>
Sa steps aside as Fraen attempts a bash, stumbles, and falls flat on
his face.
Xy stands up.
Vein crashes into Xy in a thundering collision, knocking him to the
ground!
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW>
Manny stands up.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW>
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW>
Scelesta desparately quaffs a flask of clear liquid.
Large gashes and wounds disappear on Scelesta's body.
Scelesta looks better.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW> You yell
and inspire your
companions to fight harder!
Naustramus focuses harshly on Scelesta and utters some strange words.
Scelesta wavers under the impact of the lightning bolt sent by
Naustramus.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW>
Scelesta panics, and attempts to flee.
Scelesta flies west.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:Bad] Mem:2 Exits:EW> ave leg
Monalis utters some strange words.
Charo is shredded by shards of ice.
Virtue is shredded by shards of ice.
Vein is shredded by shards of ice.
Jenie is shredded by shards of ice.
Fraen is shredded by shards of ice.
Manny is shredded by shards of ice.
Luze is shredded by shards of ice.
540H 116V 10281932X 8C [Me:V.Good] [Jenie:V.Bad] Mem:2 Exits:EW> ave
legs
You step in front of Monalis and direct your attacks at Charo.
What a self-sacrificing act! You're such a hero!
Charo misses you with his hit.
You bruise Charo with your slash.
Aemen slashes Jenie extremely hard.
Jenie bludgeons YOU very hard.
Cano crushes Manny extremely hard.
Manny cleaves Cano extremely hard.
Fraen massacres Xy with his slash.
Xy bludgeons Fraen extremely hard.
Vein massacres Sa with his crush.
Iopi slashes Virtue extremely hard.
Virtue crushes Iopi extremely hard.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
Aemen crashes into Jenie in a thundering collision, knocking him to the
ground!
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Hymak bruises Luze with his hit.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Charo focuses on Jenie and utters some strange words.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Virtue stands up.
Sa stands up.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Monalis utters some strange words.
Charo is shredded by shards of ice.
Virtue is shredded by shards of ice.
Vein is shredded by shards of ice.
Jenie is shredded by shards of ice.
Fraen is shredded by shards of ice.
Manny is shredded by shards of ice.
Luze is shredded by shards of ice.
Iopi crashes into Virtue in a thundering collision, knocking her to the
ground!
Sa utters some strange words.
Sa heals Sa.
Sa looks better.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Monalis misses Charo with her pierce.
Hymak misses Luze with his hit.
Your blow is absorbed by Charo's armor.
Aemen slashes Jenie very hard.
Jenie misses you with his bludgeon.
Cano crushes Manny very hard.
Manny cleaves Cano hard.
Fraen misses Xy with his slash.
Xy massacres Fraen with his bludgeon.
Vein crushes Sa extremely hard.
Iopi slashes Virtue extremely hard.
Virtue crushes Iopi extremely hard.
Luze slashes Sa extremely hard.
Luze crashes into Sa in a thundering collision, knocking her to the
ground!
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW> a
Naustramus focuses harshly on Jenie and utters some strange words.
Jenie receives the full blast of a lightning bolt from Naustramus ...
and is no
more.
You receive 0 experience.
Jenie is dead! R.I.P.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
The death cry of Jenie echoes from somewhere nearby...
Jenie stops following Luze.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW> ave
Fraen stands up.
Sa steps aside as Vein attempts a bash, stumbles, and falls flat on his
face.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW> ave he
Manny stands up.
Fraen crashes into Xy in a thundering collision, knocking him to the
ground!
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW> ave
head
Manny panics, and attempts to flee.
Manny flies west.
529H 116V 10281932X 8C [Me:V.Good] [Charo:Good] Mem:2 Exits:EW>
Charo panics, and attempts to flee.
Charo flies east.
529H 116V 10281932X 8C Mem:2 Exits:EW>
Hymak focuses harshly on Luze and utters some strange words.
Luze wavers under the impact of the lightning bolt sent by Hymak.
529H 116V 10281932X 8C Mem:2 Exits:EW> You are already standing.
529H 116V 10281932X 8C Mem:2 Exits:EW>
Scelesta flies in from the west.
529H 116V 10281932X 8C Mem:2 Exits:EW>
Manny flies in from the west.
529H 116V 10281932X 8C Mem:2 Exits:EW> aYou are not fighting.
529H 116V 10281932X 8C Mem:2 Exits:EW> asYou must focus on the battle
close at hand.
529H 116V 10281932X 8C Mem:2 Exits:EW> ass
The corpse doesn't seem to have what you are
looking for.
529H 116V 10281932X 8C Mem:2 Exits:EW> You must focus on the battle
close at hand.
529H 116V 10281932X 8C Mem:2 Exits:EW> You attempt to assist Xy.
You slash Fraen extremely hard.
529H 116V 10281932X 8C [Me:V.Good] [Xy:Fair] [Fraen:Fair] Mem:2
Exits:EW>
You step in front of Manny's assualt on Monalis.
You are sent sprawling as Manny crashes into you.
515H 116V 10281932X 8C [Me:V.Good] [Xy:Fair] [Fraen:Fair] Mem:2
Exits:EW>
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
515H 116V 10281932X 8C [Me:V.Good] [Xy:Fair] [Fraen:Fair] Mem:2
Exits:EW> av
Cano massacres Manny with his crush.
Manny massacres YOU with his cleave.
You slash Fraen very hard.
Fraen massacres Xy with his slash.
Xy bludgeons Fraen very hard.
Vein massacres Sa with his crush.
Iopi misses Virtue with his slash.
Virtue crushes Iopi extremely hard.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
Monalis utters some strange words.
Manny is shredded by shards of ice.
Monalis destroys Scelesta's mirror images.
Scelesta is shredded by shards of ice.
Virtue is shredded by shards of ice.
Vein is shredded by shards of ice.
Fraen is shredded by shards of ice.
Luze is shredded by shards of ice.
493H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
re
Charo flies in from the east.
493H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
reac
Aemen crashes into Charo in a thundering collision, knocking him to the
ground!
493H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
reac
Naustramus focuses harshly on Scelesta and utters some strange words.
Scelesta wavers under the impact of the lightning bolt sent by
Naustramus.
493H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
reac
Hymak focuses harshly on Luze and utters some strange words.
Luze wavers under the impact of the lightning bolt sent by Hymak.
493H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
reac xy
ave le
Aemen slashes Charo.
Charo misses Aemen with his hit.
Monalis misses Manny with her pierce.
Cano crushes Manny extremely hard.
Manny massacres YOU with his cleave.
You slash Fraen hard.
Fraen misses Xy with his slash.
Xy bludgeons Fraen extremely hard.
Vein crushes Sa extremely hard.
Iopi misses Virtue with his slash.
Virtue crushes Iopi extremely hard.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
Iopi crashes into Virtue in a thundering collision, knocking her to the
ground!
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
ave legs
Xy stands up.
Vein stands up.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Scelesta panics, and attempts to flee.
Scelesta flies east.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Fraen crashes into Xy in a thundering collision, knocking him to the
ground!
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Sa steps aside as Vein attempts a bash, stumbles, and falls flat on his
face.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Monalis focuses harshly on Manny and utters some strange words.
Flesh burns as Monalis enshrouds Manny in a cloak of flames.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Hymak focuses harshly on Luze and utters some strange words.
Luze wavers under the impact of the lightning bolt sent by Hymak.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Sa steps aside as Luze attempts a bash, stumbles, and falls flat on his
face.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Scelesta flies in from the east.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Scelesta focuses harshly on Monalis and utters some strange words.
The sound of bones cracking echoes as Scelesta's force bolt slams into
Monalis.
472H 116V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Aemen slashes Charo hard.
Aemen slashes Charo very hard.
Charo misses Aemen with his hit.
Cano crushes Manny extremely hard.
Manny massacres YOU with his cleave.
You slash Fraen very hard.
Fraen misses Xy with his slash.
Xy bludgeons Fraen very hard.
Vein massacres Sa with his crush.
Iopi slashes Virtue extremely hard.
Virtue misses Iopi with her crush.
Luze massacres Sa with his slash.
Sa misses Luze with her hit.
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
Naustramus focuses harshly on Charo and utters some strange words.
Charo is caught in some of Naustramus's acid!
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Sa stands up.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Sa focuses harshly on Scelesta and utters some strange words.
Scelesta cries out in pain as Sa grabs her.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Charo stands up.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Charo focuses on Manny and utters some strange words.
Charo heals Manny.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
Aemen crashes into Charo in a thundering collision, knocking him to the
ground!
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c
Monalis focuses harshly on Manny and utters some strange words.
Flesh burns as Monalis enshrouds Manny in a cloak of flames.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c '
Hymak focuses harshly on Luze and utters some strange words.
Luze wavers under the impact of the lightning bolt sent by Hymak.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c 'm h' Huh?!
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c 'm h' You can't do that while
sitting.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c 'm h'
Scelesta panics, and attempts to flee.
Scelesta flies west.
466H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:Bad] Mem:2 Exits:EW>
c 'm h'
Aemen slashes Charo.
Cano crushes Manny very hard.
Manny cleaves YOU extremely hard.
You should probably stand up!
You slash Fraen extremely hard.
Fraen misses Xy with his slash.
Xy bludgeons Fraen very hard.
Vein crushes Sa extremely hard.
Iopi slashes Virtue extremely hard.
Virtue crushes Iopi extremely hard.
Luze slashes Sa extremely hard.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h' scel
Iopi crashes into Virtue in a thundering collision, knocking her to the
ground!
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h' scelest
Xy stands up.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h' scelesta
Who should the spell be
cast upon?
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW>
Sa steps aside as Fraen attempts a bash, stumbles, and falls flat on
his face.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW>
Vein stands up.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW>
Vein crashes into Sa in a thundering collision, knocking her to the
ground!
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> st
Monalis focuses harshly on Manny and utters some strange words.
Huge flames burn Manny from above.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> cYou stand up.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW>
Xy attempts to strike at Fraen with his clavariaceae.
Xy bludgeons Fraen extremely hard.
Hymak focuses harshly on Luze and utters some strange words.
Luze is caught in some of Hymak's acid!
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c '
Luze stands up.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h'
Luze panics, and attempts to flee.
Luze leaves east.
447H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h' charo
The air suddenly ceases its violent rush.
Sa misses Vein with her hit.
Aemen slashes Charo extremely hard.
Charo misses Aemen with his hit.
Cano massacres Manny with his crush.
Manny cleaves YOU extremely hard.
Fraen misses Xy with his slash.
Xy massacres Fraen with his bludgeon.
Vein massacres Sa with his crush.
Iopi slashes Virtue extremely hard.
Virtue crushes Iopi extremely hard.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:2
Exits:EW> c 'm h' charo
You utter the words,
'mental haze'
With a dumb look on his face, Charo tries to concentrate.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Luze arrives from the east.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Manny steps aside as Cano attempts a bash, stumbles, and falls flat on
his face.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Luze crashes into Xy in a thundering collision, knocking him to the
ground!
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt
Charo steps aside as Aemen attempts a bash, stumbles, and falls flat on
her
face.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Monalis focuses harshly on Manny and utters some strange words.
Huge flames burn Manny from above.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> ave
Manny stands up.
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> ave le
Naustramus focuses harshly on Charo and utters some strange words.
Charo is caught in some of Naustramus's acid!
430H 152V 10281932X 8C [Me:Good] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> ave legs
Luze slashes Xy very hard.
Sa misses Vein with her hit.
Aemen slashes Charo very hard.
Charo misses Aemen with his hit.
Cano crushes Manny very hard.
Manny cleaves YOU extremely hard.
Fraen massacres Xy with his slash.
Xy bludgeons Fraen extremely hard.
Vein massacres Sa with his crush.
Iopi slashes Virtue very hard.
Virtue crushes Iopi extremely hard.
Manny panics, and attempts to flee.
Manny flies east.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> ave legs
You focus your purity on
Fraen's leg!
You force Fraen to the ground.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Virtue steps aside as Iopi attempts a bash, stumbles, and falls flat on
his
face.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Manny flies in from the east.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Charo stands up.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Hymak misses Fraen with his hit.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Charo panics, and attempts to flee.
Charo flies east.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Sa steps aside as Vein attempts a bash, stumbles, and falls flat on his
face.
Sa stands up.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt
You step in front of Manny's assualt on Monalis.
You step aside as Manny tries to bash you, causing him to tumble and
fall face
down.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Sa panics, and attempts to flee.
Sa flies west.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt h
Virtue stands up.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt haz
Virtue panics, and attempts to flee.
Virtue flies east.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt hazed cha
Virtue flies in from the east.
411H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt hazed charo
Manny cleaves YOU extremely hard.
Hymak misses Fraen with his hit.
Luze misses Xy with his slash.
You slash Fraen extremely hard.
Fraen misses Xy with his slash.
Xy massacres Fraen with his bludgeon.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Virtue flies west.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> Monalis misses Fraen with
her pierce.
You tell your group 'hazed charo'
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW>
Cano stands up.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> gt
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Bad] Mem:3
Exits:EW> g
Hymak focuses harshly on Fraen and utters some strange words.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW>
Aemen stands up.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW>
Xy stands up.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW>
Xy attempts to strike at Fraen with his clavariaceae.
Xy massacres Fraen with his bludgeon.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW> q
You couldn't find what you
were looking for.
396H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW>
Cano crushes Manny extremely hard.
Monalis misses Fraen with her pierce.
Manny cleaves YOU extremely hard.
Luze misses Xy with his slash.
You slash Fraen extremely hard.
Fraen slashes Xy very hard.
Xy bludgeons Fraen extremely hard.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW> strike
You attempt to strike at
Fraen with your sword.
You slash Fraen extremely hard.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Awful] Mem:3
Exits:EW>
Luze stops using a clear cube.
Luze grabs a sealed scroll.
Luze recites a sealed scroll.
Luze heals Fraen.
Fraen suddenly becomes very quiet.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:V.Good] Mem:3
Exits:EW>
Fraen stands up.
Monalis focuses harshly on Fraen and utters some strange words.
Flesh burns as Monalis enshrouds Fraen in a cloak of flames.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
get all c
Vein stands up.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
get all corp
Naustramus focuses harshly on Manny and utters some strange words.
Manny wavers under the impact of the lightning bolt sent by Naustramus.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
get all corpse
Hymak focuses harshly on Fraen and utters some strange words.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
Aemen recites a glowing scroll of recall.
Aemen disappears.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
Vein misses Xy with his crush.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
Xy yells and leaps into the fray.
376H 152V 10281932X 8C [Me:Fair] [Xy:Fair] [Fraen:Good] Mem:3 Exits:EW>
Vein misses Xy with his crush.
Cano crushes Manny very hard.
Cano crushes Manny very hard.
Manny cleaves YOU extremely hard.
Luze misses Xy with his slash.
You slash Fraen hard.
Fraen slashes Xy very hard.
Xy bludgeons Fraen extremely hard.
356H 152V 10281932X 8C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
You get a glowing scroll of
recall from the corpse of Jenie.
You get the staff of the warlock from the corpse of Jenie.
You get a small component pouch from the corpse of Jenie.
You are zapped by a black mage robe and instantly drop it.
You get a plain pair of reading glasses from the corpse of Jenie.
You get a ragged, stuffed bear from the corpse of Jenie.
You are zapped by an emerald inset amulet and instantly drop it.
You get a lucky bone charm from the corpse of Jenie.
You are zapped by a ruby and platinum ring and instantly drop it.
You get a steel coin from the corpse of Jenie.
There was 1 coin.
You get a waterskin from the corpse of Jenie.
You get a smoked Tarsis ham from the corpse of Jenie.
You get a dark onyx plate from the corpse of Jenie.
You are zapped by a skull mask and instantly drop it.
You get some clean bandages from the corpse of Jenie.
You get a crystal shard necklace from the corpse of Jenie.
You get a crystal shard necklace from the corpse of Jenie.
You get a crystal shard necklace from the corpse of Jenie.
You get a small canteen from the corpse of Jenie.
You get a small canteen from the corpse of Jenie.
You get a small canteen from the corpse of Jenie.
You get a small canteen from the corpse of Jenie.
You get a crystal shard necklace from the corpse of Jenie.
You get a small wooden chest from the corpse of Jenie.
You get a crystal shard necklace from the corpse of Jenie.
You get a tattered old scroll from the corpse of Jenie.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
Xy steps aside as Fraen attempts a bash, stumbles, and falls flat on
his face.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
Monalis tells your group 'heal people'
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
Monalis utters some strange words.
A huge swarm of biting, stinging insects fills the air.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
ge
Cano crashes into Manny in a thundering collision, knocking him to the
ground!
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Good] Mem:3 Exits:EW>
get al
Hymak focuses harshly on Fraen and utters some strange words.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Fair] Mem:3 Exits:EW>
get all corps
Sa flies in from the west.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Fair] Mem:3 Exits:EW>
get all corpse
The corpse doesn't seem to
have what you are looking for.
356H 152V 10281932X 9C [Me:Fair] [Xy:Bad] [Fraen:Fair] Mem:3 Exits:EW>
Sa screams as a swarm of insects engulfs her.
Manny seems unaffected by Monalis's swarm of insects.
Luze seems unaffected by Monalis's swarm of insects.
Vein screams as a swarm of insects engulfs him.
Fraen screams as a swarm of insects engulfs him.
You step in front of Monalis and direct your attacks at Sa.
What a self-sacrificing act! You're such a hero!
Sa misses you with her hit.
You bruise Sa with your slash.
Vein crushes Xy extremely hard.
Cano crushes Manny very hard.
Cano crushes Manny very hard.
Manny cleaves YOU extremely hard.
Luze slashes Xy extremely hard.
Fraen slashes Xy very hard.
Xy bludgeons Fraen extremely hard.
Xy steps aside as Vein attempts a bash, stumbles, and falls flat on his
face.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW>
Xy attempts to strike at Fraen with his clavariaceae.
Xy massacres Fraen with his bludgeon.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> re
Iopi stands up.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> r
Naustramus focuses harshly on Manny and utters some strange words.
Naustramus aims a magic missile at Manny, who staggers under the blow.
Naustramus aims a magic missile at Manny, who staggers under the blow.
Naustramus aims a magic missile at Manny, who staggers under the blow.
Naustramus aims a magic missile at Manny, who staggers under the blow.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> inv
Luze panics, and attempts to flee.
Luze leaves west.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> st
Monalis focuses harshly on Fraen and utters some strange words.
Huge flames burn Fraen from above.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> st
l
Iopi crashes into Manny in a thundering collision, knocking him to the
ground!
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> look
Sa focuses on Xy and utters some strange words.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> look
ave l
Luze arrives from the west.
336H 152V 10281932X 9C [Me:Fair] [Sa:Fair] Mem:3 Exits:EW> ave leg
Luze screams as a swarm of insects engulfs him.
Sa seems unaffected by Monalis's swarm of insects.
Manny seems unaffected by Monalis's swarm of insects.
Vein seems unaffected by Monalis's swarm of insects.
Fraen screams as a swarm of insects engulfs him.
You step in front of Monalis and direct your attacks at Luze.
What a self-sacrificing act! You're such a hero!
You raise your shield and block Luze's blow.
You slash Luze hard.
Iopi massacres Manny with his slash.
Vein misses Xy with his crush.
Cano crushes Manny very hard.
Cano massacres Manny with his crush.
Manny cleaves YOU extremely hard.
Fraen slashes Xy extremely hard.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> ave legs
Xy strikes at Fraen, but misses completely.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Luze crashes into Xy in a thundering collision, knocking him to the
ground!
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Naustramus focuses harshly on Manny and utters some strange words.
Naustramus aims a magic missile at Manny, who staggers under the blow.
Manny is stunned, but will likely regain consciousness again.
The magic missile sent by Naustramus causes Manny to stagger and
collapse in a
lifeless heap.
You receive 0 experience.
Manny is dead! R.I.P.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
The death cry of Manny echoes from somewhere nearby...
Manny sinks gently to the ground.
Manny stops following Luze.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Fraen stands up.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Hymak focuses harshly on Fraen and utters some strange words.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
Hymak aims a magic missile at Fraen, who staggers under the blow.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Fraen crashes into Sa in a thundering collision, knocking her to the
ground!
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> get
Monalis tells your group 'heal xy'
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> get all
Monalis focuses harshly on Fraen and utters some strange words.
Flesh burns as Monalis enshrouds Fraen in a cloak of flames.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> get all
corpse
Cano gets a beautiful violet rose from the corpse of Manny.
Cano gets a black granite axe from the corpse of Manny.
Cano gets a black wrist band from the corpse of Manny.
Cano gets a charred leather belt from the corpse of Manny.
Cano gets a small green quiver from the corpse of Manny.
Cano gets a bronze shield from the corpse of Manny.
Cano gets some midnight leather sleeves from the corpse of Manny.
Cano gets a pair of elven boots from the corpse of Manny.
Cano gets a pair of woodsman's leggings from the corpse of Manny.
Cano gets a suit of darkened tusk scalemail from the corpse of Manny.
Cano gets the seal of Balifor from the corpse of Manny.
Cano gets a large pile of coins from the corpse of Manny.
Cano gets some slimy pitch black pants from the corpse of Manny.
Cano gets a small wooden chest from the corpse of Manny.
Cano gets a glowing scroll of recall from the corpse of Manny.
Cano gets a glowing scroll of recall from the corpse of Manny.
Cano gets a glowing scroll of recall from the corpse of Manny.
Cano gets a glowing scroll of recall from the corpse of Manny.
Cano gets a pair of woodsman's boots from the corpse of Manny.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> Luze seems
unaffected by Monalis's
swarm of insects.
Sa screams as a swarm of insects engulfs her.
Vein screams as a swarm of insects engulfs him.
Fraen screams as a swarm of insects engulfs him.
The rally cry fades.
Luze misses you with his slash.
You slash Luze extremely hard.
Sa misses you with her hit.
Vein misses Xy with his crush.
Fraen slashes Xy very hard.
Xy bludgeons Fraen.
You are carrying:
a tattered old scroll
a crystal shard necklace..it glows dimly
a small wooden chest
a crystal shard necklace..it glows dimly
a small canteen [4]
a crystal shard necklace..it glows dimly [3]
some clean bandages
a dark onyx plate (invisible)
a smoked Tarsis ham
a waterskin
a lucky bone charm..it glows dimly
a ragged, stuffed bear
a plain pair of reading glasses
a small component pouch
the staff of the warlock..it glows dimly
a glowing scroll of recall..it glows dimly
a silver elixir
an ancient elven blade
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> You are
already standing.
Vein stands up.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> Winding
Path
This small cobbled path winds its way into the dark forest. You have
heard story from the people of Solace not to enter the Darken Wood that
exists outside of town. But the woods seem quite harmless right now.
The corpse of Manny is lying here.
A swarm of insects fills the area.
A mask made of part of a skull lies here on the ground.
A fine ruby in a platinum ring lies here...it glows dimly
A small amulet inset with an emerald lies here.
The black robes of a mage of the Conclave lie here.
The corpse of Jenie is lying here.
Luze is standing here, fighting YOU. (red aura)
Sa 'Sa, Pretty Pretty Princess is sitting here, fighting YOU. (flying)
Naustramus the Male Theiwar Dwarf is standing here. (flying)
. . . is followed by a hovering ball of light.
Hymak the Male Gnome is standing here, fighting Fraen. (flying)
. . . is followed by a hovering ball of light.
Xy Zee, RoT Inc is sitting here, fighting Fraen. (flying)
Iopi Ka'Bash is standing here. (flying)
Cano is standing here. (flying)
Monalis A. Conscientious Flower Girl of RoT is standing here, fighting
Fraen.
(flying) (red aura)
Vein the Male Human is standing here, fighting Xy. (flying) (red aura)
Fraen de Mynd is standing here, fighting Xy. (flying)
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> Give your
self a chance to recover.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> The corpse
doesn't seem to have what
you are looking for.
Vein panics, and attempts to flee.
Vein flies east.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> You get a
leather traveling pack
from the corpse of Manny.
You get a torch from the corpse of Manny.
You get a rough edged axe from the corpse of Manny.
You get a glowing scroll of recall from the corpse of Manny.
You get an ancient yew bow from the corpse of Manny.
You get a pair of sleek black boots from the corpse of Manny.
You get a thick leather belt from the corpse of Manny.
You get a backpack from the corpse of Manny.
You get a large pole axe from the corpse of Manny.
You get a small wooden chest from the corpse of Manny.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Hymak focuses harshly on Fraen and utters some strange words.
Fraen is caught in some of Hymak's acid!
Naustramus focuses harshly on Fraen and utters some strange words.
Naustramus aims a magic missile at Fraen, who staggers under the blow.
Fraen is stunned, but will likely regain consciousness again.
Naustramus aims a magic missile at Fraen, who staggers under the blow.
Fraen is mortally wounded, and will die soon, if not aided.
The magic missile sent by Naustramus causes Fraen to stagger and
collapse in a
lifeless heap.
You receive 0 experience.
Fraen is dead! R.I.P.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
The death cry of Fraen echoes from somewhere nearby...
Fraen stops following Luze.
317H 152V 10281932X 9C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> You get a
pile of coins from the
corpse of Fraen.
There were 11 coins.
317H 152V 10281932X 20C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW>
Iopi gets a sword carved from crystal from the corpse of Fraen.
Iopi gets a copper wrist guard from the corpse of Fraen.
Iopi gets a copper wrist guard from the corpse of Fraen.
Iopi gets a woodsman's sash from the corpse of Fraen.
317H 152V 10281932X 20C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> get
Monalis tells your group 'heal xy'
317H 152V 10281932X 20C [Me:Fair] [Luze:Bad] Mem:3 Exits:EW> get all
Iopi crashes into Luze in a thundering collision, knocking him to the
ground!
317H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> get all
c
Monalis gets a heavy cloak from the corpse of Fraen.
Monalis gets a shield of Tirabot from the corpse of Fraen.
Monalis gets gloves of wretchedness from the corpse of Fraen.
Monalis is zapped by a heavy steel helm and instantly drops it.
Monalis gets a piece of sweet bread from the corpse of Fraen.
Monalis gets a wicked long sword from the corpse of Fraen.
Monalis gets a milky potion of see invisible from the corpse of Fraen.
Monalis gets a milky potion of see invisible from the corpse of Fraen.
Monalis gets a black long sword from the corpse of Fraen.
Monalis gets a black and crooked staff from the corpse of Fraen.
Monalis gets a bronze shield from the corpse of Fraen.
Monalis gets a bronze bottle from the corpse of Fraen.
Monalis gets a glowing scroll of recall from the corpse of Fraen.
Monalis gets a glowing scroll of recall from the corpse of Fraen.
Monalis gets a light silver dagger from the corpse of Fraen.
Monalis gets an elixir of health from the corpse of Fraen.
Monalis gets an iron ration from the corpse of Fraen.
Monalis gets an iron ration from the corpse of Fraen.
317H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> get all
corp
Luze seems unaffected by Monalis's swarm of insects.
Sa screams as a swarm of insects engulfs her.
Monalis misses Luze with her pierce.
Monalis misses Luze with her pierce.
Iopi slashes Luze extremely hard.
You raise your shield and block Luze's blow.
You slash Luze extremely hard.
Sa misses you with her hit.
317H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> get all
corpse
Cano drops a glowing scroll of recall.
Cano drops a glowing scroll of recall.
Cano drops a glowing scroll of recall.
Cano drops a glowing scroll of recall.
Cano drops a glowing scroll of recall.
Cano drops a glowing scroll of recall.
317H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> get all
corpse
The corpse doesn't seem to have
what you are looking for.
317H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> ave
Cano crushes YOU very hard.
304H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW> ave legs
You focus your purity on Luze's
leg!
You focus on Luze's legs, but are thwarted.
304H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW>
Monalis focuses harshly on Luze and utters some strange words.
Flesh burns as Monalis enshrouds Luze in a cloak of flames.
304H 152V 10281932X 20C [Me:Fair] [Luze:V.Bad] Mem:3 Exits:EW>
Naustramus focuses harshly on Luze and utters some strange words.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
304H 152V 10281932X 20C [Me:Fair] [Luze:Awful] Mem:3 Exits:EW> gr
The swarm of insects dissipates.
Cano crushes YOU very hard.
Cano crushes YOU very hard.
Iopi slashes Luze hard.
Luze misses you with his slash.
You massacre Luze with your slash.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> group
Xy tells your group 'heal me'
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Xy stands up.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> look
Cano unsuccessfully tries to save Luze.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> Your
group of 9 members consists
of:
Member Hits Move Position Fly Inv Water Light Mem
-----------------------------------------------------------------------
-
Ollip bad rested fighting Y N N 1 3
Monalis good rested fighting Y N N 2 20
Cano good rested fighting Y N N 0 0
Iopi fair rested fighting Y N N 0 0
Aemen v.good rested standing Y N N 0 0
Xy bad rested standing Y N N 2 6
Sa bad rested fighting Y N N 1 11
Hymak good rested standing Y N N 1 9
Naustramus good rested standing Y N N 1 8
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> Winding
Path
This small cobbled path winds its way into the dark forest. You have
heard story from the people of Solace not to enter the Darken Wood that
exists outside of town. But the woods seem quite harmless right now.
A glowing scroll has carelessly been left here...it glows dimly [6]
A heavy steel helm lies discarded on the ground.
The corpse of Fraen is lying here.
The corpse of Manny is lying here.
A mask made of part of a skull lies here on the ground.
A fine ruby in a platinum ring lies here...it glows dimly
A small amulet inset with an emerald lies here.
The black robes of a mage of the Conclave lie here.
The corpse of Jenie is lying here.
Luze is sitting here, fighting YOU. (red aura)
Sa 'Sa, Pretty Pretty Princess is sitting here, fighting YOU. (flying)
Naustramus the Male Theiwar Dwarf is standing here. (flying)
. . . is followed by a hovering ball of light.
Hymak the Male Gnome is standing here. (flying)
. . . is followed by a hovering ball of light.
Xy Zee, RoT Inc is standing here. (flying)
Iopi Ka'Bash is standing here, fighting Luze. (flying)
Cano is standing here, fighting YOU. (flying)
Monalis A. Conscientious Flower Girl of RoT is standing here, fighting
Luze.
(flying) (red aura)
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Monalis tells your group 'bash luze'
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Hymak misses Luze with his hit.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> q
Naustramus focuses harshly on Luze and utters some strange words.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
Naustramus aims a magic missile at Luze, who staggers under the blow.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> q
Sa stands up.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> You
couldn't find what you were
looking for.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Sa panics, and attempts to flee.
Sa flies west.
279H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Hymak misses Luze with his hit.
Cano crushes YOU very hard.
Cano crushes YOU very hard.
Iopi slashes Luze very hard.
Luze slashes YOU extremely hard.
You slash Luze extremely hard.
Iopi crashes into Luze in a thundering collision, knocking him to the
ground!
238H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> q
You couldn't find what you were
looking for.
238H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW>
Sa flies in from the west.
238H 152V 10281932X 20C [Me:Bad] [Luze:Awful] Mem:3 Exits:EW> strike
You attempt to strike at Luze
with your sword.
You slash Luze extremely hard.
Luze is mortally wounded, and will die soon, if not aided.
238H 152V 10281932X 20C [Me:Bad] [Luze:Dying] Mem:3 Exits:EW>
Xy obliterates Luze with his bludgeon.
You receive 0 experience.
Luze is dead! R.I.P.
238H 152V 10281932X 20C [Me:Bad] [Luze:Dying] Mem:3 Exits:EW>
The death cry of Luze echoes from somewhere nearby...
Charo stops following Luze.
Vein stops following Luze.
Virtue stops following Luze.
Scelesta stops following Luze.
You direct your attention to Cano.
238H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW>
Naustramus gets a pile of coins from the corpse of Luze.
238H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW>
Monalis gets a huge iron broad sword from the corpse of Luze.
Monalis gets a jade belt from the corpse of Luze.
Monalis gets a heavy cloak from the corpse of Luze.
Monalis gets a leather shield with metal straps from the corpse of
Luze.
Monalis gets a pair of charred black plate boots from the corpse of
Luze.
Monalis gets a pair of charred platemail legplates from the corpse of
Luze.
238H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW>
You slash Cano hard.
Cano misses you with his crush.
Cano crushes YOU very hard.
224H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW> a
Naustramus gets a black battle armour with red trim from the corpse of
Luze.
Naustramus gets a royal dwarven cloak from the corpse of Luze.
Naustramus gets a plain gold ring from the corpse of Luze.
Naustramus gets a small grey ring from the corpse of Luze.
Naustramus gets a clear cube from the corpse of Luze.
Naustramus gets a small canteen from the corpse of Luze.
Naustramus gets a small canteen from the corpse of Luze.
Naustramus gets a loaf of rye bread from the corpse of Luze.
Naustramus gets an aquamarine potion from the corpse of Luze.
Naustramus gets a glowing scroll of recall from the corpse of Luze.
Naustramus gets a glowing scroll of recall from the corpse of Luze.
Naustramus gets a flask of clear liquid from the corpse of Luze.
Naustramus gets a large waterskin from the corpse of Luze.
Naustramus gets a large first-aid kit from the corpse of Luze.
Naustramus gets a waterskin from the corpse of Luze.
224H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW>
Monalis says 'loot'
224H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW> fle
The corpse doesn't seem to have
what you are looking for.
224H 152V 10281932X 20C [Me:Bad] [Cano:Good] Mem:3 Exits:EW> You flee
head over heels.
Winding Path
This small cobbled path winds its way into the dark forest. You have
heard story from the people of Solace not to enter the Darken Wood that
exists outside of town. But the woods seem quite harmless right now.
224H 151V 10281932X 20C Mem:3 Exits:ES> scan
Looking north:
You see nothing special.
Looking east:
You see nothing special.
Sa 'Sa, Pretty Pretty Princess is standing here. (flying)
Naustramus the Male Theiwar Dwarf is standing here. (flying)
. . . is followed by a hovering ball of light.
Hymak the Male Gnome is standing here. (flying)
. . . is followed by a hovering ball of light.
Xy Zee, RoT Inc is standing here. (flying)
Iopi Ka'Bash is standing here. (flying)
Cano is standing here. (flying)
Monalis A. Conscientious Flower Girl of RoT is standing here. (flying)
(red
aura)
Looking south:
You see nothing special.
Looking west:
You see nothing special.
Looking up:
You see nothing special.
Looking down:
You see nothing special.
224H 151V 10281932X 20C Mem:3 Exits:ES> e
Winding Path
This small cobbled path winds its way into the dark forest. You have
heard story from the people of Solace not to enter the Darken Wood that
exists outside of town. But the woods seem quite harmless right now.
The corpse of Luze is lying here.
A glowing scroll has carelessly been left here...it glows dimly [6]
A heavy steel helm lies discarded on the ground.
The corpse of Fraen is lying here.
The corpse of Manny is lying here.
A mask made of part of a skull lies here on the ground.
A fine ruby in a platinum ring lies here...it glows dimly
A small amulet inset with an emerald lies here.
The black robes of a mage of the Conclave lie here.
The corpse of Jenie is lying here.
Sa 'Sa, Pretty Pretty Princess is standing here. (flying)
Naustramus the Male Theiwar Dwarf is standing here. (flying)
. . . is followed by a hovering ball of light.
Hymak the Male Gnome is standing here. (flying)
. . . is followed by a hovering ball of light.
Xy Zee, RoT Inc is standing here. (flying)
Iopi Ka'Bash is standing here. (flying)
Cano is standing here. (flying)
Monalis A. Conscientious Flower Girl of RoT is standing here. (flying)
(red
aura)
224H 150V 10281932X 20C Mem:3 Exits:EW> 'loot now
You say 'loot now'

Vote On This Log ( ) ( ) ( ) ( ) ( ) (*) ( ) ( ) ( ) ( ) ( )
-5  -4  -3  -2  -1  0   1   2   3   4   5
Vote

Hated It


Loved It

References

1. file:///index.php?option=forgot
2. file:///index.php?option=register
3. file:///index.php?option=recentlogs
4. file:///index.php?option=recentlogs&lognbr=10
5. file:///index.php?option=recentlogs&lognbr=0
6. file:///index.php?option=toplogs
7. file:///index.php?option=mostviewedlogs
8. file:///index.php?option=uploadlog
9. file:///index.php?option=collections
10. file:///index.php?option=quicklist
11. http://arcticmud.blogspot.com/
12. http://mudlogs.foghaven.net/
13. http://pollux.ldz.lv/~punk/upload/index.php
14. http://tirannon.tky.hut.fi/arctic/
15. http://normstorm.com/template/m-news.html
16. http://mud.arctic.org/forum/
17. http://mud.arctic.org/
18. http://www.topmudsites.com/cgi-bin/topmuds/rankem.cgi?id=just
19. file:///index.php?option=poll&action=new
20. file:///index.php?option=poll&action=listpolls
